{
  "tactics": {
    "TA0100": {
      "name": "Коллекция",
      "description": "Злоумышленник пытается собрать интересующие данные и предметные знания о вашей среде ICS, чтобы определить свою цель.\n\nСбор состоит из методов, которые злоумышленники используют для сбора знаний о предметной области и получения контекстной обратной связи в среде АСУ ТП. Эта тактика часто применяется в рамках [Обнаружения](https://attack.mitre.org/tactics/TA0102) для сбора данных о системах управления и интересующих целях, которые могут быть использованы для достижения цели противника. Примеры этих методов включают наблюдение за рабочими состояниями, создание снимков экрана, определение уникальных ролей устройств, а также сбор схем системы и схем. Сбор этих данных может сыграть ключевую роль в планировании, выполнении и даже пересмотре атаки, нацеленной на АСУ ТП. Методы сбора зависят от категорий целевых данных, которые могут включать в себя специфичные для протокола, специфичные для устройства, а также конфигурации и функции конкретных процессов. Собранная информация может относиться к комбинации данных, связанных с системой, диспетчерскими данными, устройствами и сетью, которые концептуально подпадают под высокий, средний и низкий уровни плановых операций. Например, хранилища информации о заводских данных на высоком уровне или программы для конкретных устройств на низком уровне. Конфиденциальные планы этажей, руководства к устройствам поставщиков и другие справочные материалы также могут подвергаться риску и быть опубликованы в Интернете или иным образом общедоступны."
    },
    "TA0101": {
      "name": "Командование и контроль",
      "description": "Злоумышленник пытается взаимодействовать и контролировать скомпрометированные системы, контроллеры и платформы, имеющие доступ к вашей среде АСУ ТП.\n\nКомандование и контроль состоят из методов, которые злоумышленники используют для связи и отправки команд скомпрометированным системам, устройствам, контроллерам и платформам со специализированными приложениями, используемыми в средах АСУ ТП. Примеры этих специализированных коммуникационных устройств включают человеко-машинные интерфейсы (HMI), архиваторы данных, серверы SCADA и инженерные рабочие станции (EWS). Злоумышленники часто стремятся использовать общедоступные ресурсы и имитировать ожидаемый сетевой трафик, чтобы избежать обнаружения и подозрений. Например, часто используемые порты и протоколы в средах АСУ ТП и даже ожидаемые ИТ-ресурсы в зависимости от целевой сети. Командование и контроль могут осуществляться с разной степенью скрытности, часто в зависимости от структуры сети и защиты жертвы."
    },
    "TA0102": {
      "name": "Открытие",
      "description": "Злоумышленник ищет информацию для оценки и определения своих целей в вашей среде.\n\nОбнаружение состоит из методов, которые злоумышленники используют для исследования вашей среды АСУ ТП и получения знаний о внутренней сети, устройствах системы управления и взаимодействии их процессов. Эти методы помогают противникам наблюдать за окружающей средой и определять следующие шаги для выбора цели и бокового движения. Они также позволяют злоумышленникам исследовать то, что они могут контролировать, и получать представление о взаимодействии между различными процессами системы управления. Методы обнаружения часто представляют собой акт проникновения в окружающую среду, который позволяет противнику сориентироваться, прежде чем решить, как действовать. Злоумышленники могут использовать методы обнаружения, которые приводят к сбору, чтобы определить, какую пользу имеющиеся ресурсы принесут их текущей цели. Для достижения этой цели по сбору информации после компрометации часто используется сочетание встроенных средств связи и функций устройства, а также пользовательских инструментов."
    },
    "TA0103": {
      "name": "Уклонение",
      "description": "Противник пытается обойти средства защиты.\n\nУклонение состоит из методов, которые противники используют, чтобы избежать технической защиты на протяжении всей своей кампании. Методы уклонения включают удаление индикаторов компрометации, подмену сообщений и использование уязвимостей программного обеспечения. Злоумышленники также могут использовать и злоупотреблять доверенными устройствами и процессами, чтобы скрыть свою активность, возможно, маскируясь под главные устройства или собственное программное обеспечение. Методы уклонения от защиты для этой цели часто носят более пассивный характер."
    },
    "TA0104": {
      "name": "Исполнение",
      "description": "Злоумышленник пытается запустить код или несанкционированным образом манипулировать системными функциями, параметрами и данными.\n\nВыполнение состоит из методов, которые приводят к запуску кода, контролируемого злоумышленником, в локальной или удаленной системе, устройстве или другом активе. Это выполнение также может зависеть от незнания конечных пользователей или манипулирования режимами работы устройства для запуска. Злоумышленники могут заразить удаленные цели запрограммированными исполняемыми файлами или вредоносными файлами проектов, которые действуют в соответствии с заданным поведением и могут тонким образом изменить ожидаемое поведение устройства. Команды для выполнения также могут быть выданы из интерфейсов командной строки, API, графических интерфейсов или других доступных интерфейсов. Методы запуска вредоносного кода также могут сочетаться с методами других тактик, в частности, для помощи сети [Discovery](https://attack.mitre.org/tactics/TA0102) и [Collection](https://attack.mitre.org/tactics/TA0100), воздействия на операции и подавления функций реагирования."
    },
    "TA0105": {
      "name": "Влияние",
      "description": "Злоумышленник пытается манипулировать, прервать или уничтожить ваши системы АСУ, данные и окружающую среду.\n\nВоздействие состоит из методов, которые злоумышленники используют для нарушения, компрометации, уничтожения и манипулирования целостностью и доступностью операций, процессов, устройств и данных системы управления. Эти методы охватывают влияние и последствия, возникающие в результате попыток противника атаковать среду АСУ ТП или косвенно воздействующих на нее. Методы воздействия могут привести к более мгновенному нарушению процессов управления и оператора или могут привести к более долгосрочному повреждению или потере среды АСУ ТП и связанных с ней операций. Злоумышленник может использовать методы [Нарушения управления процессами] (https://attack.mitre.org/tactics/TA0106), которые часто проявляются в более очевидных воздействиях на операции, или методы [Нарушения управления процессами] (https://attack.mitre.org/tactics/TA0106), чтобы помешать мерам безопасности и тревогам, чтобы довести до конца и обеспечить прикрытие для Воздействия. В некоторых сценариях процессы системы управления могут функционировать должным образом, но могут быть изменены для достижения цели противника в течение более длительного периода времени. Эти методы могут использоваться злоумышленниками для достижения своей конечной цели или для прикрытия нарушения конфиденциальности.\n\n[Потеря производительности и доходов](https://attack.mitre.org/techniques/T0828), [Кража оперативной информации](https://attack.mitre.org/techniques/T0882) и [Ущерб имуществу](https://attack.mitre.org/techniques/T0879) призваны охватить некоторые из более точных целей злоумышленников в целевых и нецелевые атаки. Эти методы сами по себе не обязательно обнаруживаются, но связанное с ними поведение противника потенциально может быть смягчено и/или обнаружено."
    },
    "TA0106": {
      "name": "Ухудшение контроля процесса",
      "description": "Злоумышленник пытается манипулировать, отключить или повредить процессы физического управления.\n\nНарушение контроля процессов состоит из методов, которые злоумышленники используют для нарушения логики управления и оказания определяющего воздействия на процессы, контролируемые в целевой среде. Цели, представляющие интерес, могут включать в себя активные процедуры или параметры, которые манипулируют физической средой. Эти методы могут также включать предотвращение или манипулирование элементами отчетности и логикой управления. Если злоумышленник изменил функциональность процесса, он также может скрыть результаты, которые часто проявляются в их влиянии на результат продукта или окружающую среду. Прямой физический контроль, который осуществляют эти методы, также может угрожать безопасности операторов и последующих пользователей, что может привести к появлению механизмов реагирования. Злоумышленники могут принять меры или использовать методы [Функции подавления реакции] (https://attack.mitre.org/tactics/TA0107) в тандеме, чтобы помочь успешному злоупотреблению процессами контроля, что приведет к [Воздействию] (https://attack.mitre.org/tactics/TA0105)."
    },
    "TA0107": {
      "name": "Функция подавления реакции",
      "description": "Злоумышленник пытается помешать вашим функциям безопасности, защиты, обеспечения качества и вмешательства оператора реагировать на сбой, опасность или небезопасное состояние.\n\nФункция подавления реагирования состоит из методов, которые злоумышленники используют, чтобы помешать защите, установленной для процессов и продуктов. Это может включать блокирование функций безопасности, защиты, обеспечения качества или вмешательства оператора с целью нарушения мер безопасности, направленных на предотвращение гибели людей, разрушения оборудования и сбоя производства. Эти методы направлены на активное сдерживание и предотвращение ожидаемых сигналов тревоги и реагирования, возникающих из-за состояний в среде АСУ ТП. Злоумышленники могут изменить или обновить системную логику или даже полностью предотвратить ответы с помощью отказа в обслуживании. Они могут привести к предотвращению, уничтожению, манипулированию или модификации программ, логики, устройств и коммуникаций. Поскольку функции предотвращения обычно неактивны, функции отчетности и обработки могут выглядеть нормально, но могут быть изменены для предотвращения реагирования на сбои в опасных сценариях. В отличие от [Уклонения](https://attack.mitre.org/tactics/TA0103), методы функции подавления ответа могут быть более навязчивыми, например, активно предотвращать реакцию на известный опасный сценарий. Злоумышленники могут использовать эти методы для реализации или прикрытия методов [Воздействия](https://attack.mitre.org/tactics/TA0105)."
    },
    "TA0108": {
      "name": "Первоначальный доступ",
      "description": "Злоумышленник пытается проникнуть в вашу среду АСУ ТП.\n\nПервоначальный доступ состоит из методов, которые злоумышленники могут использовать в качестве векторов проникновения, чтобы получить первоначальную точку опоры в среде АСУ ТП. Эти методы включают в себя компрометацию операционных технологических активов, ИТ-ресурсов в сети OT, а также внешних удаленных служб и веб-сайтов. Они также могут быть нацелены на сторонние организации и пользователей с привилегированным доступом. В частности, эти первоначальные точки доступа могут включать в себя устройства и механизмы связи с доступом и привилегиями как в ИТ-, так и в ОТ-среде. ИТ-ресурсы в среде OT также потенциально уязвимы для тех же атак, что и корпоративные ИТ-системы. В число доверенных третьих сторон могут входить поставщики, обслуживающий персонал, инженеры, внешние интеграторы и другие внешние организации, участвующие в ожидаемых операциях АСУ ТП. Активы, обслуживаемые поставщиком, могут включать физические устройства, программное обеспечение и эксплуатационное оборудование. Методы первоначального доступа также могут использовать внешние устройства, такие как радиоприемники, контроллеры или съемные носители, для удаленного вмешательства и, возможно, заражения операций OT."
    },
    "TA0109": {
      "name": "Боковое движение",
      "description": "Злоумышленник пытается проникнуть в вашу среду АСУ ТП.\n\nЛатеральное движение состоит из методов, которые злоумышленники используют для проникновения и управления удаленными системами в сети. Эти методы злоупотребляют учетными данными по умолчанию, известными учетными записями и уязвимыми службами, а также могут использовать устройства и системы с двойным подключением, которые находятся как в ИТ-сетях, так и в OT-сетях. Противник использует эти методы, чтобы перейти к следующей точке окружения, позиционируя себя там, где он хочет быть или думает, что должен быть. Для достижения своей основной цели часто требуется [Обнаружение](https://attack.mitre.org/tactics/TA0102) сети и [Сбор](https://attack.mitre.org/tactics/TA0100) для повышения осведомленности об уникальных устройствах и процессах АСУ ТП, чтобы найти свою цель и впоследствии получить к ней доступ. Достижение этой цели часто требует переключения между несколькими системами, устройствами и учетными записями. Злоумышленники могут установить свои собственные удаленные инструменты для выполнения латерального движения или использовать инструменты, программы и наборы производителей по умолчанию, а также другие законные учетные данные, встроенные в сеть, что может быть более скрытным."
    },
    "TA0110": {
      "name": "Упорство",
      "description": "Злоумышленник пытается удержаться в вашей среде АСУ ТП.\n\nПостоянство состоит из методов, которые злоумышленники используют для сохранения доступа к системам и устройствам АСУ ТП при перезагрузках, изменении учетных данных и других прерываниях, которые могут лишить их доступа. Методы, используемые для обеспечения устойчивости, включают любые изменения доступа, действий или конфигурации, которые позволяют им защитить свою текущую деятельность и сохранить свое влияние в системах. Это может включать замену или перехват законного кода, прошивки и других файлов проекта, а также добавление кода запуска и загрузку программ на устройства."
    },
    "TA0111": {
      "name": "Повышение привилегий",
      "description": "Злоумышленник пытается получить разрешения более высокого уровня.\n\nЭскалация привилегий состоит из методов, которые злоумышленники используют для получения разрешений более высокого уровня в системе или сети. Злоумышленники часто могут войти и исследовать сеть с непривилегированным доступом, но для достижения своих целей им требуются повышенные разрешения. Распространенные подходы заключаются в использовании слабых мест системы, неправильных конфигураций и уязвимостей."
    }
  },
  "techniques": {
    "T0800": {
      "name": "Активируйте режим обновления прошивки",
      "description": "Злоумышленники могут активировать режим обновления прошивки на устройствах, чтобы предотвратить задействование ожидаемых функций реагирования в случае чрезвычайной ситуации или сбоя процесса. Например, такие устройства, как реле защиты, могут иметь режим работы, предназначенный для установки встроенного ПО. Этот режим может остановить мониторинг процесса и связанные с ним функции, чтобы обеспечить загрузку новой прошивки. Устройство, оставленное в режиме обновления, может быть переведено в неактивное состояние ожидания, если ему не предоставлена ​​прошивка. Входя и оставляя устройство в этом режиме, злоумышленник может лишить его обычных функций."
    },
    "T0801": {
      "name": "Мониторинг состояния процесса",
      "description": "Злоумышленники могут собирать информацию о физическом состоянии процесса. Эта информация может использоваться для получения дополнительной информации о самом процессе или в качестве триггера для вредоносных действий. Источники информации о состоянии процесса могут различаться, например, теги OPC, архивные данные, информация о конкретном блоке ПЛК или сетевой трафик."
    },
    "T0802": {
      "name": "Автоматизированный сбор",
      "description": "Злоумышленники могут автоматизировать сбор информации о промышленной среде с помощью инструментов или сценариев. Этот автоматизированный сбор может использовать собственные протоколы и инструменты управления, доступные в среде систем управления. Например, протокол OPC может использоваться для подсчета и сбора информации. Доступ к системе или интерфейсу с этими собственными протоколами может позволить собирать и перечислять другие подключенные взаимодействующие серверы и устройства."
    },
    "T0803": {
      "name": "Сообщение команды блокировки",
      "description": "Злоумышленники могут заблокировать командное сообщение от достижения намеченной цели, чтобы предотвратить выполнение команды. В сетях OT отправляются командные сообщения с инструкциями по управлению системными устройствами. Заблокированное командное сообщение может помешать функциям реагирования исправить сбой или небезопасное состояние. (Цитата: Бонни Чжу, Энтони Джозеф, Шанкар Састри, 2011 г.) (Цитата: Центр обмена информацией и анализа электроэнергии; SANS Industrial Control Systems, март 2016 г.)"
    },
    "T0804": {
      "name": "Блокировать сообщение с отчетом",
      "description": "Злоумышленники могут заблокировать или помешать сообщению достичь намеченной цели. В системах управления отчетные сообщения содержат данные телеметрии (например, значения ввода-вывода), относящиеся к текущему состоянию оборудования и производственного процесса. Блокируя эти отчетные сообщения, злоумышленник потенциально может скрыть свои действия от оператора.\n\nБлокирование сообщений отчетности в системах управления, управляющих физическими процессами, может способствовать воздействию на систему, вызывая подавление функции реагирования. Система управления может быть не в состоянии должным и своевременным образом отреагировать на событие, например, на опасную неисправность, если ее соответствующее отчетное сообщение заблокировано. (Цитата: Бонни Чжу, Энтони Джозеф, Шанкар Састри, 2011 г.) (Цитата: Центр обмена информацией и анализа электроэнергии; SANS Industrial Control Systems, март 2016 г.)"
    },
    "T0805": {
      "name": "Блокировать последовательный COM",
      "description": "Злоумышленники могут заблокировать доступ к последовательному COM-порту, чтобы предотвратить попадание инструкций или конфигураций на целевые устройства. Порты последовательной связи (COM) обеспечивают связь с устройствами системы управления. Устройства могут получать командные и конфигурационные сообщения через такой последовательный порт COM. Устройства также используют последовательный COM для отправки команд и сообщений отчетов. Блокирующее последовательный COM устройства может также блокировать командные сообщения и блокировать отчетные сообщения.\n\nПреобразователь последовательного интерфейса в Ethernet часто подключается к последовательному порту COM для облегчения связи между последовательными устройствами и устройствами Ethernet. Одним из подходов к блокировке последовательного COM является создание и удержание открытым сеанса TCP со стороной Ethernet преобразователя. Преобразователь последовательного интерфейса в Ethernet может иметь несколько открытых портов для облегчения множественной связи. Например, если доступны три последовательных порта COM — 1, 2 и 3 — преобразователь может прослушивать соответствующие порты 20001, 20002 и 20003. Если соединение TCP/IP открыто с одним из этих портов и удерживается открытым, то порт будет недоступен для использования другой стороной. Один из способов добиться этого — инициировать TCP-сессию с преобразователем последовательного порта в Ethernet по адресу 10.0.0.1 через Telnet на последовательном порту 1 с помощью следующей команды: telnet 10.0.0.1 20001."
    },
    "T0806": {
      "name": "Грубая сила ввода-вывода",
      "description": "Злоумышленники могут повторно или последовательно изменять значения точек ввода-вывода для выполнения действия. Грубый ввод-вывод может быть достигнут путем многократного изменения либо диапазона значений точек ввода-вывода, либо одного значения точки для манипулирования функцией процесса. Цель противника и имеющаяся у него информация о целевой среде будут влиять на то, какой из вариантов он выберет. В случае перебора диапазона значений точек злоумышленник может достичь удара, не нацеливаясь на конкретную точку. В случае, когда целью является одна точка, злоумышленник может создать нестабильность в функции процесса, связанной с этой конкретной точкой.\n\nЗлоумышленники могут использовать грубую силу ввода-вывода, чтобы вызвать сбои в различных промышленных процессах. Эти сбои могут быть результатом износа оборудования или повреждения последующего оборудования."
    },
    "T0807": {
      "name": "Интерфейс командной строки",
      "description": "Злоумышленники могут использовать интерфейсы командной строки (CLI) для взаимодействия с системами и выполнения команд. Интерфейсы командной строки предоставляют средства взаимодействия с компьютерными системами и являются общей функцией многих типов платформ и устройств в средах систем управления. (Цитата: Enterprise ATT&CK, январь 2018 г.) Злоумышленники также могут использовать интерфейс командной строки для установки и запуска нового программного обеспечения, включая вредоносные инструменты, которые могут быть установлены в ходе операции.\n\nДоступ к CLI обычно осуществляется локально, но его также можно открыть через такие службы, как SSH, Telnet и RDP.  Команды, выполняемые в CLI, выполняются с текущим уровнем разрешений процесса, запускающего эмулятор терминала, если только команда не указывает изменение контекста разрешений. Многие контроллеры имеют интерфейсы CLI для целей управления."
    },
    "T0809": {
      "name": "Уничтожение данных",
      "description": "Злоумышленники могут уничтожить данные в ходе операции. Для этого злоумышленник может удалить или создать вредоносное ПО, инструменты или другие неродные файлы в целевой системе, потенциально оставляя после себя следы вредоносных действий. Такие неродные файлы и другие данные могут быть удалены в ходе вторжения, чтобы сохранить небольшой след, или в качестве стандартной части процесса очистки после вторжения. (Цитата: Предприятие ATT&CK, январь 2018 г.)\n\nУничтожение данных также может использоваться для того, чтобы сделать интерфейсы оператора неспособными реагировать и нарушить выполнение ожидаемых функций реагирования. Злоумышленник также может уничтожить резервные копии данных, которые необходимы для восстановления после инцидента.\n\nСтандартные команды удаления файлов доступны в большинстве операционных систем и интерфейсов устройств для выполнения очистки, но злоумышленники могут использовать и другие инструменты. Двумя примерами являются Windows Sysinternals SDelete и Active@ Killdisk."
    },
    "T0811": {
      "name": "Данные из информационных хранилищ",
      "description": "Злоумышленники могут атаковать и собирать данные из информационных хранилищ. Сюда могут входить конфиденциальные данные, такие как спецификации, схемы или диаграммы компоновки, устройств и процессов системы управления. Примеры хранилищ информации включают справочные базы данных в технологической среде, а также базы данных в корпоративной сети, которые могут содержать информацию об АСУ ТП. (Цитата: Агентство по кибербезопасности и безопасности инфраструктуры, март 2018 г.)\n\nИнформация, собранная из этих систем, может помочь злоумышленнику лучше понять операционную среду, используемых поставщиков, процессы или процедуры АСУ ТП.\n\nВ ходе кампании, проводившейся в период с 2011 по 2013 год против организаций ONG, спонсируемые государством субъекты Китая искали в хранилищах документов конкретную информацию, такую ​​как системные руководства, сайты удаленных терминальных устройств (RTU), списки персонала, документы, которые включали строку SCAD*, учетные данные пользователя и информацию об удаленном коммутируемом доступе. (Цитата: CISA AA21-201A, вторжение в трубопровод, июль 2021 г.)"
    },
    "T0812": {
      "name": "Учетные данные по умолчанию",
      "description": "Злоумышленники могут использовать учетные данные, установленные производителем или поставщиком по умолчанию на устройствах системы управления. Эти учетные данные по умолчанию могут иметь административные разрешения и могут потребоваться для первоначальной настройки устройства. Обычно рекомендуется как можно скорее менять пароли для этих учетных записей, но у некоторых производителей могут быть устройства с паролями или именами пользователей, которые нельзя изменить. (Цитата: Кейт Стоуффер, май 2015 г.)\n\nУчетные данные по умолчанию обычно документируются в руководстве по эксплуатации, которое либо прилагается к устройству, либо публикуется в Интернете официальными средствами, либо публикуется в Интернете неофициальными средствами. Злоумышленники могут использовать учетные данные по умолчанию, которые не были должным образом изменены или отключены."
    },
    "T0813": {
      "name": "Отказ от контроля",
      "description": "Злоумышленники могут вызвать отказ в управлении, чтобы временно помешать операторам и инженерам взаимодействовать с элементами управления процессом. Злоумышленник может попытаться запретить доступ к управлению процессом, чтобы вызвать временную потерю связи с устройством управления или помешать оператору регулировать средства управления процессом. Затронутый процесс может продолжать работать в период потери управления, но не обязательно в желаемом состоянии. (Цитирование: Кореро) (Цитирование: Майкл Дж. Ассанте и Роберт М. Ли) (Цитирование: Тайсон Маколей)\n\nВо время инцидента с сиреной в Далласе в 2017 году операторы не смогли отключить ложные сигналы тревоги из штаб-квартиры Управления по чрезвычайным ситуациям. (Цитата: Марк Лавлесс, апрель 2017 г.)"
    },
    "T0814": {
      "name": "Отказ в обслуживании",
      "description": "Злоумышленники могут выполнять атаки типа «отказ в обслуживании» (DoS), чтобы нарушить ожидаемую функциональность устройства. Примеры DoS-атак включают в себя перегрузку целевого устройства большим объемом запросов за короткий период времени и отправку целевому устройству запроса, который оно не знает, как обработать. Нарушение состояния устройства может временно привести к тому, что оно перестанет отвечать на запросы, возможно, до тех пор, пока не произойдет перезагрузка. При переводе в это состояние устройства могут оказаться неспособными отправлять и получать запросы и не выполнять ожидаемые функции ответа в ответ на другие события в среде.\n\nНекоторые устройства ICS особенно чувствительны к DoS-событиям и могут перестать отвечать даже на простой запрос ping. Злоумышленники также могут попытаться выполнить постоянный отказ в обслуживании (PDoS) в отношении определенных устройств, например, в случае с вредоносным ПО BrickerBot. (Цитата: ICS-CERT, апрель 2017 г.)\n\nЗлоумышленники могут использовать уязвимость программного обеспечения, чтобы вызвать отказ в обслуживании, воспользовавшись ошибкой программирования в программе, службе или в программном обеспечении операционной системы или самом ядре для выполнения кода, контролируемого злоумышленником. В программном обеспечении могут существовать уязвимости, которые могут быть использованы для возникновения состояния отказа в обслуживании.\n\nЗлоумышленники могут заранее знать о промышленных протоколах или устройствах управления, используемых в среде, посредством [Удаленного обнаружения системной информации] (https://attack.mitre.org/techniques/T0888). Существуют примеры, когда злоумышленники удаленно вызывают [перезагрузку/выключение устройства](https://attack.mitre.org/techniques/T0816), используя уязвимость, вызывающую неконтролируемое потребление ресурсов. (Цитата: ICS-CERT, август 2018 г.) (Цитата: Common Weakness Enumeration, январь 2019 г.) (Цитата: MITRE, март 2018 г.)"
    },
    "T0815": {
      "name": "Отказ от просмотра",
      "description": "Злоумышленники могут вызвать отказ в просмотре, пытаясь нарушить и предотвратить контроль оператора за состоянием среды АСУ ТП. Это может проявляться как временный сбой связи между устройством и его источником управления, при котором интерфейс восстанавливается и становится доступным после прекращения помех. (Цитирование: Кореро) (Цитирование: Майкл Дж. Ассанте и Роберт М. Ли) (Цитирование: Тайсон Маколей)\n\nЗлоумышленник может попытаться запретить оператору видимость, не позволяя ему получать сообщения о состоянии и отчеты. Отказ от этого представления может временно заблокировать и помешать операторам заметить изменение состояния или аномальное поведение. Данные и процессы окружающей среды могут по-прежнему работать, но функционировать непреднамеренным или враждебным образом."
    },
    "T0816": {
      "name": "Перезапуск/выключение устройства",
      "description": "Злоумышленники могут принудительно перезапустить или выключить устройство в среде АСУ ТП, чтобы нарушить физические процессы и потенциально отрицательно повлиять на них. В некоторых устройствах методы перезапуска и выключения устройства существуют как встроенные стандартные функции. Эти функции можно реализовать с помощью интерактивных веб-интерфейсов устройств, интерфейсов командной строки и команд сетевого протокола.\n\nНеожиданный перезапуск или отключение устройств системы управления может помешать выполнению ожидаемых функций реагирования во время критических состояний.\n\nПерезапуск устройства также может быть признаком вредоносных модификаций устройства, поскольку для вступления в силу многих обновлений требуется завершение работы."
    },
    "T0817": {
      "name": "Компромисс",
      "description": "Злоумышленники могут получить доступ к системе во время взлома, когда пользователь посещает веб-сайт в рамках обычного сеанса просмотра. С помощью этого метода веб-браузер пользователя становится целью и эксплуатируется просто при посещении взломанного веб-сайта.\n\nЗлоумышленник может быть нацелен на определенное сообщество, например, на доверенных сторонних поставщиков или другие отраслевые группы, которые часто посещают целевой веб-сайт. Этот вид целевой атаки основан на общих интересах и известен как стратегический веб-компрометация или атака на водопой.\n\nНациональная система киберинформации (NCAS) выпустила техническое предупреждение (TA) относительно кибер-деятельности российского правительства, нацеленной на критически важные секторы инфраструктуры. (Цитата: Агентство кибербезопасности и безопасности инфраструктуры, март 2018 г.) Анализ, проведенный DHS и ФБР, выявил две отдельные категории жертв кампании Dragonfly в западном энергетическом секторе: инсценировки и предполагаемые цели. Злоумышленник нацелился на менее защищенные сети промежуточных целей, включая доверенных сторонних поставщиков и связанные с ними периферийные организации. При первоначальном доступе к намеченным целям использовались атаки «водопой», нацеленные на управление процессами, АСУ ТП и критически важную инфраструктуру, связанные с торговыми публикациями и информационными веб-сайтами."
    },
    "T0819": {
      "name": "Использование общедоступного приложения",
      "description": "Злоумышленники могут использовать слабые места для использования программного обеспечения с выходом в Интернет для первоначального доступа к промышленной сети. Программным обеспечением с выходом в Интернет могут быть пользовательские приложения, базовые сетевые реализации, операционная система активов, слабая защита и т. д. Цели этого метода могут быть намеренно раскрыты с целью удаленного управления и видимости.\n\nЗлоумышленник может попытаться атаковать общедоступные приложения, поскольку они могут обеспечить прямой доступ к среде ICS или возможность перехода в сеть ICS. Публично открытые приложения можно найти с помощью онлайн-инструментов, которые сканируют Интернет на наличие открытых портов и сервисов. Номера версий открытого приложения могут предоставить злоумышленникам возможность атаковать определенные известные уязвимости. Открытый протокол управления или порты удаленного доступа, найденные в разделе «Общеиспользуемый порт», могут представлять интерес для злоумышленников."
    },
    "T0820": {
      "name": "Использование для уклонения",
      "description": "Злоумышленники могут использовать уязвимость программного обеспечения, чтобы воспользоваться ошибкой программирования в программе, службе или в программном обеспечении операционной системы или самом ядре, чтобы избежать обнаружения. В программном обеспечении могут существовать уязвимости, которые можно использовать для отключения или обхода функций безопасности.\n\nЗлоумышленники могут заранее получить информацию посредством [Удаленного обнаружения системной информации] (https://attack.mitre.org/techniques/T0888) о функциях безопасности, реализованных на устройствах управления. Эти функции безопасности устройства, скорее всего, станут объектом непосредственного использования. Существуют примеры проверок согласованности встроенного ПО ОЗУ/ПЗУ на устройствах управления, на которые нацелены злоумышленники, с целью обеспечения возможности установки вредоносного [прошивки системы] (https://attack.mitre.org/techniques/T0857)."
    },
    "T0821": {
      "name": "Изменение задач контроллера",
      "description": "Злоумышленники могут изменить задачи контроллера, чтобы обеспечить выполнение своих собственных программ. Это может позволить злоумышленнику манипулировать потоком выполнения и поведением контроллера.\n\nСогласно 61131-3, ассоциация задачи с программным организационным блоком (POU) определяет ассоциацию задачи. (Цитата: МЭК, февраль 2013 г.) Злоумышленник может изменить эти ассоциации или создать новые, чтобы манипулировать потоком выполнения контроллера. Изменение задач контроллера может быть выполнено с помощью загрузки программы в дополнение к другим типам модификации программы, таким как онлайн-редактирование и добавление программы.\n\nЗадачи имеют такие свойства, как интервал, частота и приоритет, отвечающие требованиям выполнения программы. Некоторые производители контроллеров реализуют задачи с неявными, предопределенными свойствами, тогда как другие позволяют явно формулировать эти свойства. Злоумышленник может связать свою программу с задачами, имеющими более высокий приоритет, или чаще выполнять связанные программы. Например, чтобы обеспечить циклическое выполнение своей программы на контроллере Siemens, злоумышленник может добавить свою программу к задаче — организационный блок 1 (OB1)."
    },
    "T0822": {
      "name": "Внешние удаленные службы",
      "description": "Злоумышленники могут использовать внешние удаленные службы в качестве точки первоначального доступа к вашей сети. Эти службы позволяют пользователям подключаться к внутренним сетевым ресурсам из внешних мест. Примерами являются VPN, Citrix и другие механизмы доступа. Шлюзы удаленных служб часто управляют соединениями и аутентификацией учетных данных для этих служб. (Цитата: Дэниел Окли, Трэвис Смит, Tripwire)\n\nВнешние удаленные сервисы позволяют администрировать систему управления извне. Часто поставщики и внутренние инженерные группы имеют доступ к внешним удаленным сервисам для управления системными сетями через корпоративную сеть. В некоторых случаях этот доступ осуществляется непосредственно из Интернета. Хотя удаленный доступ упрощает обслуживание, когда система управления находится в удаленной зоне, компрометация решений удаленного доступа является проблемой. Злоумышленник может использовать эти службы для получения доступа к сети системы управления и проведения атак на нее. Доступ к действительным учетным записям часто является обязательным требованием.\n\nВ поисках точки входа в сеть системы управления злоумышленники могут начать поиск существующих реализаций VPN типа «точка-точка» в доверенных сторонних сетях или через подключения сотрудников удаленной службы поддержки, где включено раздельное туннелирование. (Цитата: Центр обмена и анализа информации об электричестве; SANS Industrial Control Systems, март 2016 г.)"
    },
    "T0823": {
      "name": "Графический интерфейс пользователя",
      "description": "Злоумышленники могут попытаться получить доступ к машине через графический интерфейс пользователя (GUI), чтобы расширить возможности выполнения. Доступ к графическому интерфейсу позволяет пользователю взаимодействовать с компьютером более наглядно, чем через интерфейс командной строки. Графический интерфейс позволяет пользователям перемещать курсор и нажимать на объекты интерфейса, используя мышь и клавиатуру в качестве основных устройств ввода, а не просто используя клавиатуру.\n\nЕсли физический доступ невозможен, то доступ может быть возможен через такие протоколы, как VNC в операционных системах на базе Linux и Unix и RDP в операционных системах Windows. Злоумышленник может использовать этот доступ для выполнения программ и приложений на целевой машине."
    },
    "T0826": {
      "name": "Потеря доступности",
      "description": "Злоумышленники могут попытаться вывести из строя важные компоненты или системы, чтобы помешать владельцу и оператору предоставлять продукты или услуги. (Цитирование: Кореро) (Цитирование: Майкл Дж. Ассанте и Роберт М. Ли) (Цитирование: Тайсон Маколей)\n\nЗлоумышленники могут использовать вредоносное ПО для удаления или шифрования важных данных на HMI, рабочих станциях или базах данных.\n\nВ результате инцидента с вымогателем Colonial Pipeline в 2021 году работа трубопровода была временно остановлена ​​7 мая и не возобновлялась полностью до 12 мая. (Цитата: Colonial Pipeline Company, май 2021 г.)"
    },
    "T0827": {
      "name": "Потеря контроля",
      "description": "Злоумышленники могут попытаться добиться устойчивой потери управления или состояния неуправляемого управления, при котором операторы не могут отдавать какие-либо команды, даже если злонамеренное вмешательство утихло. (Цитирование: Кореро) (Цитирование: Майкл Дж. Ассанте и Роберт М. Ли) (Цитирование: Тайсон Маколей)\n\nФедеральное управление информационной безопасности Германии (BSI) сообщило о целенаправленной атаке на сталелитейный завод в своем отчете по информационной безопасности за 2014 год. (Цитата: BSI State of IT Security 2014). Эти целевые атаки затронули промышленные операции и привели к поломкам компонентов системы управления и даже целых установок. В результате этих аварий мощный удар привел к повреждениям и небезопасным условиям из-за неконтролируемой остановки доменной печи."
    },
    "T0828": {
      "name": "Потеря производительности и доходов",
      "description": "Злоумышленники могут вызвать потерю производительности и доходов из-за сбоев и даже повреждения доступности и целостности операций системы управления, устройств и связанных процессов. Этот метод может проявляться как прямой эффект атаки, нацеленной на ICS, или косвенно, из-за атаки, нацеленной на ИТ, против несегрегированных сред.\n\nВ тех случаях, когда эти операции или услуги прекращаются, потеря производительности может в конечном итоге оказать влияние на конечных пользователей или потребителей продуктов и услуг. Нарушение цепочки поставок может привести, среди прочего, к дефициту поставок и повышению цен.\n\nАтака программы-вымогателя на австралийскую компанию по производству напитков привела к закрытию некоторых производственных объектов, включая остановки в целях предосторожности для защиты ключевых систем. (Цитата: Паганини, Пьерлуиджи, июнь 2020 г.) Компания объявила о возможной временной нехватке своей продукции после атаки. (Цитата: Паганини, Пьерлуиджи, июнь 2020 г.) (Цитата: Lion Corporation, июнь 2020 г.)\n\nВо время инцидента с программой-вымогателем Colonial Pipeline в 2021 году трубопровод не смог транспортировать примерно 2,5 миллиона баррелей топлива в день на восточное побережье.  (Цитата: Colonial Pipeline Company, май 2021 г.)"
    },
    "T0829": {
      "name": "Потеря обзора",
      "description": "Злоумышленники могут вызвать длительную или необратимую потерю обзора, если оборудование АСУ ТП потребует местного практического вмешательства оператора; например, перезагрузка или ручное управление. Вызывая устойчивую отчетность или потерю видимости, злоумышленник может эффективно скрыть текущее состояние операций. Эта потеря зрения может произойти, не затрагивая сами физические процессы. (Цитирование: Кореро) (Цитирование: Майкл Дж. Ассанте и Роберт М. Ли) (Цитирование: Тайсон Маколей)"
    },
    "T0830": {
      "name": "Противник посередине",
      "description": "Злоумышленники с привилегированным доступом к сети могут попытаться изменить сетевой трафик в режиме реального времени, используя атаки «противник посередине» (AiTM). (Цитата: Габриэль Санчес, октябрь 2017 г.) Этот тип атаки позволяет злоумышленнику перехватывать трафик, входящий и/или исходящий от определенного устройства в сети. Если атака AiTM установлена, злоумышленник имеет возможность блокировать, регистрировать, изменять или вводить трафик в поток связи. Существует несколько способов осуществления этой атаки, но наиболее распространенными являются отравление протокола разрешения адресов (ARP) и использование прокси-сервера. (Цитата: Бонни Чжу, Энтони Джозеф, Шанкар Састри, 2011 г.)\n\nАтака AiTM может позволить злоумышленнику выполнить следующие атаки:  \n[Блокировать отчетное сообщение] (https://attack.mitre.org/techniques/T0804), [Поддельное отчетное сообщение] (https://attack.mitre.org/techniques/T0856), [Изменить параметр] (https://attack.mitre.org/techniques/T0836), [Несанкционированная команда Сообщение](https://attack.mitre.org/techniques/T0855)"
    },
    "T0831": {
      "name": "Манипулирование контролем",
      "description": "Злоумышленники могут манипулировать управлением физическими процессами в промышленной среде. Методы манипулирования контролем могут включать в себя изменения значений заданных значений, тегов или других параметров. Злоумышленники могут манипулировать устройствами систем управления или, возможно, использовать свои собственные для связи и управления физическими процессами управления. Продолжительность манипуляции может быть временной или продолжительной, в зависимости от обнаружения оператором.\n\nК методам манипулирования контролем относятся:\n\n*Человек посередине  \n* Поддельное командное сообщение \n* Изменение уставок\n\nПольский студент использовал устройство дистанционного управления для взаимодействия с городской трамвайной системой Лодзи в Польше. (Цитирование: Джон Билл, май 2017 г.) (Цитирование: Шелли Смит, февраль 2008 г.) (Цитирование: Брюс Шнайер, январь 2008 г.) С помощью этого пульта студент смог улавливать и воспроизводить настоящие сигналы трамвая. В результате из-за аварийной остановки четыре трамвая сошли с рельсов и двенадцать человек получили ранения. (Цитата: Шелли Смит, февраль 2008 г.) Отданные команды управления путями также могли привести к столкновениям трамваев, что представляло дополнительный риск для тех, кто находился на борту и поблизости от зон столкновения. (Цитата: Брюс Шнайер, январь 2008 г.)"
    },
    "T0832": {
      "name": "Манипулирование видом",
      "description": "Злоумышленники могут попытаться манипулировать информацией, переданной операторам или контролерам. Эта манипуляция может быть краткосрочной или продолжительной. В течение этого времени сам процесс может находиться в совершенно ином состоянии, чем то, о котором сообщается. (Цитирование: Кореро) (Цитирование: Майкл Дж. Ассанте и Роберт М. Ли) (Цитирование: Тайсон Маколей)\n\nВ случае потери обзора операторы могут быть обмануты и заставить их сделать что-то вредное для системы. При манипулировании системами операторы могут выдавать неправильные последовательности управления, которые приводят к сбоям или катастрофическим сбоям в системе. Системы бизнес-анализа также могут предоставлять неточные данные, что приводит к принятию неверных управленческих решений."
    },
    "T0834": {
      "name": "Собственный API",
      "description": "Злоумышленники могут напрямую взаимодействовать с собственным интерфейсом прикладного программирования (API) ОС для доступа к функциям системы. Собственные API предоставляют контролируемые средства вызова низкоуровневых служб ОС внутри ядра, например служб, связанных с оборудованием/устройствами, памятью и процессами. (Цитата: The MITRE Corporation, май 2017 г.) Эти собственные API используются операционной системой во время загрузки системы (когда другие компоненты системы еще не инициализированы), а также при выполнении задач и запросов во время рутинных операций.\n\nФункциональность, предоставляемая собственными API, часто также предоставляется приложениям пользовательского режима через интерфейсы и библиотеки. Например, такие функции, как memcpy и прямые операции с регистрами памяти, можно использовать для изменения пользовательского и системного пространства памяти."
    },
    "T0835": {
      "name": "Манипулирование изображением ввода-вывода",
      "description": "Злоумышленники могут манипулировать образом ввода-вывода ПЛК различными способами, чтобы помешать им функционировать должным образом. Методы манипулирования изображениями ввода-вывода могут включать в себя переопределение таблицы ввода-вывода посредством прямых манипуляций с памятью или использование функции переопределения, используемой для тестирования программ ПЛК. (Цитата: доктор Кельвин Т. Эриксон, декабрь 2010 г.) Во время цикла сканирования ПЛК считывает состояние всех входов и сохраняет их в таблице изображений. (Цитата: Нанджундайя, Вайдьянатх) Таблица изображений — это внутренняя память ПЛК, в которой хранятся значения входов/выходов для одного сканирования во время выполнения пользовательской программы. После того как ПЛК выполнит всю логическую программу, он обновляет таблицу выходных изображений. Содержимое этой таблицы выходных изображений записывается в соответствующие точки вывода в модулях ввода-вывода.\n\nОдной из уникальных характеристик ПЛК является их способность игнорировать состояние физического дискретного входа или логику, управляющую физической выходной катушкой, и переводить выход в желаемое состояние."
    },
    "T0836": {
      "name": "Изменить параметр",
      "description": "Злоумышленники могут изменять параметры, используемые для управления устройствами промышленной системы управления. Эти устройства работают с помощью программ, которые диктуют, как и когда выполнять действия на основе таких параметров. Такие параметры могут определять степень выполнения действия и указывать дополнительные параметры. Например, программа на устройстве системы управления, определяющая процессы двигателя, может принимать параметр, определяющий общее количество секунд для работы этого двигателя.\n\nЗлоумышленник потенциально может изменить эти параметры, чтобы получить результат, выходящий за рамки того, что предполагалось операторами. Изменяя критические параметры системы и процессов, злоумышленник может нанести [Воздействие](https://attack.mitre.org/tactics/TA0105) на оборудование и/или процессы управления. Измененные параметры могут быть преобразованы в опасные, выходящие за пределы или неожиданные значения в результате типичных операций. Например, указывая, что процесс выполняется больше или меньше времени, чем должно, или указывая в качестве параметра необычно высокое, низкое или недопустимое значение."
    },
    "T0837": {
      "name": "Потеря защиты",
      "description": "Злоумышленники могут поставить под угрозу функции защитной системы, предназначенные для предотвращения последствий сбоев и ненормальных условий. Это может привести к повреждению оборудования, длительным простоям технологического процесса и опасностям для персонала.\n\nМногие неисправности и нештатные ситуации в управлении технологическими процессами происходят слишком быстро, чтобы человек-оператор мог на них отреагировать. Скорость имеет решающее значение для исправления этих условий, чтобы ограничить серьезные последствия, такие как потеря контроля и материальный ущерб.\n\nЗлоумышленники могут нацеливаться и отключать функции защитной системы в качестве предварительного условия для последующего выполнения атаки или для того, чтобы позволить будущим сбоям и аномальным условиям остаться незамеченными. Обнаружение потери защиты операторами может привести к остановке процесса из-за строгих политик в отношении систем защиты. Это может привести к потере производительности и доходов и может удовлетворить технические цели злоумышленников, стремящихся вызвать сбои в процессах."
    },
    "T0838": {
      "name": "Изменить настройки сигналов тревоги",
      "description": "Злоумышленники могут изменять настройки сигналов тревоги, чтобы предотвратить появление предупреждений, которые могут информировать операторов об их присутствии, или предотвратить реагирование на опасные и непредвиденные сценарии. Отчетные сообщения являются стандартной частью сбора данных в системах управления. Сообщения отчетов используются как способ передачи информации о состоянии системы и подтверждения того, что произошли определенные действия. Эти сообщения предоставляют важную информацию для управления физическим процессом и информируют операторов, инженеров и администраторов о состоянии системных устройств и физических процессов.\n\nЕсли злоумышленник может изменить настройки отчетности, можно предотвратить отправку отчетов об определенных событиях. Этот тип модификации также может помешать операторам или устройствам выполнять действия по поддержанию системы в безопасном состоянии. Если критические сообщения не могут инициировать эти действия, может произойти [Воздействие](https://attack.mitre.org/tactics/TA0105).\n\nВ средах ICS злоумышленнику, возможно, придется использовать [Подавление сигналов тревоги] (https://attack.mitre.org/techniques/T0878) или бороться с несколькими сигналами тревоги и/или их распространением для достижения конкретной цели — уклониться от обнаружения или предотвратить возникновение запланированных ответов. (Цитата: Йос Ветцелс, Марина Кротофил, 2019) Методы подавления часто основаны на изменении настроек сигналов тревоги, например, изменении кода памяти на фиксированные значения или вмешательстве в код инструкций уровня ассемблера."
    },
    "T0839": {
      "name": "Прошивка модуля",
      "description": "Злоумышленники могут установить вредоносное или уязвимое встроенное ПО на модульные аппаратные устройства. Устройства системы управления часто содержат модульные аппаратные устройства. Эти устройства могут иметь собственный комплект прошивки, отличный от прошивки основного оборудования системы управления.\n\nЭтот метод аналогичен [Прошивке системы] (https://attack.mitre.org/techniques/T0857), но применяется к другим компонентам системы, которые могут не иметь таких же возможностей или уровня проверки целостности. Несмотря на то, что это приводит к повторному созданию образа устройства, вредоносная прошивка устройства может обеспечить постоянный доступ к оставшимся устройствам. (Цитата: Дэниел Пек, Дейл Петерсон, январь 2009 г.)\n\nЛегкой точкой доступа для злоумышленника является карта Ethernet, которая может иметь собственный процессор, оперативную память и операционную систему. Злоумышленник может атаковать и, вероятно, использовать компьютер на карте Ethernet. Использование компьютера с картой Ethernet может позволить злоумышленнику выполнить дополнительные атаки, например следующие: (Цитата: Дэниел Пек, Дейл Петерсон, январь 2009 г.)\n\n* Отложенная атака. Противник может заранее организовать атаку и выбрать, когда ее начать, например, в особенно опасный момент.  \n* Блокируйте карту Ethernet. Вредоносная прошивка может быть запрограммирована так, что приведет к сбою карты Ethernet, что потребует возврата к заводским настройкам.  \n* Случайная атака или сбой. Злоумышленник может загрузить вредоносную прошивку на несколько полевых устройств. Выполнение атаки и время ее возникновения генерируются генератором псевдослучайных чисел.   \n* Червь для полевых устройств. Злоумышленник может выбрать идентификацию всех полевых устройств одной модели с конечной целью компрометации всего устройства.  \n* Атака на другие карты полевого устройства. Хотя это не самый важный модуль полевого устройства, карта Ethernet наиболее доступна для злоумышленников и вредоносных программ. Компрометация карты Ethernet может обеспечить более прямой путь к компрометации других модулей, например модуля ЦП."
    },
    "T0840": {
      "name": "Перечисление сетевых подключений",
      "description": "Злоумышленники могут выполнять перечисление сетевых подключений, чтобы обнаружить информацию о шаблонах связи устройств. Если злоумышленник может проверить состояние сетевого подключения с помощью таких инструментов, как Netstat (Цитата: Netstat) в сочетании с [Системной прошивкой] (https://attack.mitre.org/techniques/T0857), то он сможет определить роль определенных устройств в сети (Цитата: MITRE). Злоумышленник также может использовать [Обнюхивание сети] (https://attack.mitre.org/techniques/T0842) для просмотра сетевого трафика и получения подробной информации об источнике, пункте назначения, протоколе и контенте."
    },
    "T0842": {
      "name": "Обнюхивание сети",
      "description": "Сетевой анализ — это практика использования сетевого интерфейса в компьютерной системе для мониторинга или сбора информации (Цитата: Enterprise ATT&CK, январь 2018 г.) независимо от того, является ли он указанным местом назначения для информации.\n\nЗлоумышленник может попытаться перехватить трафик, чтобы получить информацию о цели. Эта информация может различаться по уровню важности. Относительно неважной информацией являются общие сообщения с машинами.  Относительно важной информацией будет информация для входа. Учетные данные пользователя могут быть отправлены по незашифрованному протоколу, например Telnet, который можно перехватить и получить посредством анализа сетевых пакетов.\n\nКроме того, отравление ARP и службы доменных имен (DNS) может использоваться для перехвата учетных данных на веб-сайтах, прокси-серверах и внутренних системах путем перенаправления трафика злоумышленнику."
    },
    "T0843": {
      "name": "Скачать программу",
      "description": "Злоумышленники могут выполнить загрузку программы для передачи пользовательской программы на контроллер.\n\nВарианты загрузки программы, такие как онлайн-редактирование и добавление программы, позволяют контроллеру продолжать работу во время процесса передачи и реконфигурации без прерывания управления процессом. Однако перед началом полной загрузки программы (т. е. загрузки всей программы) контроллеру может потребоваться перейти в состояние остановки. Это может иметь негативные последствия для физического процесса, особенно если контроллер не способен выполнить действие, зависящее от времени. Злоумышленники могут отказаться от загрузки в пользу онлайн-редактирования или добавления программы, чтобы не нарушать физический процесс. Злоумышленнику может потребоваться использовать технику «Определить рабочий режим» или «Изменить рабочий режим», чтобы убедиться, что контроллер находится в правильном режиме для приема загрузки программы.\n\nСтепень детализации управления передачей пользовательской программы целиком или по частям определяется протоколом управления (например, S7CommPlus, TriStation) и базовым API контроллера. Таким образом, загрузка программы — это термин высокого уровня, обозначающий набор вызовов API конкретного поставщика, используемых для настройки пространства памяти пользовательской программы контроллера.\n\n[Изменить задачу контроллера] (https://attack.mitre.org/techniques/T0821) и [Изменить программу] (https://attack.mitre.org/techniques/T0889) представляют собой изменения конфигурации, которые передаются в контроллер посредством загрузки программы."
    },
    "T0845": {
      "name": "Загрузка программы",
      "description": "Злоумышленники могут попытаться загрузить программу из ПЛК для сбора информации о промышленном процессе. Загрузка программы может позволить им получить и изучить лежащую в ее основе логику. Методы загрузки программы включают программное обеспечение поставщика, которое позволяет пользователю загружать и читать программу, работающую на ПЛК. Это программное обеспечение можно использовать для загрузки целевой программы на рабочую станцию, в окно перехода или на интерфейсное устройство."
    },
    "T0846": {
      "name": "Удаленное обнаружение системы",
      "description": "Злоумышленники могут попытаться получить список других систем по IP-адресу, имени хоста или другому логическому идентификатору в сети, который может быть использован для последующих методов латерального перемещения или обнаружения. Функциональность, позволяющая сделать это, может существовать в злоумышленных инструментах, но также можно использовать утилиты, доступные в операционной системе или программном обеспечении поставщика. (Цитата: Предприятие ATT&CK, январь 2018 г.)"
    },
    "T0847": {
      "name": "Репликация через съемные носители",
      "description": "Злоумышленники могут проникнуть в системы, например те, которые отделены от корпоративной сети, путем копирования вредоносного ПО на съемный носитель, который вставляется в среду системы управления. Злоумышленник может полагаться на неосознанные доверенные третьи стороны, такие как поставщики или подрядчики с правами доступа, чтобы внедрить съемный носитель. Этот метод обеспечивает первоначальный доступ к целевым устройствам, которые никогда не подключаются к ненадежным сетям, но физически доступны.\n\nОператоры немецкой атомной электростанции Гундремминген обнаружили вредоносное ПО на компьютере объекта, не подключенном к Интернету. (Цитата: Kernkraftwerk Gundremmingen, апрель 2016 г.) (Цитата: Trend Micro, апрель 2016 г.) Вредоносное ПО включало Conficker и W32.Ramnit, которые также были обнаружены на восемнадцати съемных дисках на предприятии. (Цитирование: Кристоф Стейтц, Эрик Ошар, апрель 2016 г.) (Цитирование: Каталин Чимпану, апрель 2016 г.) (Цитирование: Питер Докрил, апрель 2016 г.) (Цитирование: Ли Мэтьюз, апрель 2016 г.) (Цитирование: Шон Галлахер, апрель 2016 г.) (Цитирование: сотрудники Dark Reading, апрель 2016 г.) С тех пор растение проверили на наличие инфекции и очистили подробнее более 1000 компьютеров. (Цитата: BBC, апрель 2016 г.) Исследователь ESET отметил, что отключение Интернета не гарантирует безопасность системы от заражения или выполнения полезной нагрузки. (Цитата: ESET, апрель 2016 г.)"
    },
    "T0848": {
      "name": "Мастер-разбойник",
      "description": "Злоумышленники могут настроить мошеннического мастера, чтобы использовать функции сервера управления для связи с удаленными станциями. Несанкционированный мастер может использоваться для отправки законных управляющих сообщений на другие устройства системы управления, влияя на процессы непреднамеренным образом. Его также можно использовать для нарушения сетевых коммуникаций путем захвата и получения сетевого трафика, предназначенного для фактического ведущего устройства. Выдача себя за хозяина также может позволить злоумышленнику избежать обнаружения.\n\nВ случае с сиреной в Далласе в 2017 году злоумышленники использовали мошеннического мастера для отправки командных сообщений на 156 сирен, распределенных по всему городу, либо через один несанкционированный передатчик с сильным сигналом, либо с помощью множества распределенных ретрансляторов. (Цитата: Бастилия, апрель 2017 г.) (Цитата: Зак Уиттакер, апрель 2017 г.)"
    },
    "T0849": {
      "name": "Маскарад",
      "description": "Злоумышленники могут использовать маскировку, чтобы замаскировать вредоносное приложение или исполняемый файл под другой файл, чтобы избежать подозрений со стороны оператора и инженера. Возможная маскировка этих маскирующих файлов может включать в себя часто встречающиеся программы, исполняемые файлы и файлы конфигурации, ожидаемые поставщиком, а также другие распространенные приложения и соглашения об именах. Выдавая себя за ожидаемые и относящиеся к поставщику файлы и приложения, операторы и инженеры могут не заметить присутствие основного вредоносного содержимого и, возможно, в конечном итоге запустить их, маскируясь под законные функции.\n\nПриложения и другие файлы, обычно встречающиеся в системах Windows или на инженерных рабочих станциях, раньше олицетворялись. Это может быть так же просто, как переименовать файл, чтобы эффективно замаскировать его в среде ICS."
    },
    "T0851": {
      "name": "Руткит",
      "description": "Злоумышленники могут развертывать руткиты, чтобы скрыть присутствие программ, файлов, сетевых подключений, служб, драйверов и других компонентов системы. Руткиты — это программы, которые скрывают существование вредоносных программ путем перехвата и изменения вызовов API операционной системы, которые предоставляют системную информацию. Руткиты или функции, поддерживающие руткиты, могут находиться на уровне пользователя или ядра операционной системы или ниже. (Цитата: Предприятие ATT&CK, январь 2018 г.)\n\nРуткиты встроенного ПО, влияющие на операционную систему, обеспечивают почти полный контроль над системой. Хотя руткиты встроенного ПО обычно разрабатываются для основной платы обработки, они также могут быть разработаны для устройств ввода-вывода, подключенных к активу. Компрометация этой встроенной программы позволяет изменить все переменные процесса и функции, в которых участвует модуль. Это может привести к игнорированию команд и передаче ложной информации на главное устройство. Вмешиваясь в процессы устройства, злоумышленник может заблокировать ожидаемые функции реагирования и, возможно, включить [Воздействие](https://attack.mitre.org/tactics/TA0105)."
    },
    "T0852": {
      "name": "Снимок экрана",
      "description": "Злоумышленники могут попытаться сделать снимок экрана устройств в среде системы управления. Могут быть сделаны снимки экрана рабочих станций, HMI или других устройств, которые отображают важные для окружающей среды процессы, устройства, отчеты, сигналы тревоги или связанные данные. Эти дисплеи устройств могут отображать информацию о процессе, компоновке, управлении и связанных схемах ICS. В частности, HMI может предоставить много важной информации о промышленных процессах. (Цитата: ICS-CERT, октябрь 2017 г.) Анализ снимков экрана может дать злоумышленнику понимание предполагаемых операций и взаимодействия между критически важными устройствами."
    },
    "T0853": {
      "name": "Сценарии",
      "description": "Злоумышленники могут использовать языки сценариев для выполнения произвольного кода в форме заранее написанного сценария или в форме кода, предоставленного интерпретатору пользователем. Языки сценариев — это языки программирования, которые отличаются от компилируемых языков тем, что в языках сценариев используется интерпретатор, а не компилятор. Эти интерпретаторы читают и компилируют часть исходного кода непосредственно перед его выполнением, в отличие от компиляторов, которые компилируют каждую строку кода в исполняемый файл. Сценарии позволяют разработчикам программного обеспечения запускать свой код в любой системе, где существует интерпретатор. Таким образом, они могут распространять один пакет вместо предварительной компиляции исполняемых файлов для множества разных систем. Интерпретаторы языков сценариев, таких как Python, по умолчанию включены во многие дистрибутивы Linux.\n\nПомимо того, что интерпретаторы языка сценариев являются полезным инструментом для разработчиков и администраторов, злоумышленник может использовать их для выполнения кода в целевой среде. Благодаря природе языков сценариев это позволяет легко развернуть вооруженный код на цели и оставляет открытой возможность написания сценариев на лету для выполнения задачи."
    },
    "T0855": {
      "name": "Несанкционированное командное сообщение",
      "description": "Злоумышленники могут отправлять несанкционированные командные сообщения, чтобы дать указание активам системы управления выполнять действия, выходящие за рамки их предполагаемой функциональности, или без логических предварительных условий для запуска их ожидаемой функции. Командные сообщения используются в сетях АСУ ТП для передачи прямых инструкций устройствам системы управления. Если злоумышленник может отправить несанкционированное командное сообщение в систему управления, то он может дать указание устройству системы управления выполнить действие, выходящее за обычные рамки действий устройства. Злоумышленник потенциально может дать указание устройству системы управления выполнить действие, которое вызовет [Воздействие](https://attack.mitre.org/tactics/TA0105). (Цитата: Бонни Чжу, Энтони Джозеф, Шанкар Састри, 2011 г.)\n\nВ инциденте с сиреной в Далласе злоумышленники смогли отправить командные сообщения для активации систем сигнализации о торнадо по всему городу без надвигающегося торнадо или другой катастрофы. (Цитата: Зак Уиттакер, апрель 2017 г.) (Цитата: Бенджамин Фрид, март 2019 г.)"
    },
    "T0856": {
      "name": "Сообщение о подделке",
      "description": "Злоумышленники могут подделать отчетные сообщения в среде системы управления, чтобы уклониться от атак и ухудшить управление процессом. В системах управления отчетные сообщения содержат данные телеметрии (например, значения ввода-вывода), относящиеся к текущему состоянию оборудования и производственного процесса. Отчетные сообщения важны для мониторинга нормальной работы системы или выявления важных событий, таких как отклонения от ожидаемых значений.\n\nЕсли злоумышленник имеет возможность подделывать отчетные сообщения, он может повлиять на систему управления разными способами. В качестве формы уклонения злоумышленник может подделать отчетные сообщения, в которых говорится, что процесс работает нормально. Злоумышленник также может подделать отчетные сообщения, чтобы заставить защитников и операторов думать, что происходят другие ошибки, чтобы отвлечь их от фактического источника проблемы. (Цитата: Бонни Чжу, Энтони Джозеф, Шанкар Састри, 2011 г.)"
    },
    "T0857": {
      "name": "Прошивка системы",
      "description": "Системная прошивка современных устройств часто имеет функцию обновления. Более старая прошивка устройства может быть установлена ​​на заводе и требует специального оборудования для перепрограммирования. Функция обновления встроенного ПО, если она доступна, позволяет поставщикам удаленно исправлять ошибки и выполнять обновления. Обновления встроенного ПО устройства часто делегируются пользователю и могут выполняться с помощью пакета обновлений программного обеспечения. Эту задачу также можно выполнить по сети.\n\nЗлоумышленник может использовать функцию обновления прошивки на доступных устройствах для загрузки вредоносной или устаревшей прошивки. Вредоносная модификация прошивки устройства может предоставить злоумышленнику root-доступ к устройству, поскольку прошивка является одним из самых низких уровней абстракции программирования. (Цитата: Баснайт, Закри и др.)"
    },
    "T0858": {
      "name": "Изменение режима работы",
      "description": "Злоумышленники могут изменить режим работы контроллера, чтобы получить дополнительный доступ к инженерным функциям, таким как загрузка программы.   Программируемые контроллеры обычно имеют несколько режимов работы, которые контролируют состояние пользовательской программы и контролируют доступ к API контроллера. Режимы работы можно выбирать физически с помощью переключателя на лицевой панели контроллера, но их также можно выбирать с помощью вызовов API контроллера. Режимы работы и механизмы их выбора часто различаются в зависимости от поставщика и линейки продуктов. Ниже описаны некоторые часто реализуемые режимы работы:\n\n* Программа — этот режим необходимо включить, прежде чем можно будет внести изменения в программу устройства. Это позволяет загружать и скачивать программы между устройством и рабочей станцией инженера. Часто логика ПЛК останавливается, и все выходы могут быть принудительно отключены. (Цитата: Н.А., октябрь 2017 г.)  \n* Run - В этом режиме происходит выполнение программы устройства. Ввод и вывод (значения, точки, теги, элементы и т. д.) контролируются и используются в соответствии с логикой программы. В этом режиме [Загрузка программы](https://attack.mitre.org/techniques/T0845) и [Загрузка программы](https://attack.mitre.org/techniques/T0843) отключены. (Цитирование: Omron) (Цитирование: Machine Information Systems, 2007 г.) (Цитирование: NA, октябрь 2017 г.) (Цитирование: PLCgurus, 2021 г.)   \n* Удаленный — позволяет удаленно изменять режим работы ПЛК. (Цитата: PLCgurus 2021)    \n* Стоп – ПЛК и программа останавливаются, в этом режиме выходы принудительно отключаются. (Цитата: Машинные информационные системы, 2007 г.)   \n* Сброс. Условия ПЛК возвращаются в исходное состояние. Теплый сброс может сохранить часть памяти, тогда как холодный сброс приведет к сбросу всех регистров ввода-вывода и данных. (Цитата: Машинные информационные системы, 2007 г.)   \n* Режим тестирования/мониторинга. Аналогично режиму работы, обрабатывается ввод-вывод, хотя этот режим позволяет осуществлять мониторинг, принудительную настройку, сброс и, в более общем плане, настройку или отладку системы. Часто режим монитора можно использовать в качестве пробной версии для инициализации. (Цитата: Омрон)"
    },
    "T0859": {
      "name": "Действительные аккаунты",
      "description": "Злоумышленники могут украсть учетные данные определенного пользователя или учетной записи службы, используя методы доступа к учетным данным. В некоторых случаях учетные данные по умолчанию для устройств системы управления могут быть общедоступными. Скомпрометированные учетные данные могут использоваться для обхода контроля доступа, размещенного на различных ресурсах на хостах и ​​в сети, и даже могут использоваться для постоянного доступа к удаленным системам. Скомпрометированные учетные данные и учетные данные по умолчанию также могут предоставить злоумышленнику повышенные привилегии для определенных систем и устройств или доступ к ограниченным областям сети. Злоумышленники могут отказаться от использования вредоносных программ или инструментов в сочетании с законным доступом, который обеспечивают эти учетные данные, чтобы затруднить обнаружение их присутствия или контроль над устройствами и отправку законных команд непреднамеренным образом.\n\nЗлоумышленники также могут создавать учетные записи, иногда используя заранее определенные имена учетных записей и пароли, чтобы обеспечить средства резервного доступа для обеспечения устойчивости. (Цитата: Буз Аллен Гамильтон)\n\nПерекрытие учетных данных и разрешений в сети систем вызывает беспокойство, поскольку злоумышленник может иметь возможность переключаться между учетными записями и системами для достижения высокого уровня доступа (например, администратора домена или предприятия) и, возможно, между корпоративной и операционной технологической средой. Злоумышленники могут использовать действительные учетные данные из одной системы для получения доступа к другой системе."
    },
    "T0860": {
      "name": "Беспроводной компромисс",
      "description": "Злоумышленники могут взломать беспроводную сеть как метод получения связи и несанкционированного доступа к беспроводной сети. Доступ к беспроводной сети можно получить путем компрометации беспроводного устройства. (Цитата: Александр Большев, Глеб Чербов, июль 2014 г.) (Цитата: Александр Большев, март 2014 г.) Злоумышленники также могут использовать радиостанции и другие устройства беспроводной связи на той же частоте, что и беспроводная сеть. Компрометация беспроводной сети может быть выполнена в качестве первоначального вектора доступа на удаленном расстоянии.\n\nПольский студент использовал модифицированный пульт дистанционного управления от телевизора, чтобы получить доступ и управлять трамвайной системой города Лодзь в Польше. (Цитата: Джон Билл, май 2017 г.) (Цитата: Шелли Смит, февраль 2008 г.) Устройство дистанционного управления позволяло студенту взаимодействовать с трамвайной сетью, чтобы изменять настройки путей и отключать управление оператором. Злоумышленник мог добиться этого, настроив контроллер на частоту и амплитуду сигналов протокола ИК-управления. (Цитата: Брюс Шнайер, январь 2008 г.) Затем контроллер предоставил первоначальный доступ к сети, что позволило захватывать и воспроизводить сигналы трамвая. (Цитата: Джон Билл, май 2017 г.)"
    },
    "T0861": {
      "name": "Идентификация точек и тегов",
      "description": "Злоумышленники могут собирать значения точек и тегов, чтобы получить более полное представление о технологической среде. Точки могут быть такими значениями, как входные данные, ячейки памяти, выходные данные или другие переменные, специфичные для процесса. (Цитата: Деннис Л. Слоатман, сентябрь 2016 г.) Теги — это идентификаторы, присвоенные точкам для удобства оператора.\n\nСбор таких тегов обеспечивает ценный контекст для точек окружающей среды и позволяет злоумышленнику сопоставлять входные, выходные и другие значения со своими процессами управления. Понимание собираемых точек может дать злоумышленнику информацию о том, какие процессы и значения следует отслеживать в ходе операции."
    },
    "T0862": {
      "name": "Компромисс в цепочке поставок",
      "description": "Злоумышленники могут взломать цепочку поставок, чтобы получить доступ к среде систем управления с помощью зараженных продуктов, программного обеспечения и рабочих процессов. Компромисс в цепочке поставок — это манипулирование продуктами, такими как устройства или программное обеспечение, или механизмами их доставки до получения конечным потребителем. Злоумышленный взлом этих продуктов и механизмов осуществляется с целью компрометации данных или системы после попадания зараженных продуктов в целевую среду.\n\nКомпрометация цепочки поставок может произойти на всех этапах цепочки поставок: от манипулирования инструментами и средами разработки до манипуляций с разработанными продуктами и механизмами распространения инструментов. Это может включать в себя взлом и замену законного программного обеспечения и исправлений, например, на веб-сайтах третьих сторон или поставщиков. Нацеливание на компрометацию цепочки поставок может быть сделано в попытках проникнуть в среду конкретной аудитории. В средах систем управления с активами как в ИТ-, так и в ОТ-сетях возможно, что компрометация цепочки поставок, влияющая на ИТ-среду, может обеспечить дальнейший доступ к среде ОТ.\n\nКонтрафактные устройства могут попасть в глобальную цепочку поставок, создав угрозу безопасности и кибербезопасности для владельцев активов и операторов. Эти устройства могут не соответствовать требованиям безопасности, инженерным и производственным требованиям регулирующих органов, но могут иметь маркировку, указывающую на соответствие отраслевым стандартам. Из-за несоблюдения стандартов и общего низкого качества контрафактная продукция может представлять серьезную угрозу для безопасности и эксплуатации. (Цитата: Control Global, май 2019 г.)\n\nYokogawa выявила случаи, когда их клиенты получали поддельные датчики перепада давления с логотипом Yokogawa. Поддельные передатчики были почти неотличимы, поскольку их функциональность и интерфейс имитировали подлинный продукт. (Цитата: Control Global, май 2019 г.)\n\nКомпания F-Secure Labs проанализировала подход, который злоумышленник использовал для компрометации систем жертв с помощью Havex. (Цитата: Даавид Хентунен, Антти Тикканен, июнь 2014 г.) Злоумышленник разместил троянские установщики программного обеспечения, доступные на сайтах законных поставщиков систем ICS/SCADA. После загрузки это программное обеспечение заразило главный компьютер трояном удаленного доступа (RAT)."
    },
    "T0863": {
      "name": "Пользовательское выполнение",
      "description": "Злоумышленники могут полагаться на взаимодействие с пользователем целевой организации для выполнения вредоносного кода. Взаимодействие с пользователем может заключаться в установке приложений, открытии вложений электронной почты или предоставлении более высоких разрешений документам.\n\nЗлоумышленники могут встраивать вредоносный код или код Visual Basic в такие файлы, как документы Microsoft Word и Excel или установщики программного обеспечения. (Цитата: Booz Allen Hamilton) Для выполнения этого кода требуется, чтобы пользователь включил сценарии или доступ для записи в документе. Встроенный код не всегда может быть заметен пользователю, особенно в случае зараженного троянами программного обеспечения. (Цитата: Даавид Хентунен, Антти Тикканен, июнь 2014 г.)\n\nВ ходе китайской целевой фишинговой кампании, проходившей с 9 декабря 2011 г. по 29 февраля 2012 г., вредоносное ПО распространялось через целевые фишинговые вложения, для выполнения которых требовалось действие пользователя. (Цитата: CISA AA21-201A, вторжение в трубопровод, июль 2021 г.)"
    },
    "T0864": {
      "name": "Временный киберактив",
      "description": "Злоумышленники могут атаковать устройства, которые временно перемещаются между сетями АСУ и внешними сетями. Обычно временные активы переносятся в среду уполномоченным персоналом и не остаются в этой среде на постоянной основе. (Цитата: North American Electric Reliability Corporation, июнь 2021 г.) Временные активы обычно необходимы для поддержки функций управления и могут быть более распространены в системах, где удаленное управление активом невозможно, внешние соединения для удаленного доступа не существуют или требуется доступ стороннего подрядчика/поставщика.\n\nЗлоумышленники могут воспользоваться временными активами разными способами. Например, злоумышленники могут атаковать временный актив, когда он подключен к внешней сети, а затем использовать его доверенный доступ в другой среде для запуска атаки. Они также могут использовать установленные приложения и библиотеки, которые используются законными конечными пользователями для взаимодействия с устройствами системы управления.\n\nВременные активы в некоторых случаях не могут быть развернуты с безопасной конфигурацией, что приводит к уязвимостям, которые могут позволить злоумышленнику распространять вредоносный исполняемый код, например, временный актив может быть заражен вредоносным ПО, а при подключении к среде ICS вредоносное ПО распространяется на другие системы."
    },
    "T0865": {
      "name": "Целенаправленный фишинг",
      "description": "Злоумышленники могут использовать вложение целевого фишинга (вариант целевого фишинга) как форму социальной инженерной атаки на конкретные цели. Вложения целевого фишинга отличаются от других форм целевого фишинга тем, что в них используется вредоносное ПО, прикрепленное к электронному письму. Все формы целевого фишинга осуществляются в электронном виде и нацелены на конкретного человека, компанию или отрасль. В этом сценарии злоумышленники прикрепляют файл к целевому фишинговому сообщению и обычно полагаются на [Выполнение пользователем](https://attack.mitre.org/techniques/T0863) для выполнения и доступа. (Цитата: Предприятие ATT&CK, октябрь 2019 г.)\n\nКитайская целевая фишинговая кампания, проходившая с 9 декабря 2011 г. по 29 февраля 2012 г., была нацелена на организации ONG и их сотрудников. Электронные письма были тщательно продуманы, чтобы убедить сотрудников открыть вредоносные файловые вложения. (Цитата: CISA AA21-201A, вторжение в трубопровод, июль 2021 г.)"
    },
    "T0866": {
      "name": "Использование удаленных сервисов",
      "description": "Злоумышленники могут использовать уязвимость программного обеспечения, чтобы воспользоваться ошибкой программирования в программе, службе или в программном обеспечении операционной системы или самом ядре, чтобы обеспечить злоупотребление удаленной службой. Общей целью использования удаленных сервисов после компрометации является первоначальный доступ и последующее перемещение по всей среде АСУ ТП для обеспечения доступа к целевым системам. (Цитата: Предприятие ATT&CK)\n\nВладельцы и операторы активов АСУ ТП пострадали от программ-вымогателей (или разрушительных вредоносных программ, маскирующихся под программы-вымогатели), мигрировавших из корпоративных ИТ в среды АСУ ТП: WannaCry, NotPetya и BadRabbit. В каждом из этих случаев самораспространяющееся вредоносное ПО (поддающееся червям) первоначально заражало ИТ-сети, но через эксплойты (в частности, уязвимость MS17-010, нацеленную на SMBv1) распространилось на промышленные сети, что привело к значительным последствиям. (Цитата: Джо Слоуик, апрель 2019 г.)"
    },
    "T0867": {
      "name": "Боковая передача инструмента",
      "description": "Злоумышленники могут переносить инструменты или другие файлы из одной системы в другую, чтобы использовать злоумышленные инструменты или другие файлы в ходе операции. (Цитата: Enterprise ATT&CK) Копирование файлов также может выполняться параллельно между внутренними системами жертвы для поддержки горизонтального перемещения с удаленным выполнением с использованием встроенных протоколов обмена файлами, таких как обмен файлами по SMB с подключенными сетевыми ресурсами. (Цитата: Предприятие ATT&CK)\n\nВ средах систем управления вредоносное ПО может использовать SMB и другие протоколы обмена файлами для горизонтального перемещения по промышленным сетям."
    },
    "T0868": {
      "name": "Определить рабочий режим",
      "description": "Злоумышленники могут собирать информацию о текущем рабочем режиме ПЛК или контроллеров. Режимы работы определяют, какими функциями изменения или обслуживания можно манипулировать, и часто они управляются клавишным переключателем на ПЛК (например, запуск, прог [программа] и удаленное управление). Знание этих состояний может оказаться полезным для злоумышленника, поскольку он сможет определить, сможет ли он перепрограммировать ПЛК. Режимы работы и механизмы их выбора часто различаются в зависимости от поставщика и линейки продуктов. Ниже описаны некоторые часто реализуемые режимы работы:\n\n* Программа — этот режим необходимо включить, прежде чем можно будет внести изменения в программу устройства. Это позволяет загружать и скачивать программы между устройством и рабочей станцией инженера. Часто логика ПЛК останавливается, и все выходы могут быть принудительно отключены. (Цитата: Н.А., октябрь 2017 г.)  \n* Run - В этом режиме происходит выполнение программы устройства. Ввод и вывод (значения, точки, теги, элементы и т. д.) отслеживаются и используются в соответствии с логикой программы. [Загрузка программы](https://attack.mitre.org/techniques/T0845) и [Загрузка программы](https://attack.mitre.org/techniques/T0843) в этом режиме отключены. (Цитирование: Omron) (Цитирование: Machine Information Systems, 2007 г.) (Цитирование: NA, октябрь 2017 г.) (Цитирование: PLCgurus, 2021 г.)   \n* Удаленный — позволяет удаленно изменять режим работы ПЛК. (Цитата: PLCgurus 2021)    \n* Стоп – ПЛК и программа останавливаются, в этом режиме выходы принудительно отключаются. (Цитата: Машинные информационные системы, 2007 г.)   \n* Сброс – условия ПЛК сбрасываются в исходное состояние. Теплый сброс может сохранить часть памяти, тогда как холодный сброс приведет к сбросу всех регистров ввода-вывода и данных. (Цитата: Машинные информационные системы, 2007 г.)   \n* Режим тестирования/мониторинга. Аналогично режиму работы, обрабатывается ввод-вывод, хотя этот режим позволяет осуществлять мониторинг, принудительную настройку, сброс и, в более общем плане, настройку или отладку системы. Часто режим монитора можно использовать в качестве пробной версии для инициализации. (Цитата: Омрон)"
    },
    "T0869": {
      "name": "Стандартный протокол прикладного уровня",
      "description": "Злоумышленники могут установить возможности управления и контроля через широко используемые протоколы прикладного уровня, такие как HTTP(S), OPC, RDP, telnet, DNP3 и modbus. Эти протоколы могут использоваться для маскировки действий злоумышленника под безопасным сетевым трафиком. Стандартные протоколы можно увидеть через связанный с ними порт или, в некоторых случаях, через нестандартный порт.  Злоумышленники могут использовать эти протоколы для выхода из сети для управления и контроля или, в некоторых случаях, для доступа к другим зараженным устройствам в сети."
    },
    "T0871": {
      "name": "Выполнение через API",
      "description": "Злоумышленники могут попытаться использовать интерфейсы прикладных программ (API), используемые для связи между управляющим программным обеспечением и оборудованием. Конкретные функции часто кодируются в API, которые могут вызываться программным обеспечением для задействования определенных функций на устройстве или другом программном обеспечении."
    },
    "T0872": {
      "name": "Удаление индикатора на хосте",
      "description": "Злоумышленники могут попытаться удалить индикаторы своего присутствия в системе, чтобы замести следы. В тех случаях, когда злоумышленник чувствует, что обнаружение неизбежно, он может попытаться перезаписать, удалить или скрыть изменения, внесенные в устройство."
    },
    "T0873": {
      "name": "Заражение файла проекта",
      "description": "Злоумышленники могут попытаться заразить файлы проекта вредоносным кодом. Эти файлы проекта могут состоять из объектов, организационных единиц программы, переменных, таких как теги, документации и других конфигураций, необходимых для работы программ ПЛК. (Цитата: Бекхофф) Используя встроенные функции инженерного программного обеспечения, злоумышленники могут загрузить зараженную программу в ПЛК в операционной среде, что позволит использовать дополнительные методы [Выполнения](https://attack.mitre.org/tactics/TA0104) и [Постоянства](https://attack.mitre.org/tactics/TA0110). (Цитата: PLCdev)\n\nЗлоумышленники могут экспортировать свой собственный код в файлы проекта с условиями для выполнения через определенные промежутки времени. (Цитата: Николас Фаллиер, Лиам О Мурчу, Эрик Чьен, февраль 2011 г.) Вредоносные программы позволяют злоумышленникам контролировать все аспекты процесса, выполняемого ПЛК. После загрузки файла проекта в ПЛК устройство рабочей станции может быть отключено, а зараженный файл проекта все еще будет выполняться. (Цитата: PLCdev)"
    },
    "T0874": {
      "name": "Зацепка",
      "description": "Злоумышленники могут подключиться к функциям интерфейса прикладного программирования (API), используемым процессами, для перенаправления вызовов на выполнение и средства повышения привилегий. Процессы Windows часто используют эти функции API для выполнения задач, требующих многократного использования системных ресурсов. Функции Windows API обычно хранятся в библиотеках динамической компоновки (DLL) как экспортированные функции. (Цитата: Предприятие ATT&CK)\n\nОдин из типов перехватов, наблюдаемый в ICS, включает перенаправление вызовов этих функций посредством перехвата таблицы адресов импорта (IAT). Перехват IAT использует модификации процесса IAT, в котором хранятся указатели на импортированные функции API. (Цитата: Николя Фаллиер, Лиам О Мурчу, Эрик Чьен, февраль 2011 г.)"
    },
    "T0877": {
      "name": "Изображение ввода/вывода",
      "description": "Злоумышленники могут попытаться перехватить значения процесса, связанные с входами и выходами ПЛК. Во время цикла сканирования ПЛК считывает состояние всех входов и сохраняет их в таблице изображений. (Цитата: Нанджундайя, Вайдьянатх) Таблица изображений — это внутренняя память ПЛК, в которой хранятся значения входов/выходов для одного сканирования во время выполнения пользовательской программы. После того как ПЛК выполнит всю логическую программу, он обновляет таблицу выходных изображений. Содержимое этой таблицы выходных изображений записывается в соответствующие точки вывода в модулях ввода-вывода.\n\nОписанные выше таблицы изображений ввода и вывода составляют образ ввода-вывода ПЛК. Этот образ используется пользовательской программой вместо прямого взаимодействия с физическим вводом-выводом. (Цитата: Спеннеберг, Ральф, 2016 г.)\n\nЗлоумышленники могут собирать состояние образа ввода-вывода ПЛК, используя устройства [Native API] (https://attack.mitre.org/techniques/T0834) для прямого доступа к областям памяти. Сбор данных о состоянии ввода-вывода ПЛК можно использовать для замены значений или информирования о будущих этапах атаки."
    },
    "T0878": {
      "name": "Подавление тревоги",
      "description": "Злоумышленники могут нацеливаться на сигналы тревоги функций защиты, чтобы не дать им уведомить операторов о критических условиях. Сообщения о тревогах могут быть частью общей системы оповещения и представлять особый интерес для злоумышленников. Нарушение работы системы сигнализации не влечет за собой нарушение работы системы отчетности в целом.\n\nВ презентации Secura, посвященной борьбе с OT, отмечается двойная цель для злоумышленников, пытающихся подавить сигналы тревоги: предотвратить подачу исходящих сигналов тревоги и предотвратить реагирование на входящие сигналы тревоги. (Цитата: Йос Ветцелс, Марина Кротофил 2019) Способ подавления может сильно зависеть от типа рассматриваемой тревоги:\n\n* Тревога, вызванная протокольным сообщением. \n* Тревога, сигнализируемая с помощью ввода/вывода \n* Бит сигнализации устанавливается во флаге (и читается)\n\nВ средах ICS злоумышленнику, возможно, придется подавлять или бороться с несколькими сигналами тревоги и/или распространением сигналов тревоги для достижения конкретной цели — уклониться от обнаружения или предотвратить возникновение запланированных ответов. (Цитата: Йос Ветцелс, Марина Кротофил, 2019 г.) Методы подавления могут включать в себя подделку или изменение дисплеев и журналов устройства, изменение кода памяти до фиксированных значений или даже подделку кода инструкций уровня ассемблера."
    },
    "T0879": {
      "name": "Ущерб имуществу",
      "description": "При атаке на системы управления злоумышленники могут нанести ущерб и уничтожить имущество, инфраструктуру, оборудование и окружающую среду. Этот метод может привести к поломке устройства и рабочего оборудования или представлять собой косвенный ущерб от других методов, использованных при атаке. В зависимости от серьезности физического повреждения и сбоев в работе процессов и систем управления, этот метод может привести к [Потере безопасности] (https://attack.mitre.org/techniques/T0880). Операции, которые приводят к [Потере контроля](https://attack.mitre.org/techniques/T0827), также могут причинить материальный ущерб, который может быть прямо или косвенно мотивирован противником, стремящимся нанести удар в форме [Потери производительности и доходов](https://attack.mitre.org/techniques/T0828).\n\nФедеральное управление информационной безопасности Германии (BSI) сообщило о целенаправленной атаке на сталелитейный завод в разделе «Инциденты, затрагивающие бизнес» своего отчета по ИТ-безопасности за 2014 год. (Цитата: BSI State of IT Security 2014) Эти целевые атаки затронули промышленные операции и привели к поломке компонентов систем управления и даже целых установок. В результате этих поломок произошел массовый удар и ущерб в результате неконтролируемой остановки доменной печи.\n\nПольский студент использовал устройство дистанционного управления для взаимодействия с городской трамвайной системой Лодзи в Польше. (Цитирование: Джон Билл, май 2017 г.) (Цитирование: Шелли Смит, февраль 2008 г.) (Цитирование: Брюс Шнайер, январь 2008 г.) С помощью этого пульта студент смог улавливать и воспроизводить настоящие сигналы трамвая. В результате был нанесен ущерб пострадавшим трамваям, людям и окружающему имуществу. Сообщается, что четыре трамвая сошли с рельсов и были вынуждены сделать экстренную остановку. (Цитата: Шелли Смит, февраль 2008 г.) Команды, отданные студентом, также могли привести к столкновениям трамваев, причинив вред тем, кто находился на борту, и окружающей среде снаружи. (Цитата: Брюс Шнайер, январь 2008 г.)"
    },
    "T0880": {
      "name": "Потеря безопасности",
      "description": "Злоумышленники могут поставить под угрозу функции системы безопасности, предназначенные для поддержания безопасной работы процесса, при возникновении неприемлемых или опасных условий. Системы безопасности часто состоят из тех же элементов, что и системы управления, но имеют единственную цель — обеспечить сбой процесса заранее заданным безопасным образом.\n\nМногие небезопасные ситуации при управлении технологическими процессами возникают слишком быстро, чтобы человек-оператор мог на них отреагировать. Скорость имеет решающее значение для исправления этих условий, чтобы ограничить серьезные последствия, такие как потеря контроля и материальный ущерб.\n\nЗлоумышленники могут нацеливаться и отключать функции системы безопасности в качестве предварительного условия для последующего выполнения атаки или для того, чтобы позволить будущим небезопасным условиям остаться незамеченными. Обнаружение потери безопасности операторами может привести к остановке процесса из-за строгих политик в отношении систем безопасности. Это может привести к потере производительности и доходов и может удовлетворить технические цели злоумышленников, стремящихся вызвать сбои в процессах."
    },
    "T0881": {
      "name": "Остановка обслуживания",
      "description": "Злоумышленники могут остановить или отключить службы в системе, чтобы сделать эти службы недоступными для законных пользователей. Остановка критически важных служб может затруднить или остановить реакцию на инцидент или помочь в достижении общих целей злоумышленника по нанесению ущерба окружающей среде. (Цитата: Enterprise ATT&CK) Службы могут не допускать изменения своих хранилищ данных во время работы. Злоумышленники могут остановить службы, чтобы провести уничтожение данных. (Цитата: Предприятие ATT&CK)"
    },
    "T0882": {
      "name": "Кража оперативной информации",
      "description": "Злоумышленники могут украсть оперативную информацию о производственной среде в качестве прямого результата миссии для личной выгоды или для информирования о будущих операциях. Эта информация может включать в себя проектную документацию, графики, данные о ротации или аналогичные артефакты, которые дают представление об операциях.    Во время инцидента с плотиной Боумен злоумышленники проверяли системы на наличие оперативных данных. (Цитата: Марк Томпсон, март 2016 г.) (Цитата: Дэнни Ядрон, декабрь 2015 г.)"
    },
    "T0883": {
      "name": "Устройство с доступом к Интернету",
      "description": "Злоумышленники могут получить доступ к промышленной среде через системы, подключенные непосредственно к Интернету для удаленного доступа, а не через [Внешние удаленные службы] (https://attack.mitre.org/techniques/T0822). Устройства, доступные через Интернет, непреднамеренно или намеренно подвергаются воздействию Интернета без надлежащей защиты. Это может позволить злоумышленникам проникнуть непосредственно в сеть системы управления. Доступ к этим устройствам осуществляется без использования эксплойтов, они будут представлены с помощью метода [Exploit Public-Facing Application] (https://attack.mitre.org/techniques/T0819).\n\nЗлоумышленники могут использовать встроенные функции для удаленного доступа, которые могут быть незащищены, или использовать минимальные устаревшие средства защиты, которые могут быть атакованы. (Цитата: NCCIC, январь 2014 г.) Эти услуги можно обнаружить с помощью инструментов онлайн-сканирования.\n\nВ случае с плотиной Боумен злоумышленники воспользовались доступом к сети управления плотиной через сотовый модем. Доступ к устройству был защищен аутентификацией по паролю, хотя приложение было уязвимо для перебора. (Цитата: NCCIC, январь 2014 г.) (Цитата: Дэнни Ядрон, декабрь 2015 г.) (Цитата: Марк Томпсон, март 2016 г.)\n\nВ ходе производственных операций Trend Micro по обману были обнаружены злоумышленники, которые использовали прямой доступ через Интернет к среде АСУ ТП посредством раскрытия операционных протоколов, таких как Siemens S7, Omron FINS и EtherNet/IP, а также неправильно настроенного доступа VNC. (Цитата: Стивен Хилт, Федерико Магги, Чарльз Перин, лорд Реморин, Мартин Рслер и Райнер Восселер)"
    },
    "T0884": {
      "name": "Прокси-сервер подключения",
      "description": "Злоумышленники могут использовать прокси-сервер подключения для направления сетевого трафика между системами или выступать в качестве посредника для сетевых коммуникаций.\n\nОпределение прокси-сервера также можно расширить, чтобы охватить доверительные отношения между сетями в одноранговых, ячеистых или доверенных соединениях между сетями, состоящими из хостов или систем, которые регулярно взаимодействуют друг с другом.\n\nСеть может находиться в пределах одной организации или в нескольких организациях с доверительными отношениями. Злоумышленники могут использовать эти типы отношений для управления командными и управляющими коммуникациями, для уменьшения количества одновременных исходящих сетевых подключений, для обеспечения устойчивости в случае потери соединения или для использования существующих надежных путей связи между жертвами, чтобы избежать подозрений. (Цитата: Предприятие ATT&CK, январь 2018 г.)"
    },
    "T0885": {
      "name": "Часто используемый порт",
      "description": "Злоумышленники могут обмениваться данными через часто используемый порт, чтобы обойти межсетевые экраны или системы обнаружения сети и слиться с обычной сетевой деятельностью, чтобы избежать более детальной проверки. Они могут использовать протокол, связанный с портом, или совершенно другой протокол. Они могут использовать обычно открытые порты, как показано в примерах ниже. \n \n * TCP:80 (HTTP) \n * TCP: 443 (HTTPS) \n * TCP/UDP:53 (DNS) \n * TCP: 1024-4999 (OPC в XP/Win2k3) \n * TCP: 49152-65535 (OPC в Vista и более поздних версиях) \n * TCP:23 (ТЕЛНЕТ) \n * UDP:161 (SNMP) \n * TCP:502 (MODBUS) \n * TCP:102 (S7comm/ISO-TSAP) \n * TCP:20000 (DNP3) \n * TCP:44818 (Ethernet/IP)"
    },
    "T0886": {
      "name": "Удаленные услуги",
      "description": "Злоумышленники могут использовать удаленные сервисы для перемещения между активами и сегментами сети. Эти службы часто используются, чтобы позволить операторам удаленно взаимодействовать с системами внутри сети, например, RDP, SMB, SSH и другие подобные механизмы. (Цитата: Блейк Джонсон, Дэн Кабан, Марина Кротофил, Дэн Скали, Натан Брубейкер, Кристофер Глайер, декабрь 2017 г.) (Цитата: Драгос, декабрь 2017 г.) (Цитата: Джо Слоуик, апрель 2019 г.)\n\nУдаленные службы могут использоваться для поддержки удаленного доступа, передачи данных, аутентификации, разрешения имен и других удаленных функций. Кроме того, могут потребоваться удаленные услуги, позволяющие операторам и администраторам настраивать системы в сети со своих рабочих станций проектирования или управления. Злоумышленник может использовать эту технику для доступа к устройствам, которые могут иметь двойное подключение (Цитата: Блейк Джонсон, Дэн Кабан, Марина Кротофил, Дэн Скали, Натан Брубейкер, Кристофер Глайер, декабрь 2017 г.), к нескольким сегментам сети и может использоваться для [Загрузки программы] (https://attack.mitre.org/techniques/T0843) или для выполнения атак на устройства управления напрямую через [Valid Учетные записи] (https://attack.mitre.org/techniques/T0859).\n\nОпределенные удаленные службы (RDP и VNC) могут стать предшественником возможности выполнения [Графического интерфейса пользователя] (https://attack.mitre.org/techniques/T0823) на таких устройствах, как HMI или программное обеспечение инженерной рабочей станции.\n\nОсновываясь на данных об инцидентах, CISA и ФБР пришли к выводу, что спонсируемые китайским государством субъекты также взломали различные авторизованные каналы удаленного доступа, включая системы, предназначенные для передачи данных и/или обеспечения доступа между корпоративными сетями и сетями АСУ ТП.  (Цитата: CISA AA21-201A, вторжение в трубопровод, июль 2021 г.)"
    },
    "T0887": {
      "name": "Беспроводной анализ",
      "description": "Злоумышленники могут попытаться перехватить радиочастотную связь, используемую для дистанционного управления и отчетности в распределенных средах. Частоты радиочастотной связи варьируются от 3 кГц до 300 ГГц, хотя обычно они составляют от 300 МГц до 6 ГГц. (Цитата: Канделл, Р., Хани, М., Ли, К.Б., Лю, Й., Куимби, Дж., Ремли, К., апрель 2018 г.) Длина волны и частота сигнала влияют на то, как сигнал распространяется на открытом воздухе, через препятствия (например, стены и деревья) и тип радиосигнала, необходимый для их захвата. Эти характеристики часто стандартизируются в протоколе и аппаратном обеспечении и могут влиять на способ захвата сигнала. Некоторые примеры беспроводных протоколов, которые можно встретить в киберфизических средах: WirelessHART, Zigbee, WIA-FA и 700 МГц Public Safety Spectrum.\n\nЗлоумышленники могут перехватить радиочастотную связь, используя специальное оборудование, такое как программно-конфигурируемая радиосвязь (SDR), портативная радиостанция или компьютер с радиодемодулятором, настроенным на частоту связи. (Цитата: Бастилия, апрель 2017 г.) Информация, передаваемая по беспроводной среде, может быть перехвачена в пути независимо от того, является ли перехватывающее устройство предполагаемым пунктом назначения или нет. Этот метод может быть особенно полезен злоумышленнику, когда сообщения не зашифрованы. (Цитата: Галлахер, С., апрель 2017 г.)\n\nПредполагается, что в инциденте с Dallas Siren в 2017 году злоумышленники, вероятно, перехватили беспроводную трансляцию командных сообщений на частоте 700 МГц во время регулярного тестирования системы. Эти сообщения позже были воспроизведены, чтобы вызвать срабатывание систем сигнализации. (Цитата: Галлахер, С., апрель 2017 г.)"
    },
    "T0888": {
      "name": "Удаленное обнаружение системной информации",
      "description": "Злоумышленник может попытаться получить подробную информацию об удаленных системах и их периферийных устройствах, такую ​​как марка/модель, роль и конфигурация. Злоумышленники могут использовать информацию, полученную при удаленном обнаружении системной информации, для определения и формирования последующего поведения. Например, оперативная роль системы и модельная информация могут определять, является ли она подходящей целью для оперативных целей противника. Кроме того, конфигурация системы может использоваться для определения объема последующего использования техники.\n\nЗапросы системной информации обычно реализуются с использованием протоколов автоматизации и управления и часто автоматически запрашиваются программным обеспечением поставщика во время нормальной работы. Эта информация может использоваться для адаптации действий управления, таких как загрузка программы и прошивка системы или модуля. Злоумышленник может использовать эту же информацию, отправляя вызовы непосредственно к API системы."
    },
    "T0889": {
      "name": "Изменить программу",
      "description": "Злоумышленники могут изменить или добавить программу на контроллер, чтобы повлиять на его взаимодействие с физическим процессом, периферийными устройствами и другими хостами в сети. Модификацию программ контроллера можно выполнить с помощью загрузки программы в дополнение к другим типам модификации программы, таким как онлайн-редактирование и добавление программы.\n\nМодификация программы включает добавление и модификацию инструкций и логики, содержащихся в программных организационных единицах (POU) (Цитата: МЭК, февраль 2013 г.) и аналогичных элементах программирования, имеющихся в контроллерах. Это может включать, например, добавление новых функций в контроллер, изменение логики существующих функций и выполнение новых вызовов одной функции к другой.\n\nНекоторые программы могут позволить злоумышленнику напрямую взаимодействовать с собственным API контроллера, чтобы воспользоваться неизвестными функциями или уязвимостями."
    },
    "T0890": {
      "name": "Использование для повышения привилегий",
      "description": "Злоумышленники могут использовать уязвимости программного обеспечения в попытке повысить привилегии. Эксплуатация уязвимости программного обеспечения происходит, когда злоумышленник использует программную ошибку в программе, службе или в программном обеспечении или ядре операционной системы для выполнения кода, контролируемого злоумышленником. Конструкции безопасности, такие как уровни разрешений, часто препятствуют доступу к информации и использованию определенных методов, поэтому злоумышленникам, вероятно, придется выполнить повышение привилегий, чтобы включить использование программных эксплойтов для обхода этих ограничений. (Цитата: Корпорация MITRE)\n\nПри первоначальном получении доступа к системе злоумышленник может действовать в рамках процесса с более низкими привилегиями, что не позволит ему получить доступ к определенным ресурсам в системе. Могут существовать уязвимости, обычно в компонентах операционной системы и программном обеспечении, обычно работающем с более высокими разрешениями, которые можно использовать для получения более высоких уровней доступа к системе. Это может позволить кому-то перейти от непривилегированных или пользовательских разрешений к системным или корневым разрешениям в зависимости от уязвимого компонента. Это может быть необходимым шагом для злоумышленника, ставящего под угрозу правильно настроенную конечную систему и ограничивающего другие методы повышения привилегий. (Цитата: Корпорация MITRE)"
    },
    "T0891": {
      "name": "Жестко закодированные учетные данные",
      "description": "Злоумышленники могут использовать учетные данные, жестко закодированные в программном обеспечении или встроенном ПО, для получения несанкционированного интерактивного сеанса пользователя с активом. Примеры учетных данных, которые могут быть жестко запрограммированы в активе, включают:\n\n* Имя пользователя/пароли\n* Криптографические ключи/сертификаты\n* API-токены\n\nВ отличие от [Учетных данных по умолчанию] (https://attack.mitre.org/techniques/T0812), эти учетные данные встроены в систему таким образом, что владелец актива либо не может их изменить, либо их невозможно изменить из-за влияния, которое это может оказать на работу системы управления. Эти учетные данные могут повторно использоваться во всех линейках продуктов или моделях устройств и часто не публикуются и не известны владельцу и операторам актива.\n\nЗлоумышленники могут использовать эти жестко закодированные учетные данные для перемещения по среде системы управления или предоставления надежного доступа к своим инструментам для взаимодействия с промышленными активами."
    },
    "T0892": {
      "name": "Изменить учетные данные",
      "description": "Злоумышленники могут изменить учетные данные программного обеспечения и устройства, чтобы предотвратить доступ оператора и ответчика. В зависимости от устройства изменение или добавление этого пароля может помешать выполнению любых действий по настройке устройства и может потребовать сброса настроек или замены оборудования. Эти учетные данные часто являются встроенными функциями, предоставляемыми поставщиками устройств в качестве средства ограничения доступа к интерфейсам управления.\n\nЗлоумышленник, имеющий доступ к действительным или жестко запрограммированным учетным данным, может изменить учетные данные, чтобы предотвратить в будущем доступ к авторизованному устройству. Изменение учетных данных может быть особенно опасным в сочетании с другими методами, такими как изменение программы, уничтожение данных или изменение задач контроллера. В этих случаях конфигурация устройства может быть уничтожена или включать в себя вредоносные действия для среды процесса, которые невозможно удалить обычными действиями по настройке устройства.\n\nКроме того, восстановление устройства и исходной конфигурации может быть затруднено в зависимости от функций устройства. В некоторых случаях эти пароли невозможно удалить на месте, и может потребоваться отправка устройства обратно поставщику для дополнительных действий по восстановлению.\n\nЦепочка инцидентов произошла в Германии, где злоумышленники заблокировали операторам доступ к контроллерам системы автоматизации зданий (BAS), включив ранее отключенный ключ BCU. (Цитата: Блокировка BAS в Германии, декабрь 2021 г.)"
    },
    "T0893": {
      "name": "Данные из локальной системы",
      "description": "Злоумышленники могут нацеливать и собирать данные из локальных системных источников, таких как файловые системы, файлы конфигурации или локальные базы данных. Сюда могут входить конфиденциальные данные, такие как спецификации, схемы или диаграммы компоновки, устройств и процессов системы управления.\n\nЗлоумышленники могут сделать это, используя методы [Интерфейс командной строки](https://attack.mitre.org/techniques/T0807) или [Сценарии](https://attack.mitre.org/techniques/T0853) для взаимодействия с файловой системой для сбора информации. Злоумышленники также могут использовать [Автоматический сбор](https://attack.mitre.org/techniques/T0802) в локальной системе."
    },
    "T0894": {
      "name": "Выполнение системного двоичного прокси",
      "description": "Злоумышленники могут обойти защиту на основе процессов и/или сигнатур, проксируя выполнение вредоносного контента с помощью подписанных или иным образом доверенных двоичных файлов. Двоичные файлы, используемые в этом методе, часто представляют собой файлы, подписанные Microsoft, что указывает на то, что они либо были загружены с Microsoft, либо уже встроены в операционную систему. (Цитата: Проект LOLBAS) Двоичные файлы, подписанные доверенными цифровыми сертификатами, обычно могут выполняться в системах Windows, защищенных проверкой цифровой подписи. Несколько подписанных Microsoft двоичных файлов, которые используются по умолчанию в установках Windows, могут использоваться для прокси-выполнения других файлов или команд. Аналогично, в системах Linux злоумышленники могут злоупотреблять доверенными двоичными файлами, например выполнять разделение на прокси-серверы вредоносных команд. (Цитата: разделенная справочная страница) (Цитата: разделение GTFO)\n\nЗлоумышленники могут злоупотреблять двоичными файлами приложений, установленными в системе, для прокси-выполнения вредоносного кода или команд, специфичных для домена. Эти команды можно использовать для нацеливания на локальные ресурсы на устройстве или сетевых устройствах в среде с помощью определенных API ([Выполнение через API] (https://attack.mitre.org/techniques/T0871)) или языков программирования для конкретных приложений (например, MicroSCADA SCIL). Двоичные файлы приложений могут быть подписаны разработчиком или в целом доверены операторам, аналитикам и инструментам мониторинга, привыкшим к среде. Эти приложения могут быть разработаны и/или предоставлены непосредственно поставщиком устройства, чтобы обеспечить возможность настройки, управления и эксплуатации своих устройств без множества альтернатив.\n\nЗлоумышленники могут попытаться использовать эти доверенные двоичные файлы приложений для выполнения или отправки команд без разработки специального вредоносного ПО. Например, злоумышленники могут нацелиться на двоичный файл сервера SCADA, который имеет существующую возможность отправлять команды устройствам подстанции, например, через командные сообщения IEC 104. Выполнение прокси-сервера может по-прежнему требовать разработки специальных инструментов для подключения к выполнению двоичного файла приложения."
    },
    "T0895": {
      "name": "Автозапуск образа",
      "description": "Злоумышленники могут использовать функции автозапуска или сценарии для выполнения вредоносного кода. Устройства, настроенные для включения функции автозапуска, или устаревшие операционные системы могут быть подвержены злоупотреблению этими функциями для запуска вредоносного кода, хранящегося на различных съемных носителях (например, USB, образах дисков [.ISO]). Обычно AutoRun или AutoPlay отключены во многих конфигурациях операционных систем, чтобы защититься от этого метода. Если устройство настроено на включение автозапуска или автозапуска, злоумышленники могут выполнить код на устройстве, подключив к нему съемный носитель физическими или виртуальными средствами. Это может быть особенно актуально для сред виртуальных машин, где образы дисков могут быть динамически сопоставлены с гостевой системой на гипервизоре.\n\nПримером может служить получение злоумышленником доступа к гипервизору через интерфейс управления для изменения аппаратной конфигурации виртуальной машины. Затем они могли развернуть ISO-образ с помощью вредоносного сценария автозапуска, чтобы виртуальная машина автоматически выполнила код, содержащийся в образе диска. Это позволит выполнять вредоносный код на виртуальной машине без необходимости предварительного удаленного доступа к этой системе."
    }
  },
  "groups": {
    "G0032": {
      "name": "Лазарь Групп",
      "description": "[Lazarus Group](https://attack.mitre.org/groups/G0032) — это спонсируемая государством группа киберугроз Северной Кореи, приписываемая Генеральному бюро разведки (RGB). (Цитата: US-CERT HIDDEN COBRA, июнь 2017 г.) (Цитата: Казначейство Северной Кореи, сентябрь 2019 г.) [Lazarus Group](https://attack.mitre.org/groups/G0032) активна как минимум с 2009 г. и, как сообщается, несет ответственность за разрушительную атаку Wiper на Sony Pictures Entertainment в ноябре 2014 г., которую Novetta определила как часть операции Blockbuster. Вредоносное ПО, используемое [Lazarus Group](https://attack.mitre.org/groups/G0032), коррелирует с другими кампаниями, о которых сообщалось, включая Operation Flame, Operation 1Mission, Operation Troy, DarkSeoul и Ten Days of Rain. (Цитата: Novetta Blockbuster)\n\nКибероперации Северной Кореи продемонстрировали последовательную модель адаптации, формирования и реорганизации подразделений по мере изменения национальных приоритетов. Эти подразделения часто используют общий персонал, инфраструктуру, вредоносное ПО и профессиональные навыки, что затрудняет определение конкретных операций с высокой степенью достоверности. В публичных отчетах «Группа Lazarus» часто используется в качестве обобщающего термина для нескольких северокорейских кибероператоров, ведущих шпионаж, деструктивные атаки и финансово мотивированные кампании."
    },
    "G0034": {
      "name": "Команда песчаных червей",
      "description": "[Команда песчаных червей] (https://attack.mitre.org/groups/G0034) — это деструктивная группа угроз, которую приписали Главному разведывательному управлению (ГРУ) Главного центра специальных технологий (ГЦСТ) России, военная часть 74455. (Цитата: Обвинительное заключение окружного суда США, подразделение ГРУ 74455, октябрь 2020 г.) (Цитата: UK NCSC Olympic Attacks, октябрь 2020 г.) Это группа активна как минимум с 2009 года. (Цитата: iSIGHT Sandworm 2014) (Цитата: CrowdStrike VOODOO BEAR) (Цитата: USDOJ Sandworm, февраль 2020 г.) (Цитата: NCSC Sandworm, февраль 2020 г.)\n\nВ октябре 2020 года США предъявили обвинения шести офицерам подразделения 74455 ГРУ, связанным с [Sandworm Team](https://attack.mitre.org/groups/G0034), в следующих кибероперациях: атаки на украинские электрические компании и правительственные организации в 2015 и 2016 годах, всемирная атака [NotPetya](https://attack.mitre.org/software/S0368) в 2017 году, нацеливание на президентскую кампанию во Франции в 2017 году, нападение [Олимпийского разрушителя](https://attack.mitre.org/software/S0365) на Зимние Олимпийские игры в 2018 году, операцию 2018 года против Организации по запрещению химического оружия и нападения на Грузию в 2018 и 2019 годах. 2020 г.) (Цитата: Олимпийские атаки NCSC Великобритании, октябрь 2020 г.) Некоторые из них были проведены при содействии подразделения ГРУ 26165, которое также называется [APT28] (https://attack.mitre.org/groups/G0007). (Цитата: Обвинительное заключение Окружного суда США, октябрь 2018 г.) ГРУ)"
    },
    "G0035": {
      "name": "Стрекоза",
      "description": "[Dragonfly](https://attack.mitre.org/groups/G0035) — это группа кибершпионажа, которую приписывают Центру 16 Федеральной службы безопасности (ФСБ) России. [Dragonfly] (https://attack.mitre.org/groups/G0035) нацелен на оборонные и авиационные компании, правительственные учреждения, компании, связанные с промышленными системами управления, а также критически важные инфраструктурные сектора по всему миру с помощью атак на цепочки поставок, целевого фишинга и атак с целью взлома. (Цитата: Symantec Dragonfly) (Цитата: Secureworks IRON LIBERTY, июль 2019 г.) 2017 г.) (Цитата: Fortune Dragonfly 2.0, сентябрь 2017 г.) (Цитата: Gigamon Berserk Bear, октябрь 2021 г.) (Цитата: CISA AA20-296A Berserk Bear, декабрь 2020 г.) (Цитата: Symantec Dragonfly 2.0, октябрь 2017 г.)"
    },
    "G0037": {
      "name": "ФИН6",
      "description": "[FIN6](https://attack.mitre.org/groups/G0037) — это киберпреступная группа, которая украла данные платежных карт и продала их с целью получения прибыли на подпольных рынках. Эта группа агрессивно атаковала и взломала системы точек продаж (PoS) в гостиничном и розничном секторах. (Цитата: FireEye FIN6, апрель 2016 г.) (Цитата: FireEye FIN6, апрель 2019 г.)"
    },
    "G0046": {
      "name": "ФИН7",
      "description": "[FIN7](https://attack.mitre.org/groups/G0046) — это финансово мотивированная группа угроз, действующая с 2013 года. [FIN7](https://attack.mitre.org/groups/G0046) нацелена на розничную торговлю, ресторанный бизнес, гостиничный бизнес, программное обеспечение, консалтинг, финансовые услуги, медицинское оборудование, облачные сервисы, средства массовой информации, продукты питания и напитки, транспорт, фармацевтику и коммунальные услуги в США. Часть [FIN7](https://attack.mitre.org/groups/G0046) управлялась подставной компанией Combi Security и часто использовала вредоносное ПО в точках продаж для таргетинга. С 2020 года [FIN7](https://attack.mitre.org/groups/G0046) переключил свою деятельность на охоту на крупную дичь (BGH), включая использование программ-вымогателей [REvil](https://attack.mitre.org/software/S0496) и собственной программы-вымогателя как услуги (RaaS) Darkside. FIN7 может быть связан с группой [Carbanak](https://attack.mitre.org/groups/G0008), но с помощью [Carbanak](https://attack.mitre.org/software/S0030) было замечено несколько групп угроз, поэтому эти группы следует отслеживать отдельно. (Цитата: FireEye FIN7, март 2017 г.) (Цитата: FireEye FIN7, апрель) 2017 г.) (Цитата: FireEye CARBANAK, июнь 2017 г.) (Цитата: FireEye FIN7, август 2018 г.) (Цитата: CrowdStrike Carbon Spider, август 2021 г.) (Цитата: Mandiant FIN7, апрель 2022 г.) (Цитата: BiZone Lizar, май 2021 г.)"
    },
    "G0049": {
      "name": "Нефтяная вышка",
      "description": "[OilRig](https://attack.mitre.org/groups/G0049) — предполагаемая иранская группа угроз, которая преследует жертв на Ближнем Востоке и за рубежом, по крайней мере, с 2014 года. Группа нацелена на различные сектора, включая финансовый, правительственный, энергетический, химический и телекоммуникационный. Похоже, что группа осуществляет атаки на цепочки поставок, используя доверительные отношения между организациями для атаки на свои основные цели. Группа работает от имени иранского правительства на основе деталей инфраструктуры, содержащих ссылки на Иран, использование иранской инфраструктуры и нацеливание, соответствующее интересам национального государства. 2016 г.) (Цитата: Palo Alto OilRig, октябрь 2016 г.) (Цитата: Unit42 OilRig Playbook, 2023 г.) (Цитата: Unit 42 QUADAGENT, июль 2018 г.)"
    },
    "G0064": {
      "name": "АПТ33",
      "description": "[APT33] (https://attack.mitre.org/groups/G0064) — предполагаемая иранская группа угроз, которая осуществляет операции как минимум с 2013 года. Группа нацелена на организации из различных отраслей в США, Саудовской Аравии и Южной Корее, с особым интересом к авиационному и энергетическому секторам. (Цитата: FireEye APT33, сентябрь 2017 г.) (Цитата: Вебинар FireEye APT33, сентябрь 2017)"
    },
    "G0082": {
      "name": "АПТ38",
      "description": "[APT38](https://attack.mitre.org/groups/G0082) — спонсируемая государством группа угроз Северной Кореи, специализирующаяся на финансовых кибероперациях; его приписали Генеральному бюро разведки. (Цитата: CISA AA20-239A BeagleBoyz, август 2020 г.) Активный как минимум с 2014 года, [APT38](https://attack.mitre.org/groups/G0082) нацелен на банки, финансовые учреждения, казино, биржи криптовалют, конечные точки системы SWIFT и банкоматы как минимум в 38 странах мира. В число значимых операций входят ограбление Банка Бангладеш в 2016 году, в ходе которого [APT38](https://attack.mitre.org/groups/G0082) похитило 81 миллион долларов США, а также атаки на Bancomext (Цитата: FireEye APT38, октябрь 2018 г.) и Banco de Чили (Цитата: FireEye APT38, октябрь 2018 г.); некоторые из их атак были разрушительными. (Цитата: CISA AA20-239A BeagleBoyz, август 2020 г.) (Цитата: FireEye APT38, октябрь 2018 г.) (Цитата: Обвинительный акт Министерства юстиции Северной Кореи, февраль 2021 г.) (Цитата: блог Kaspersky Lazarus Under The Hood, 2017 г.)\n\nОпределения северокорейских группировок, как известно, во многом совпадают, и некоторые исследователи безопасности сообщают обо всей киберактивности, спонсируемой государством Северной Кореи, под названием [Lazarus Group](https://attack.mitre.org/groups/G0032) вместо отслеживания кластеров или подгрупп."
    },
    "G0088": {
      "name": "ТЕМП.Велес",
      "description": "[TEMP.Veles](https://attack.mitre.org/groups/G0088) — это российская группа угроз, нацеленная на критическую инфраструктуру. Было замечено, что группа использует [TRITON](https://attack.mitre.org/software/S0609), вредоносную программу, предназначенную для манипулирования системами промышленной безопасности."
    },
    "G0102": {
      "name": "Волшебный паук",
      "description": "[Wizard Spider](https://attack.mitre.org/groups/G0102) — это базирующаяся в России финансово мотивированная группа угроз, первоначально известная созданием и внедрением [TrickBot](https://attack.mitre.org/software/S0266) как минимум с 2016 года. [Wizard Spider](https://attack.mitre.org/groups/G0102) обладает разнообразным арсеналом инструментов. и проводил кампании по распространению программ-вымогателей против различных организаций, от крупных корпораций до больниц. (Цитата: CrowdStrike Ryuk, январь 2019 г.) (Цитата: DHS/CISA Ransomware Targeting Healthcare, октябрь 2020 г.) (Цитата: CrowdStrike Wizard Spider, октябрь 2020 г.)"
    },
    "G0115": {
      "name": "ЗОЛОТО Саутфилд",
      "description": "[GOLD SOUTHFIELD](https://attack.mitre.org/groups/G0115) — это финансово мотивированная группа угроз, действующая как минимум с 2018 года и управляющая службой [REvil](https://attack.mitre.org/software/S0496) Ransomware-as-a (RaaS). [GOLD SOUTHFIELD](https://attack.mitre.org/groups/G0115) предоставляет серверную инфраструктуру партнерам, набранным на подпольных форумах для выполнения дорогостоящих развертываний. К началу 2020 года [GOLD SOUTHFIELD](https://attack.mitre.org/groups/G0115) начал извлекать выгоду из новой тенденции кражи данных и дальнейшего вымогательства у жертвы, чтобы она заплатила за то, чтобы ее данные не были раскрыты публично. (Цитата: Secureworks REvil, сентябрь 2019 г.) (Цитата: Secureworks GandCrab и REvil, сентябрь 2019 г.) ЗОЛОТО Саутфилд) (Цитата: CrowdStrike Evolution of Pinchy Spider, июль 2021 г.)"
    },
    "G1000": {
      "name": "АЛЛАНИТ",
      "description": "[АЛЛАНИТ](https://attack.mitre.org/groups/G1000) — предполагаемая российская группа кибершпионажа, которая в первую очередь нацелена на сектор электроэнергетики в США и Великобритании. Сообщается, что тактика и методы группы аналогичны [Dragonfly] (https://attack.mitre.org/groups/G0035), хотя технические возможности [ALLANITE] (https://attack.mitre.org/groups/G1000) не проявляют подрывных или разрушительных способностей. Было предложено, чтобы группа сохранила присутствие в ICS с целью понимания процессов и сохранения устойчивости. (Цитата: Драгош)"
    },
    "G1001": {
      "name": "ГЕКСАН",
      "description": "[HEXANE](https://attack.mitre.org/groups/G1001) — это группа угроз кибершпионажа, которая нацелена на нефтегазовые, телекоммуникационные, авиационные и интернет-провайдеры как минимум с 2017 года. Целевые компании расположены на Ближнем Востоке и в Африке, включая Израиль, Саудовскую Аравию, Кувейт, Марокко и Тунис. TTP [HEXANE](https://attack.mitre.org/groups/G1001) похожи на [APT33](https://attack.mitre.org/groups/G0064) и [OilRig](https://attack.mitre.org/groups/G0049), но из-за различий в жертвах и инструментах он отслеживается как отдельный объект. (Цитата: Драгос) Гексан) (Цитата: Kaspersky Lyceum, октябрь 2021 г.) (Цитата: ClearSky Siamesekitten, август 2021 г.) (Цитата: Accenture Lyceum Targets, ноябрь 2021 г.)"
    },
    "G1027": {
      "name": "КиберМстители",
      "description": "[CyberAv3ngers](https://attack.mitre.org/groups/G1027) — это предположительно связанная с Корпусом стражей исламской революции (КСИР) иранского правительства группа APT. Известно, что [CyberAv3ngers](https://attack.mitre.org/groups/G1027) активны как минимум с 2020 года, выдвигая спорные и ложные заявления о взломе критической инфраструктуры в Израиле. (Цитата: CISA AA23-335A, связанная с КСИР, декабрь 2023 года)\n\nВ 2023 году [CyberAv3ngers](https://attack.mitre.org/groups/G1027) занимались глобальным нацеливанием и взломом Unitronics [Программируемый логический контроллер (ПЛК)](https://attack.mitre.org/assets/A0003) с помощью [Человеко-машинного интерфейса (ЧМИ)](https://attack.mitre.org/assets/A0002). Этот ПЛК можно найти во многих секторах, включая водоснабжение и водоотведение, энергетику, производство продуктов питания и напитков, а также здравоохранение. Наиболее заметной особенностью этой атаки было искажение пользовательского интерфейса устройства. (Цитата: CISA AA23-335A, связанная с КСИР, декабрь 2023 г.)"
    }
  },
  "software": {
    "S0038": {
      "name": "Дуку",
      "description": "[Duqu](https://attack.mitre.org/software/S0038) — это платформа вредоносного ПО, использующая модульный подход для расширения функциональности после развертывания в целевой сети. (Цитата: Symantec W32.Duqu)"
    },
    "S0089": {
      "name": "ЧерныйЭнергия",
      "description": "[BlackEnergy](https://attack.mitre.org/software/S0089) — это набор вредоносных программ, который использовался как преступниками, так и злоумышленниками. Он появился как минимум в 2007 году и изначально был разработан для создания ботнетов для использования при проведении распределенных атак типа «отказ в обслуживании» (DDoS), но его использование расширилось для поддержки различных плагинов. Он хорошо известен тем, что использовался во время конфронтации между Грузией и Россией в 2008 году, а также для нападения на украинские институты. Варианты включают BlackEnergy 2 и BlackEnergy 3. (Цитата: F-Secure BlackEnergy 2014)."
    },
    "S0093": {
      "name": "Бэкдор.Олдреа",
      "description": "[Backdoor.Oldrea](https://attack.mitre.org/software/S0093) — это модульный бэкдор, используемый [Dragonfly](https://attack.mitre.org/groups/G0035) против энергетических компаний по крайней мере с 2013 года. [Backdoor.Oldrea](https://attack.mitre.org/software/S0093) распространялся через компрометацию цепочки поставок и включался специализированные модули для перечисления и сопоставления систем, процессов и протоколов, специфичных для АСУ ТП. (Цитата: Symantec Dragonfly) (Цитата: Gigamon Berserk Bear, октябрь 2021 г.) (Цитата: Symantec Dragonfly, сентябрь 2017 г.)"
    },
    "S0143": {
      "name": "Пламя",
      "description": "[Flame](https://attack.mitre.org/software/S0143) — это сложный набор инструментов, который используется для сбора информации как минимум с 2010 года и в основном ориентирован на страны Ближнего Востока. (Цитата: Касперский Флейм)"
    },
    "S0366": {
      "name": "хочу плакать",
      "description": "[WannaCry](https://attack.mitre.org/software/S0366) — это программа-вымогатель, которая впервые была замечена в ходе глобальной атаки в мае 2017 года, которая затронула более 150 стран. Он содержит червеобразные функции, способные распространяться по компьютерной сети с помощью эксплойта SMBv1 EternalBlue."
    },
    "S0368": {
      "name": "НеПетя",
      "description": "[NotPetya](https://attack.mitre.org/software/S0368) — это вредоносное ПО, которое использовалось [Sandworm Team](https://attack.mitre.org/groups/G0034) во всемирной атаке, начавшейся 27 июня 2017 г. В то время как [NotPetya](https://attack.mitre.org/software/S0368) выглядит как форма программы-вымогатели, основной целью которых было уничтожение данных и дисковых структур скомпрометированных систем; злоумышленники никогда не намеревались сделать зашифрованные данные пригодными для восстановления. Таким образом, [NotPetya](https://attack.mitre.org/software/S0368) правильнее рассматривать как разновидность вредоносного ПО-вайпера. [NotPetya](https://attack.mitre.org/software/S0368) содержит функции, подобные червям, позволяющие распространяться по компьютерной сети с помощью эксплойтов SMBv1 EternalBlue и EternalRomance. (Цитирование: Talos Nyetya, июнь 2017 г.) (Цитирование: US-CERT NotPetya, 2017 г.) (Цитирование: ESET Telebots, июнь 2017) (Цитата: Обвинительное заключение окружного суда США, подразделение ГРУ 74455, октябрь 2020 г.)"
    },
    "S0372": {
      "name": "ЛокерГога",
      "description": "[LockerGoga](https://attack.mitre.org/software/S0372) — это программа-вымогатель, о которой впервые сообщалось в январе 2019 года и которая была связана с различными атаками на европейские компании, в том числе промышленные и производственные фирмы. (Цитирование: Unit42 LockerGoga 2019) (Цитирование: CarbonBlack LockerGoga 2019)"
    },
    "S0446": {
      "name": "Рюк",
      "description": "[Ryuk](https://attack.mitre.org/software/S0446) — это программа-вымогатель, предназначенная для атак на корпоративные среды, которая используется в атаках как минимум с 2018 года. [Ryuk](https://attack.mitre.org/software/S0446) имеет сходство кода с программой-вымогателем Hermes. (Цитата: CrowdStrike Ryuk, январь 2019 г.) (Цитата: FireEye Ryuk и Trickbot, январь 2019 г.) (Цитата: FireEye FIN6, апрель 2019 г.)"
    },
    "S0496": {
      "name": "РЕвил",
      "description": "[REvil](https://attack.mitre.org/software/S0496) — это семейство программ-вымогателей, которое связано с группой [GOLD SOUTHFIELD](https://attack.mitre.org/groups/G0115) и действует как программа-вымогатель как услуга (RaaS) как минимум с апреля 2019 года. [REvil](https://attack.mitre.org/software/S0496), который использовался против организаций в производственном, транспортном и электрическом секторах, обладает широкими возможностями настройки и имеет сходство кода с GandCrab RaaS. (Цитата: Secureworks REvil, сентябрь 2019 г.) (Цитата: Intel 471 REvil, март 2020 г.) (Цитата: Group IB Ransomware, май 2020 г.)"
    },
    "S0603": {
      "name": "Стакснет",
      "description": "[Stuxnet](https://attack.mitre.org/software/S0603) был первым публично опубликованным вредоносным ПО, специально нацеленным на устройства промышленных систем управления. [Stuxnet] (https://attack.mitre.org/software/S0603) — это большая и сложная вредоносная программа, которая использовала множество различных вариантов поведения, включая множество уязвимостей нулевого дня, сложный руткит Windows и процедуры сетевого заражения. (Цитата: Николас Фаллиер, Лиам О Мурчу, Эрик Чьен, февраль 2011 г.) (Цитата: CISA ICS Advisory ICSA-10-272-01)(Цитата: ESET Stuxnet Under the Microscope)(Цитата: Langer Stuxnet) [Stuxnet](https://attack.mitre.org/software/S0603) был обнаружен в 2010 году, а некоторые компоненты использовались еще в ноябре 2008 года. (Цитата: Николас Фаллиер, Лиам О Мурчу, Эрик Чиен, февраль 2011 г.)"
    },
    "S0604": {
      "name": "Промышленник",
      "description": "[Industroyer](https://attack.mitre.org/software/S0604) — сложная вредоносная программа, предназначенная для воздействия на рабочие процессы промышленных систем управления (ICS), в частности на компоненты, используемые на электрических подстанциях. (Цитата: ESET Industroyer) [Industroyer](https://attack.mitre.org/software/S0604) использовался в атаках на энергосистему Украины в декабре 2016. (Цитата: Dragos Crashoverride 2017) Это первая общеизвестная вредоносная программа, специально разработанная для нацеливания и воздействия на работу электросетей. (Цитата: Dragos Crashoverride 2018)."
    },
    "S0605": {
      "name": "ЭКАНС",
      "description": "[EKANS](https://attack.mitre.org/software/S0605) — это вариант программы-вымогателя, написанный на Golang, который впервые появился в середине декабря 2019 года и использовался против многих секторов, включая энергетику, здравоохранение и автомобилестроение, что в некоторых случаях приводило к значительным сбоям в работе. [EKANS] (https://attack.mitre.org/software/S0605) использовал жестко запрограммированный список уничтоженных процессов, включая некоторые, связанные с распространенными программными платформами АСУ ТП (например, GE Proficy, Honeywell HMIWeb и т. д.), аналогичный тем, которые определены в [MegaCortex] (https://attack.mitre.org/software/S0576). (Цитата: Драгос) ЭКАНС) (Цитата: Пало-Альто, отряд 42 ЭКАНС)"
    },
    "S0606": {
      "name": "Плохой кролик",
      "description": "[Bad Rabbit](https://attack.mitre.org/software/S0606) — это самораспространяющаяся программа-вымогатель, которая затронула украинский транспортный сектор в 2017 году. [Bad Rabbit](https://attack.mitre.org/software/S0606) также нацелен на организации и потребителей в России. (Цитата: Secure List Bad Rabbit) (Цитата: ESET Bad Rabbit) (Цитата: Драгос, апрель 2019 г.)"
    },
    "S0607": {
      "name": "КиллДиск",
      "description": "[KillDisk](https://attack.mitre.org/software/S0607) — это инструмент очистки диска, предназначенный для перезаписи файлов случайными данными, что приводит к невозможности загрузки ОС. Впервые он был замечен как компонент вредоносного ПО [BlackEnergy](https://attack.mitre.org/software/S0089) во время кибератак против Украины в 2015 году. [KillDisk](https://attack.mitre.org/software/S0607) с тех пор превратился в отдельное вредоносное ПО, используемое различными злоумышленниками против дополнительных целей в Европе и Латинской Америке; в 2016 году компонент программы-вымогателя был также включен в некоторые варианты [KillDisk](https://attack.mitre.org/software/S0607). (Цитирование: KillDisk Ransomware) (Цитирование: ESEST Black Energy, январь 2016 г.) (Цитирование: Trend Micro KillDisk 1) (Цитирование: Trend Micro KillDisk 2)"
    },
    "S0608": {
      "name": "Конфикер",
      "description": "[Conficker](https://attack.mitre.org/software/S0608) — компьютерный червь, впервые обнаруженный в октябре 2008 года и нацеленный на Microsoft Windows с целью распространения с помощью уязвимости Windows MS08-067. (Цитата: SANS Conficker) В 2016 году вариант [Conficker](https://attack.mitre.org/software/S0608) проник на компьютеры и съемные диски, принадлежащие атомная электростанция. (Цитата: Атомная электростанция Конфикер)"
    },
    "S1000": {
      "name": "АКАД/Медре.А",
      "description": "[ACAD/Medre.A](https://attack.mitre.org/software/S1000) — червь, похищающий оперативную информацию. Червь собирает файлы AutoCAD с чертежами. [ACAD/Medre.A](https://attack.mitre.org/software/S1000) может быть использован для промышленного шпионажа. (Цитата: ESET)"
    },
    "S1006": {
      "name": "ПЛК-Бластер",
      "description": "[PLC-Blaster](https://attack.mitre.org/software/S1006) — это экспериментальная вредоносная программа, работающая на ПЛК Siemens S7. Этот червь находит в сети другие ПЛК Siemens S7 и пытается их заразить.  Как только этот червь заразил свою цель и попытался заразить другие устройства в сети, червь может запустить один из многих модулей. (Цитирование: Спеннеберг, Ральф, Майк Брггеманн и Хендрик Швартке, март 2016 г.) (Цитирование: Спеннеберг, Ральф, 2016 г.)"
    },
    "S1009": {
      "name": "Тритон",
      "description": "[Triton](https://attack.mitre.org/software/S1009) — это система атак, созданная для взаимодействия с контроллерами Triconex Safety Instrumented System (SIS). (Цитата: Блейк Джонсон, Дэн Кабан, Марина Кротофил, Дэн Скали, Натан Брубейкер, Кристофер Глайер, декабрь 2017 г.) (Цитата: Драгос, декабрь 2017 г.) (Цитата: DHS CISA, февраль 2019 г.) (Цитата: Schneider Electric, январь 2018 г.) (Цитата: Джулиан Гутманис, март 2019 г.) (Цитата: Schneider, декабрь 2018 г.) (Цитата: Йос Ветцелс, январь 2018 г.)"
    },
    "S1010": {
      "name": "VPNФильтр",
      "description": "[VPNFilter](https://attack.mitre.org/software/S1010) — это многоступенчатая модульная платформа с универсальными возможностями для поддержки как сбора разведывательной информации, так и разрушительных операций кибератак. Модули [VPNFilter](https://attack.mitre.org/software/S1010), такие как анализатор пакетов («ps»), могут собирать трафик, проходящий через зараженное устройство, позволяя кражу учетных данных веб-сайта и мониторинг протоколов Modbus SCADA. (Цитата: Уильям Ларджент, июнь 2018 г.) (Цитата: Карл Херд, март 2019 г.) [VPNFilter](https://attack.mitre.org/software/S1010) по оценкам был заменен [Sandworm Team](https://attack.mitre.org/groups/G0034) на [Cyclops Blink](https://attack.mitre.org/software/S0687), начиная с 2019 г. (Цитата: Информационный бюллетень NCSC CISA Cyclops Blink, февраль 2022 г.)"
    },
    "S1045": {
      "name": "ИНКОНТРОЛЛЕР",
      "description": "[INCONTROLLER](https://attack.mitre.org/software/S1045) — это специальное вредоносное ПО, которое включает в себя несколько модулей, адаптированных для устройств и технологий АСУ ТП, включая ПЛК Schneider Electric и Omron, а также протоколы OPC UA, Modbus и CODESYS. [INCONTROLLER](https://attack.mitre.org/software/S1045) имеет возможность обнаруживать определенные устройства, загружать на них логику и использовать уязвимости, специфичные для платформы. По состоянию на сентябрь 2022 года некоторые исследователи безопасности оценили, что [INCONTROLLER](https://attack.mitre.org/software/S1045) был разработан CHERNOVITE. Уайли-22)"
    },
    "S1072": {
      "name": "Индустройер2",
      "description": "[Industroyer2](https://attack.mitre.org/software/S1072) — это скомпилированная статическая вредоносная программа, способная обмениваться данными по протоколу IEC-104. Он похож на модуль IEC-104, найденный в [Industroyer](https://attack.mitre.org/software/S0604). Исследователи безопасности полагают, что [Industroyer2](https://attack.mitre.org/software/S1072) был разработан для воздействия на высоковольтные электрические подстанции. Первоначальный образец [Industroyer2](https://attack.mitre.org/software/S1072) был скомпилирован 23 марта 2022 г. и запланирован к выполнению 08 апреля 2022 г., однако он был обнаружен до развертывания, что не оказало никакого влияния. (Цитата: Industroyer2 Blackhat ESET)"
    },
    "S1157": {
      "name": "Фукснет",
      "description": "[Fuxnet](https://attack.mitre.org/software/S1157) — вредоносное ПО, предназначенное для воздействия на инфраструктуру промышленной сети, управляющую датчиками системы контроля работы коммунальных предприятий в Москве. [Fuxnet](https://attack.mitre.org/software/S1157) связан с организацией, называемой хакерской группой Blackjack, которая, по оценкам, связана с украинскими спецслужбами. (Цитата: Claroty Fuxnet 2024)"
    },
    "S1165": {
      "name": "FrostyGoop",
      "description": "[FrostyGoop](https://attack.mitre.org/software/S1165) — это двоичный файл для Windows, написанный на Golang, который позволяет взаимодействовать с оборудованием промышленной системы управления (ICS) через Modbus TCP через порт 502. [FrostyGoop](https://attack.mitre.org/software/S1165) позволяет читать и записывать данные в регистры временного хранения на целевых устройствах, манипулируя работой систем в злонамеренных целях. [FrostyGoop](https://attack.mitre.org/software/S1165) связан с [Инцидентом FrostyGoop](https://attack.mitre.org/campaigns/C0041) в Украине. (Цитирование: Dragos FROSTYGOOP 2024) (Цитирование: Nozomi BUSTLEBERM 2024)"
    }
  },
  "mitigations": {
    "M0800": {
      "name": "Обеспечение соблюдения авторизации",
      "description": "Устройство или система должны предоставлять права чтения, манипулирования или выполнения только аутентифицированным пользователям, которым требуется доступ на основании утвержденных политик безопасности.  Схемы управления доступом на основе ролей (RBAC) могут помочь снизить затраты на назначение разрешений большому количеству устройств в ICS. Например, в стандарте IEC 62351 приведены примеры ролей, используемых для поддержки общих системных операций в электроэнергетическом секторе (Цитата: Международная электротехническая комиссия, июль 2020 г.), а стандарт IEEE 1686 определяет стандартные разрешения для пользователей интеллектуальных электронных устройств. (Цитата: Институт инженеров электротехники и электроники, январь 2014 г.)"
    },
    "M0801": {
      "name": "Управление доступом",
      "description": "Технологии управления доступом могут использоваться для обеспечения соблюдения политик и решений авторизации, особенно когда существующие полевые устройства не обеспечивают достаточных возможностей для поддержки идентификации и аутентификации пользователей. (Цитата: McCarthy, J et al., июль 2018 г.) Эти технологии обычно используют встроенное сетевое устройство или систему шлюзов для предотвращения доступа неаутентифицированных пользователей, а также интегрируются со службой аутентификации для первой проверки учетных данных пользователя. (Цитата: Центр защиты национальной инфраструктуры, ноябрь 2010 г.)"
    },
    "M0802": {
      "name": "Подлинность связи",
      "description": "При общении по ненадежной сети используйте безопасные сетевые протоколы, которые одновременно аутентифицируют отправителя сообщения и могут проверить его целостность. Это можно сделать либо с помощью кодов аутентификации сообщений (MAC), либо цифровых подписей для обнаружения поддельных сетевых сообщений и несанкционированных подключений."
    },
    "M0803": {
      "name": "Предотвращение потери данных",
      "description": "Технологии предотвращения потери данных (DLP) могут использоваться для выявления попыток злоумышленников украсть оперативную информацию, например инженерные планы, коммерческую тайну, рецепты, интеллектуальную собственность или телеметрические данные. Функциональность DLP может быть встроена в другие продукты безопасности, такие как межсетевые экраны или автономные пакеты, работающие в сети, и агенты на базе хоста. DLP можно настроить для предотвращения передачи информации через корпоративные ресурсы, такие как электронная почта, Интернет и физические носители, такие как USB, для хост-решений."
    },
    "M0804": {
      "name": "Аутентификация пользователя-человека",
      "description": "Требовать аутентификацию пользователя, прежде чем разрешить доступ к данным или принимать команды на устройстве. Хотя строгая многофакторная аутентификация предпочтительна, она не всегда осуществима в средах ICS. Выполнение строгой аутентификации пользователя также требует дополнительных мер безопасности и процессов, которые часто становятся целью соответствующих состязательных методов (например, действительные учетные записи, учетные данные по умолчанию). Поэтому в дополнение к этому следует учитывать соответствующие меры по снижению риска ATT&CK, включая [Многофакторную аутентификацию] (https://attack.mitre.org/mitigations/M0932), [Политику использования учетной записи] (https://attack.mitre.org/mitigations/M0936), [Политику паролей] (https://attack.mitre.org/mitigations/M0927), [Управление учетными записями пользователей] (https://attack.mitre.org/mitigations/M0918), [Управление привилегированными учетными записями] (https://attack.mitre.org/mitigations/M0926) и [Контроль учетных записей пользователей] (https://attack.mitre.org/mitigations/M1052)."
    },
    "M0805": {
      "name": "Слои механической защиты",
      "description": "Используйте многоуровневую систему защиты, основанную на системах физической или механической защиты, чтобы предотвратить ущерб имуществу, оборудованию, безопасности людей или окружающей среде. Примеры включают блокировки, разрывную мембрану, значения срабатывания и т. д. (Цитата: AG Foord, WG Gulland, CR Howard, T Kellacher, WH Smith 2004)."
    },
    "M0806": {
      "name": "Минимизируйте распространение беспроводного сигнала",
      "description": "Беспроводные сигналы часто распространяются за пределы организационных границ, что дает злоумышленникам возможность отслеживать беспроводную сеть или получать несанкционированный доступ к ней. (Цитата: CISA, март 2010 г.) Чтобы свести к минимуму эту угрозу, организациям следует принять меры по обнаружению, пониманию и сокращению ненужного распространения радиочастот. (Цитата: Национальная лаборатория технологий городской безопасности DHS, апрель 2019 г.)"
    },
    "M0807": {
      "name": "Сетевые белые списки",
      "description": "Списки разрешенных сетей могут быть реализованы либо через файлы хостов, либо через файлы хостов системы, чтобы указать, какие соединения (например, IP-адрес, MAC-адрес, порт, протокол) могут быть выполнены с устройства. Методы списков разрешений, которые работают на уровне приложения (например, DNP3, Modbus, HTTP), рассматриваются в разделе [Фильтрация сетевого трафика] (https://attack.mitre.org/mitigations/M0937)."
    },
    "M0808": {
      "name": "Шифрование сетевого трафика",
      "description": "Используйте сильные криптографические методы и протоколы для предотвращения подслушивания сетевых коммуникаций."
    },
    "M0809": {
      "name": "Конфиденциальность оперативной информации",
      "description": "Разверните механизмы для защиты конфиденциальности информации, связанной с операционными процессами, расположением объектов, конфигурациями устройств, программами или базами данных, которые могут содержать информацию, которая может быть использована для определения коммерческих тайн организации, рецептов и другой интеллектуальной собственности (ИС)."
    },
    "M0810": {
      "name": "Внеполосный канал связи",
      "description": "Имейте альтернативные методы для поддержки требований к связи во время сбоев связи и атак на целостность данных. (Цитата: Национальный институт стандартов и технологий, апрель 2013 г.) (Цитата: Агентство перспективных исследовательских проектов Министерства обороны)"
    },
    "M0811": {
      "name": "Резервирование услуг",
      "description": "Резервирование может быть обеспечено как для критически важных устройств АСУ ТП, так и для служб, таких как резервные устройства или устройства горячего резерва."
    },
    "M0812": {
      "name": "Инструментальные системы безопасности",
      "description": "Используйте системы безопасности (SIS), чтобы обеспечить дополнительный уровень защиты от сценариев опасности, которые могут привести к материальному ущербу. Система SIS обычно включает в себя датчики, логические решающие устройства и элемент конечного управления, который может использоваться для автоматического реагирования на опасные условия (Цитата: AG Foord, WG Gulland, CR Howard, T Kellacher, WH Smith, 2004). Убедитесь, что все SIS отделены от операционных сетей, чтобы предотвратить их дальнейшее состязательное поведение."
    },
    "M0813": {
      "name": "Программный процесс и аутентификация устройств",
      "description": "Требуйте аутентификации устройств и программных процессов, где это необходимо. Устройства, которые удаленно подключаются к другим системам, должны требовать строгой аутентификации, чтобы предотвратить подделку связи. Кроме того, программные процессы также должны требовать аутентификации при доступе к API."
    },
    "M0814": {
      "name": "Статическая конфигурация сети",
      "description": "Настройте хосты и устройства на использование статических сетевых конфигураций, когда это возможно. Протоколы, требующие динамического обнаружения/адресации (например, ARP, DHCP, DNS), могут использоваться для управления пересылкой сетевых сообщений и включения различных атак AiTM. Это смягчение не всегда может быть применимо из-за ограниченных функций устройства или проблем, связанных с различными конфигурациями сети."
    },
    "M0815": {
      "name": "Сторожевые таймеры",
      "description": "Используйте сторожевые таймеры, чтобы устройства могли быстро обнаружить, что система не отвечает."
    },
    "M0816": {
      "name": "Смягчение ограничено или неэффективно",
      "description": "Этот тип атаки невозможно легко смягчить с помощью превентивных мер, поскольку он основан на злоупотреблении функциями системы."
    },
    "M0817": {
      "name": "Управление цепочками поставок",
      "description": "Внедрите программу управления цепочкой поставок, включая политики и процедуры, гарантирующие, что все устройства и компоненты произведены надежным поставщиком и проверены на предмет их целостности."
    },
    "M0818": {
      "name": "Проверка входных данных программы",
      "description": "Устройства и программы, предназначенные для взаимодействия с параметрами системы управления, должны проверять формат и содержание всех вводимых пользователем данных и действий, чтобы гарантировать, что значения находятся в заданных рабочих диапазонах. Эти значения должны быть оценены и в дальнейшем реализованы посредством логики программы, работающей на полевом контроллере. Если обнаружен проблемный или неверный ввод, программы должны либо использовать заранее определенное безопасное значение, либо перейти в известное безопасное состояние, а также регистрировать событие или выдавать оповещения о нем. (Цитата: PLCTop20, март 2023 г.)."
    },
    "M0913": {
      "name": "Руководство для разработчиков приложений",
      "description": "Это смягчение описывает любые рекомендации или обучение, предоставляемые разработчикам приложений, чтобы избежать появления слабых мест в системе безопасности, которыми злоумышленник может воспользоваться."
    },
    "M0915": {
      "name": "Конфигурация Active Directory",
      "description": "Настройте Active Directory, чтобы предотвратить использование определенных методов; использовать идентификатор безопасности (SID), фильтрацию и т. д."
    },
    "M0916": {
      "name": "Сканирование уязвимостей",
      "description": "Сканирование уязвимостей используется для поиска потенциально опасных уязвимостей программного обеспечения и их устранения."
    },
    "M0917": {
      "name": "Обучение пользователей",
      "description": "Обучите пользователей быть в курсе попыток доступа или манипулирования со стороны злоумышленника, чтобы снизить риск успешного целевого фишинга, социальной инженерии и других методов, предполагающих взаимодействие с пользователем."
    },
    "M0918": {
      "name": "Управление учетными записями пользователей",
      "description": "Управляйте созданием, изменением, использованием и разрешениями, связанными с учетными записями пользователей."
    },
    "M0919": {
      "name": "Программа анализа угроз",
      "description": "Программа анализа угроз помогает организации генерировать собственную информацию об угрозах и отслеживать тенденции, чтобы определять приоритеты защиты для снижения рисков."
    },
    "M0920": {
      "name": "Проверка SSL/TLS",
      "description": "Разрыв и проверка сеансов SSL/TLS для проверки зашифрованного веб-трафика на предмет активности злоумышленников."
    },
    "M0921": {
      "name": "Ограничить веб-контент",
      "description": "Ограничить использование определенных веб-сайтов, заблокировать загрузки/вложения, заблокировать Javascript, ограничить расширения браузера и т. д."
    },
    "M0922": {
      "name": "Ограничить права доступа к файлам и каталогам",
      "description": "Ограничьте доступ, установив права доступа к каталогам и файлам, не специфичные для пользователей или привилегированных учетных записей."
    },
    "M0924": {
      "name": "Ограничить разрешения реестра",
      "description": "Ограничьте возможность изменять определенные кусты или ключи в реестре Windows."
    },
    "M0926": {
      "name": "Управление привилегированными учетными записями",
      "description": "Управляйте созданием, изменением, использованием и разрешениями, связанными с привилегированными учетными записями, включая SYSTEM и root."
    },
    "M0927": {
      "name": "Политика паролей",
      "description": "Устанавливайте и применяйте политики безопасных паролей для учетных записей."
    },
    "M0928": {
      "name": "Конфигурация операционной системы",
      "description": "Вносите изменения в конфигурацию, связанные с операционной системой или общей функцией операционной системы, которые приводят к усилению защиты системы от методов."
    },
    "M0930": {
      "name": "Сегментация сети",
      "description": "Спроектируйте участки сети, чтобы изолировать критически важные системы, функции или ресурсы. Используйте физическую и логическую сегментацию, чтобы предотвратить доступ к потенциально конфиденциальным системам и информации. Используйте демилитаризованную зону, чтобы содержать все службы с выходом в Интернет, которые не должны быть доступны из внутренней сети.  Ограничьте доступ к сети только необходимыми системами и службами. Кроме того, не позволяйте системам из других сетей или бизнес-функций (например, предприятия) получать доступ к критически важным системам управления процессами. Например, в IEC 62443 системы с одним и тем же уровнем безопасности должны быть сгруппированы в зону, а доступ к этой зоне ограничивается каналом или механизмом ограничения потоков данных между зонами путем сегментирования сети. (Цитата: МЭК, февраль 2019 г.) (Цитата: МЭК, август 2013 г.)"
    },
    "M0931": {
      "name": "Предотвращение сетевых вторжений",
      "description": "Используйте сигнатуры обнаружения вторжений для блокировки трафика на границах сети.  В средах промышленного управления система предотвращения вторжений в сеть должна быть настроена так, чтобы она не нарушала протоколы и коммуникации, отвечающие за функции реального времени, связанные с управлением или безопасностью."
    },
    "M0932": {
      "name": "Многофакторная аутентификация",
      "description": "Используйте два или более доказательств для аутентификации в системе; например имя пользователя и пароль, а также токен с физической смарт-карты или генератора токенов.  В средах промышленного управления активы, такие как контроллеры низкого уровня, рабочие станции и HMI, имеют требования к оперативному контролю и безопасности в режиме реального времени, которые могут ограничивать использование многофакторности."
    },
    "M0934": {
      "name": "Ограничить установку оборудования",
      "description": "Запретите пользователям или группам устанавливать или использовать неутвержденное оборудование в системах, включая USB-устройства."
    },
    "M0935": {
      "name": "Ограничить доступ к ресурсу по сети",
      "description": "Запретите доступ к общим файлам, удаленный доступ к системам, ненужным сервисам. Механизмы ограничения доступа могут включать использование сетевых концентраторов, шлюзов RDP и т. д."
    },
    "M0936": {
      "name": "Политика использования учетной записи",
      "description": "Настройте функции, связанные с использованием учетной записи, такие как блокировка попыток входа в систему, определенное время входа в систему и т. д."
    },
    "M0937": {
      "name": "Фильтровать сетевой трафик",
      "description": "Используйте сетевые устройства для фильтрации входящего или исходящего трафика и выполнения фильтрации на основе протоколов. Настройте программное обеспечение на конечных точках для фильтрации сетевого трафика.   Выполнение встроенного списка разрешений/запрещений сетевых сообщений на основе протокола прикладного уровня (OSI Layer 7), особенно для протоколов автоматизации. Списки разрешений приложений полезны, когда существуют четко определенные последовательности, типы, скорости или шаблоны обмена данными, необходимые во время ожидаемых операций системы. Списки запрещенных приложений могут потребоваться, если невозможно определить все приемлемые последовательности связи, но вместо этого можно запретить набор известных злонамеренных использований (например, чрезмерные попытки связи, сообщения о завершении работы, недопустимые команды).  Устройства, выполняющие эти функции, часто называют межсетевыми экранами глубокой проверки пакетов (DPI), контекстно-зависимыми межсетевыми экранами или межсетевыми экранами, блокирующими определенные брандмауэры, поддерживающие протокол автоматизации/SCADA. (Цитата: Центр защиты национальной инфраструктуры, февраль 2005 г.)"
    },
    "M0938": {
      "name": "Предотвращение выполнения",
      "description": "Блокируйте выполнение кода в системе с помощью управления приложениями и/или блокировки скриптов."
    },
    "M0941": {
      "name": "Шифрование конфиденциальной информации",
      "description": "Защитите хранящиеся конфиденциальные данные с помощью надежного шифрования."
    },
    "M0942": {
      "name": "Отключить или удалить функцию или программу",
      "description": "Удалите или запретите доступ к ненужному и потенциально уязвимому программному обеспечению, чтобы предотвратить злоупотребления со стороны злоумышленников."
    },
    "M0944": {
      "name": "Ограничить загрузку библиотеки",
      "description": "Предотвратите злоупотребление механизмами загрузки библиотек в операционной системе и программном обеспечении для загрузки ненадежного кода, настроив соответствующие механизмы загрузки библиотек и исследуя потенциально уязвимое программное обеспечение."
    },
    "M0945": {
      "name": "Подписание кода",
      "description": "Обеспечьте целостность двоичных файлов и приложений с помощью проверки цифровой подписи, чтобы предотвратить выполнение ненадежного кода."
    },
    "M0946": {
      "name": "Целостность загрузки",
      "description": "Используйте безопасные методы для загрузки системы и проверяйте целостность операционной системы и механизмов загрузки."
    },
    "M0947": {
      "name": "Аудит",
      "description": "Выполняйте аудит или сканирование систем, разрешений, небезопасного программного обеспечения, небезопасных конфигураций и т. д. для выявления потенциальных слабых мест. Выполняйте периодические проверки целостности устройства, чтобы убедиться в правильности встроенного ПО, программного обеспечения, программ и конфигураций. Проверки целостности, которые обычно включают криптографические хэши или цифровые подписи, следует сравнивать с проверками, полученными в известных действительных состояниях, особенно после таких событий, как перезагрузка устройства, загрузка программы или перезапуск программы."
    },
    "M0948": {
      "name": "Изоляция приложений и песочница",
      "description": "Ограничьте выполнение кода виртуальной средой в конечной системе или при ее передаче в конечную систему."
    },
    "M0949": {
      "name": "Антивирус/Антивредоносное ПО",
      "description": "Используйте сигнатуры или эвристику для обнаружения вредоносного программного обеспечения.  В средах промышленного контроля установки антивирусов и вредоносных программ должны быть ограничены активами, которые не участвуют в критически важных операциях или операциях в реальном времени. Чтобы свести к минимуму влияние на доступность системы, все продукты должны сначала быть проверены в репрезентативной тестовой среде перед развертыванием в производственных системах. (Цитата: NCCIC, август 2018 г.)"
    },
    "M0950": {
      "name": "Защита от эксплойтов",
      "description": "Используйте возможности для обнаружения и блокировки условий, которые могут привести к программному эксплойту или указать на него."
    },
    "M0951": {
      "name": "Обновление программного обеспечения",
      "description": "Регулярно обновляйте программное обеспечение, чтобы снизить риск эксплуатации. Обновления программного обеспечения, возможно, придется планировать во время простоев в работе."
    },
    "M0953": {
      "name": "Резервное копирование данных",
      "description": "Создавайте и храните резервные копии данных из систем конечных пользователей и критически важных серверов. Убедитесь, что системы резервного копирования и хранения защищены и хранятся отдельно от корпоративной сети во избежание взлома.   Поддерживать и реализовывать планы реагирования на инциденты (Цитата: Министерство внутренней безопасности, октябрь 2009 г.), включая управление «золотыми» резервными образами и конфигурациями ключевых систем, чтобы обеспечить быстрое восстановление и реагирование на вредоносные действия, влияющие на контроль, просмотр или доступность."
    },
    "M0954": {
      "name": "Конфигурация программного обеспечения",
      "description": "Внедрите изменения конфигурации программного обеспечения (кроме операционной системы) для снижения рисков безопасности, связанных с работой программного обеспечения."
    }
  },
  "meta": {
    "language": "ru",
    "domain": "ics",
    "generated_at": "2026-01-10T20:09:42+00:00",
    "generator": "google translate (deep-translator)",
    "note": "Это неофициальный машинный перевод. Возможны неточности."
  }
}
