{
  "tactics": {
    "TA0100": {
      "name": "Коллекция",
      "description": "Противник пытается собрать данные, представляющие интерес, и знания о домене в вашей среде ICS, чтобы сообщить свою цель.\n\nКоллекция состоит из методов, используемых противниками для сбора знаний о домене и получения контекстной обратной связи в среде ICS. Эта тактика часто выполняется в рамках [Discovery] (https://attack.mitre.org/tactics/TA0102) для сбора данных о системах управления и объектах интереса, которые могут использоваться для достижения цели противника. Примеры этих методов включают наблюдение состояний работы, захват скриншотов, определение уникальных ролей устройства и сбор системы и схем диаграмм. Сбор этих данных может сыграть ключевую роль в планировании, выполнении и даже пересмотре атаки, нацеленной на ICS. Методы сбора зависят от категорий целевых данных, которые могут включать в себя конкретные протоколы, конкретные устройства и конкретные конфигурации и функциональные возможности процесса. Собранная информация может относиться к комбинации системных, надзорных, устройствных и сетевых данных, которые концептуально подпадают под высокий, средний и низкий уровни плановых операций. Например, репозитории информации о данных о установках на высоком уровне или устройствах конкретных программ на низком уровне. Чувствительные планы этажей, руководства по устройствам поставщиков и другие ссылки также могут быть подвержены риску и выставлены в Интернете или иным образом общедоступны."
    },
    "TA0101": {
      "name": "Командование и контроль",
      "description": "Противник пытается общаться и контролировать скомпрометированные системы, контроллеры и платформы с доступом к вашей среде ICS.\n\nКомандование и управление состоит из методов, которые противники используют для связи и отправки команд на скомпрометированные системы, устройства, контроллеры и платформы со специализированными приложениями, используемыми в средах ICS. Примеры этих специализированных устройств связи включают интерфейсы человеческих машин (HMI), историки данных, серверы SCADA и инженерные рабочие станции (EWS). Противники часто стремятся использовать общедоступные ресурсы и имитировать ожидаемый сетевой трафик, чтобы избежать обнаружения и подозрений. Например, обычно используются порты и протоколы в средах АСУ ТП и даже ожидаемые ИТ-ресурсы в зависимости от целевой сети. Командование и управление могут быть установлены в различной степени скрытности, часто в зависимости от структуры сети жертвы и защиты."
    },
    "TA0102": {
      "name": "открытие",
      "description": "Противник ищет информацию для оценки и определения своих целей в вашей среде.\n\nDiscovery состоит из техник, которые противники используют для изучения среды ICS и получения знаний о внутренней сети, устройствах системы управления и о том, как взаимодействуют их процессы. Эти методы помогают противникам наблюдать за окружающей средой и определять следующие шаги для выбора цели и бокового движения. Они также позволяют противникам исследовать то, что они могут контролировать, и получить представление о взаимодействии между различными процессами системы управления. Методы обнаружения часто являются актом продвижения в окружающую среду, который позволяет противнику ориентироваться, прежде чем решить, как действовать. Противники могут использовать методы обнаружения, которые приводят к сбору, чтобы помочь определить, как доступные ресурсы приносят пользу их текущей цели. Комбинация нативных коммуникаций и функций устройств и пользовательских инструментов часто используется для достижения этой посткомпромиссной цели сбора информации."
    },
    "TA0103": {
      "name": "уклонение",
      "description": "Противник пытается избежать защиты.\n\nУклонение состоит из методов, которые противники используют, чтобы избежать технической защиты на протяжении всей своей кампании. Методы, используемые для уклонения, включают удаление индикаторов компрометации, подмену сообщений и использование уязвимостей программного обеспечения. Противники могут также использовать и злоупотреблять доверенными устройствами и процессами, чтобы скрыть свою деятельность, возможно, маскируясь под основные устройства или собственное программное обеспечение. Методы уклонения от защиты для этой цели зачастую носят более пассивный характер."
    },
    "TA0104": {
      "name": "Казнь",
      "description": "Противник пытается запустить код или манипулировать системными функциями, параметрами и данными несанкционированным способом.\n\nВыполнение состоит из методов, которые приводят к тому, что код, управляемый противником, работает на локальной или удаленной системе, устройстве или другом активе. Это выполнение может также зависеть от незнания конечных пользователей или манипулирования режимами работы устройства для запуска. Противники могут заражать удаленные цели программируемыми исполняемыми файлами или вредоносными файлами проекта, которые работают в соответствии с определенным поведением и могут тонко изменять ожидаемое поведение устройства. Команды для выполнения также могут быть выпущены из интерфейсов командной строки, API, графических интерфейсов или других доступных интерфейсов. Техники, которые запускают вредоносный код, также могут быть сопряжены с методами из других тактик, в частности, для помощи сети [Discovery] (https://attack.mitre.org/tactics/TA0102) и [Collection] (https://attack.mitre.org/tactics/TA0100), операций воздействия и ингибирования функций ответа."
    },
    "TA0105": {
      "name": "Воздействие",
      "description": "Противник пытается манипулировать, прерывать или уничтожать ваши системы, данные и окружающую среду.\n\nВоздействие состоит из методов, которые противники используют для нарушения, компрометации, уничтожения и манипулирования целостностью и доступностью операций системы управления, процессов, устройств и данных. Эти методы охватывают влияние и эффекты, возникающие в результате враждебных усилий по нападению на среду АСУ ТП или оказывающие на нее ощутимое воздействие. Методы воздействия могут привести к более мгновенному нарушению процессов управления и оператора или могут привести к более долгосрочному повреждению или потере среды ICS и связанных с ней операций. Противник может использовать методы [Impair Process Control] (https://attack.mitre.org/tactics/TA0106), которые часто проявляются в более самораскрывающемся воздействии на операции, или методы [Impair Process Control] (https://attack.mitre.org/tactics/TA0106), чтобы препятствовать гарантиям и сигнализации, чтобы следовать и обеспечивать прикрытие Impact. В некоторых сценариях процессы системы управления могут функционировать так, как ожидалось, но могут быть изменены в интересах противника в течение более длительного периода времени. Эти методы могут использоваться противниками для достижения своей конечной цели или для обеспечения прикрытия нарушения конфиденциальности.\n\n[Потеря производительности и доходов] (https://attack.mitre.org/techniques/T0828), [Theft of Operational Information] (https://attack.mitre.org/techniques/T0882) и [Damage to Property] (https://attack.mitre.org/techniques/T0879) предназначены для охвата некоторых более детальных целей противников в целевых и нецелевых атаках. Эти методы сами по себе не обязательно обнаруживаются, но связанное с ними поведение противника может быть смягчено и/или обнаружено."
    },
    "TA0106": {
      "name": "Нарушение контроля процесса",
      "description": "Противник пытается манипулировать, отключать или наносить ущерб процессам физического контроля.\n\nНарушение управления процессами состоит из методов, которые противники используют для нарушения логики управления и вызывают детерминантные эффекты процессов, контролируемых в целевой среде. Цели могут включать в себя активные процедуры или параметры, которые манипулируют физической средой. Эти методы могут также включать предотвращение или манипулирование элементами отчетности и логикой управления. Если противник модифицировал функциональность процесса, он также может запутать результаты, которые часто проявляются в его влиянии на результат продукта или окружающую среду. Прямой физический контроль, осуществляемый этими методами, также может угрожать безопасности операторов и пользователей, которые могут вызвать механизмы реагирования. Противники могут в тандеме следовать или использовать методы [Inhibit Response Function] (https://attack.mitre.org/tactics/TA0107), чтобы помочь в успешном злоупотреблении процессами управления, чтобы привести к [Impact] (https://attack.mitre.org/tactics/TA0105)."
    },
    "TA0107": {
      "name": "Функция ингибирования ответа",
      "description": "Противник пытается помешать вашим функциям безопасности, защиты, обеспечения качества и вмешательства оператора реагировать на сбой, опасность или небезопасное состояние.\n\nФункция реагирования на ингибирование состоит из методов, которые противники используют, чтобы препятствовать гарантиям, установленным для процессов и продуктов. Это может включать в себя ингибирование функций безопасности, защиты, обеспечения качества или вмешательства оператора для нарушения гарантий, направленных на предотвращение гибели людей, уничтожения оборудования и нарушения производства. Эти методы направлены на активное сдерживание и предотвращение ожидаемых сигналов тревоги и ответных действий, которые возникают из-за статуса в среде АСУ ТП. Противники могут изменять или обновлять системную логику или даже напрямую предотвращать ответы с отказом в обслуживании. Они могут привести к предотвращению, разрушению, манипулированию или модификации программ, логики, устройств и коммуникаций. Поскольку функции профилактики, как правило, находятся в состоянии покоя, функции отчетности и обработки могут выглядеть хорошо, но могут быть изменены, чтобы предотвратить реакцию сбоя в опасных сценариях. В отличие от [Evasion] (https://attack.mitre.org/tactics/TA0103), методы функции ингибирования могут быть более навязчивыми, например, активное предотвращение ответов на известный опасный сценарий. Противники могут использовать эти методы для выполнения или обеспечения прикрытия для методов [Impact] (https://attack.mitre.org/tactics/TA0105)."
    },
    "TA0108": {
      "name": "Первоначальный доступ",
      "description": "Противник пытается проникнуть в ваше окружение.\n\nПервоначальный доступ состоит из методов, которые противники могут использовать в качестве векторов входа, чтобы закрепиться в среде ICS. Эти методы включают компрометацию операционных технологических активов, ИТ-ресурсов в сети OT и внешних удаленных сервисов и веб-сайтов. Они также могут быть нацелены на сторонние организации и пользователей с привилегированным доступом. В частности, эти исходные точки доступа могут включать в себя устройства и механизмы связи с доступом и привилегиями как в среде ИТ, так и в среде ОТ. ИТ-ресурсы в среде ОТ также потенциально уязвимы для тех же атак, что и корпоративные ИТ-системы. Доверенные третьи стороны могут включать поставщиков, обслуживающий персонал, инженеров, внешних интеграторов и другие внешние организации, участвующие в ожидаемых операциях ICS. Поддерживаемые поставщиком активы могут включать физические устройства, программное обеспечение и операционное оборудование. Методы первоначального доступа могут также использовать внешние устройства, такие как радиоприемники, контроллеры или съемные носители, для удаленного вмешательства и, возможно, заражения операций ОТ."
    },
    "TA0109": {
      "name": "Латеральное движение",
      "description": "Противник пытается проникнуть в вашу среду АСУ ТП.\n\nБоковое движение состоит из методов, которые противники используют для входа и управления удаленными системами в сети. Эти методы злоупотребляют учетными данными по умолчанию, известными учетными записями и уязвимыми службами, а также могут использовать устройства и системы с двойным домом, которые находятся как в ИТ, так и в OT-сетях. Противник использует эти методы, чтобы развернуться к своей следующей точке в окружающей среде, позиционируя себя там, где они хотят быть или думают, что они должны быть. Для достижения своей основной цели часто требуется [Discovery] (https://attack.mitre.org/tactics/TA0102) сети и [Collection] (https://attack.mitre.org/tactics/TA0100) развивать осведомленность об уникальных устройствах и процессах ICS, чтобы найти их цель и впоследствии получить к ней доступ. Достижение этой цели часто включает в себя поворот через несколько систем, устройств и учетных записей. Противники могут устанавливать свои собственные удаленные инструменты для выполнения бокового движения или использовать инструменты по умолчанию, программы и набор производителей или другие законные учетные данные, нативные для сети, которые могут быть скрытнее."
    },
    "TA0110": {
      "name": "настойчивость",
      "description": "Противник пытается закрепиться в вашей среде ICS.\n\nНастойчивость состоит из методов, которые противники используют для поддержания доступа к системам и устройствам ICS при перезапуске, изменении учетных данных и других прерываниях, которые могут отрезать их доступ. Методы, используемые для обеспечения устойчивости, включают в себя любые изменения доступа, действия или конфигурации, которые позволяют им обеспечить свою текущую деятельность и поддерживать свои позиции в системах. Это может включать замену или захват законного кода, прошивки и других файлов проекта или добавление кода запуска и загрузку программ на устройства."
    },
    "TA0111": {
      "name": "Эскалация привилегий",
      "description": "Противник пытается получить разрешения более высокого уровня.\n\nЭскалация привилегий состоит из методов, которые противники используют для получения разрешений более высокого уровня в системе или сети. Противники часто могут войти и исследовать сеть с непривилегированным доступом, но для достижения своих целей требуются повышенные разрешения. Общие подходы заключаются в том, чтобы использовать недостатки системы, неверные конфигурации и уязвимости."
    }
  },
  "techniques": {
    "T0800": {
      "name": "Активировать режим обновления прошивки",
      "description": "Противники могут активировать режим обновления прошивки на устройствах, чтобы предотвратить реакцию ожидаемых функций реагирования на чрезвычайную ситуацию или неисправность процесса. Например, устройства, такие как реле защиты, могут иметь режим работы, предназначенный для установки прошивки. Этот режим может остановить мониторинг процесса и связанные с ним функции, чтобы позволить загружать новое прошивку. Устройство, оставленное в режиме обновления, может быть помещено в состояние неактивного удержания, если ему не предоставляется прошивка. При входе и выходе из устройства в этом режиме противник может отрицать свои обычные функции."
    },
    "T0801": {
      "name": "Состояние процесса мониторинга",
      "description": "Противники могут собирать информацию о состоянии физического процесса. Эта информация может использоваться для получения дополнительной информации о самом процессе или использоваться в качестве триггера для вредоносных действий. Источники информации о состоянии процесса могут варьироваться, например, теги OPC, данные историков, конкретная информация о блоке PLC или сетевой трафик."
    },
    "T0802": {
      "name": "Автоматическая коллекция",
      "description": "Противники могут автоматизировать сбор информации о промышленной среде с помощью инструментов или скриптов. Эта автоматизированная коллекция может использовать собственные протоколы управления и инструменты, доступные в среде систем управления. Например, протокол OPC может использоваться для перечисления и сбора информации. Доступ к системе или интерфейсу с этими нативными протоколами может позволить сбор и перечисление других подключенных, взаимодействующих серверов и устройств."
    },
    "T0803": {
      "name": "Блокировка командного сообщения",
      "description": "Противники могут блокировать командное сообщение от достижения намеченной цели, чтобы предотвратить выполнение команд. В сетях OT командные сообщения отправляются для предоставления инструкций устройствам системы управления. Заблокированное командное сообщение может препятствовать функциям ответа на исправление сбоя или небезопасного состояния. (Цитирование: Бонни Чжу, Энтони Джозеф, Шанкар Састри 2011) (Цитирование: Центр обмена и анализа информации об электричестве; Системы промышленного контроля SANS, март 2016)"
    },
    "T0804": {
      "name": "Блок сообщения сообщения",
      "description": "Противники могут блокировать или препятствовать донесению сообщения до намеченной цели. В системах управления сообщения отчетности содержат данные телеметрии (например, значения ввода/вывода), относящиеся к текущему состоянию оборудования и промышленному процессу. Блокируя эти сообщения, противник может скрыть свои действия от оператора.\n\nБлокировка сообщений в системах управления, которые управляют физическими процессами, может способствовать системному воздействию, вызывая ингибирование функции ответа. Система управления может быть не в состоянии надлежащим образом или своевременно реагировать на событие, такое как опасная ошибка, если ее соответствующее сообщение отчетности заблокировано. (Цитирование: Бонни Чжу, Энтони Джозеф, Шанкар Састри 2011) (Цитирование: Центр обмена и анализа информации об электричестве; Системы промышленного контроля SANS, март 2016)"
    },
    "T0805": {
      "name": "Блок Serial COM",
      "description": "Противники могут блокировать доступ к последовательному COM, чтобы предотвратить попадание инструкций или конфигураций на целевые устройства. Порты последовательной связи (COM) обеспечивают связь с устройствами системы управления. Устройства могут принимать командные и конфигурационные сообщения по такому последовательному COM. Устройства также используют последовательный COM для отправки командных и отчетных сообщений. Блокировка устройства последовательной COM может также блокировать командные сообщения и блокировать сообщения отчетности.\n\nСерийный преобразователь Ethernet часто подключается к последовательному COM для облегчения связи между последовательными и Ethernet-устройствами. Одним из подходов к блокировке последовательного COM было бы создание и проведение открытой сессии TCP со стороны Ethernet преобразователя. Серийный преобразователь Ethernet может иметь несколько портов, открытых для облегчения нескольких коммуникаций. Например, если доступны три последовательных COM - 1, 2 и 3 - преобразователь может прослушивать соответствующие порты 20001, 20002 и 20003. Если соединение TCP/IP открывается с одним из этих портов и остается открытым, то порт будет недоступен для использования другой стороной. Одним из способов, которым противник мог бы достичь этого, было бы инициировать сеанс TCP с последовательным преобразователем Ethernet на 10.0.0.1 через Telnet на последовательном порту 1 со следующей командой: telnet 10.0.0.1 20001."
    },
    "T0806": {
      "name": "Грубая сила I/O",
      "description": "Противники могут периодически или последовательно изменять значения точки ввода/вывода для выполнения действия. Грубая сила ввода/вывода может быть достигнута путем многократного изменения диапазона значений точек ввода/вывода или одного значения точек для манипулирования функцией процесса. Цель противника и информация, которую он имеет о целевой среде, будут влиять на выбор вариантов. В случае грубого форсирования диапазона значений точек противник может достичь удара без нацеливания на конкретную точку. В случае, когда одна точка является целевой, противник может быть в состоянии создать нестабильность в функции процесса, связанной с этой конкретной точкой.\n\nПротивники могут использовать грубую силу ввода-вывода, чтобы вызвать сбои в различных промышленных процессах. Эти сбои могут быть результатом износа оборудования или повреждения оборудования ниже по течению."
    },
    "T0807": {
      "name": "интерфейс командной строки",
      "description": "Противники могут использовать интерфейсы командной строки (CLI) для взаимодействия с системами и выполнения команд. CLI обеспечивают средства взаимодействия с компьютерными системами и являются общей чертой многих типов платформ и устройств в средах систем управления. Противники могут также использовать CLI для установки и запуска нового программного обеспечения, включая вредоносные инструменты, которые могут быть установлены в ходе операции.\n\nCLI обычно доступны локально, но также могут быть доступны через такие службы, как SSH, Telnet и RDP. Команды, выполняемые в CLI, выполняются с текущим уровнем разрешений процесса, запущенного эмулятором терминала, если команда не указывает изменение контекста разрешений. Многие контроллеры имеют интерфейсы CLI для управления."
    },
    "T0809": {
      "name": "Уничтожение данных",
      "description": "Противники могут уничтожать данные в ходе операции. Противник может сбрасывать или создавать вредоносные программы, инструменты или другие неродные файлы в целевой системе для достижения этой цели, потенциально оставляя следы вредоносных действий. Такие неродные файлы и другие данные могут быть удалены в ходе вторжения для поддержания небольшого следа или в качестве стандартной части процесса очистки после вторжения. (перенаправлено с «Enterprise ATT&CK January 2018»)\n\nУничтожение данных также может быть использовано для того, чтобы сделать интерфейсы оператора неспособными реагировать и нарушать функции реагирования. Противник также может уничтожить резервные копии данных, которые жизненно важны для восстановления после инцидента.\n\nСтандартные команды удаления файлов доступны на большинстве интерфейсов операционной системы и устройства для выполнения очистки, но противники могут использовать и другие инструменты. Примерами являются Windows Sysinternals SDelete и Active@Killdisk."
    },
    "T0811": {
      "name": "Данные из информационных репозиториев",
      "description": "Противники могут нацеливаться и собирать данные из информационных хранилищ. Это может включать в себя конфиденциальные данные, такие как спецификации, схемы или диаграммы макетов системы управления, устройств и процессов. Примеры информационных репозиториев включают справочные базы данных в среде процессов, а также базы данных в корпоративной сети, которые могут содержать информацию о СУИ. (Citation: Cybersecurity & Infrastructure Security Agency, март 2018)\n\nИнформация, собранная из этих систем, может предоставить противнику лучшее понимание операционной среды, используемых поставщиков, процессов или процедур ICS.\n\nВ период с 2011 по 2013 год в рамках кампании против организаций ONG спонсируемые государством китайские субъекты искали в хранилищах документов конкретную информацию, такую как системные руководства, сайты удаленных терминалов (RTU), списки персонала, документы, которые включали строку SCAD*, учетные данные пользователей и информацию удаленного доступа. (перенаправлено с «CISA AA21-201A Pipeline Intrusion July 2021»)"
    },
    "T0812": {
      "name": "По умолчанию Credentials",
      "description": "Противники могут использовать установленные производителем или поставщиком учетные данные по умолчанию на устройствах системы управления. Эти учетные данные по умолчанию могут иметь административные разрешения и могут быть необходимы для первоначальной конфигурации устройства. Как правило, лучше всего менять пароли для этих учетных записей как можно скорее, но некоторые производители могут иметь устройства с паролями или именами пользователей, которые не могут быть изменены. (перенаправлено с «Keith Stouffer May 2015»)\n\nПо умолчанию учетные данные обычно документируются в инструкции по эксплуатации, которая либо упакована с устройством, опубликована в Интернете через официальные средства, либо опубликована в Интернете через неофициальные средства. Противники могут использовать учетные данные по умолчанию, которые не были должным образом изменены или отключены."
    },
    "T0813": {
      "name": "Отказ в контроле",
      "description": "Противники могут вызвать отказ в контроле, чтобы временно помешать операторам и инженерам взаимодействовать с управлением процессами. Противник может попытаться отказать в доступе к управлению процессом, чтобы вызвать временную потерю связи с устройством управления или предотвратить регулировку оператором управления процессом. Пораженный процесс может все еще работать в период потери контроля, но не обязательно в желаемом состоянии. (Citation: Corero) (Citation: Michael J. Assante and Robert M. Lee) (Citation: Tyson Macaulay)\n\nВ 2017 году операторы Dallas Siren не смогли отключить ложную тревогу из штаб-квартиры Управления по чрезвычайным ситуациям. (перенаправлено с «Mark Loveless April 2017»)"
    },
    "T0814": {
      "name": "Отказ в обслуживании",
      "description": "Противники могут выполнять атаки типа «отказ в обслуживании» (DoS), чтобы нарушить ожидаемую функциональность устройства. Примеры DoS-атак включают в себя подавление целевого устройства большим объемом запросов за короткий промежуток времени и отправку целевому устройству запроса, с которым оно не знает, как обращаться. Нарушение состояния устройства может временно сделать его невосприимчивым, возможно, длительным до тех пор, пока не произойдет перезагрузка. При размещении в этом состоянии устройства могут быть неспособны отправлять и получать запросы и могут не выполнять функции ожидаемого ответа в ответ на другие события в окружающей среде.\n\nНекоторые устройства АСУ ТП особенно чувствительны к событиям DoS и могут стать невосприимчивыми в ответ даже на простую пинг-подметку. Противники могут также попытаться выполнить постоянный отказ в обслуживании (PDoS) против определенных устройств, например, в случае вредоносного ПО BrickerBot. (перенаправлено с «ICS-CERT April 2017»)\n\nПротивники могут использовать уязвимость программного обеспечения, чтобы вызвать отказ в обслуживании, воспользовавшись ошибкой программирования в программе, службе или в программном обеспечении операционной системы или самом ядре для выполнения кода, контролируемого противником. Уязвимости могут существовать в программном обеспечении, которое может быть использовано для создания условий отказа в обслуживании.\n\nПротивники могут иметь предварительные знания о промышленных протоколах или устройствах управления, используемых в окружающей среде через [Remote System Information Discovery] (https://attack.mitre.org/techniques/T0888). Есть примеры того, как противники дистанционно вызывают [Перезагрузка устройства/Закрытие] (https://attack.mitre.org/techniques/T0816) путем использования уязвимости, которая вызывает неконтролируемое потребление ресурсов. (Citation: ICS-CERT August 2018) (Citation: Common Weakness Enumeration January 2019) (Citation: MITRE March 2018)"
    },
    "T0815": {
      "name": "Отрицание взгляда",
      "description": "Противники могут вызвать отрицание зрения в попытке нарушить и предотвратить надзор оператора за состоянием среды ICS. Это может проявляться как временный сбой связи между устройством и его источником управления, когда интерфейс восстанавливается и становится доступным после прекращения помех. (Citation: Corero) (Citation: Michael J. Assante and Robert M. Lee) (Citation: Tyson Macaulay)\n\nПротивник может попытаться отрицать видимость оператора, не позволяя ему получать статус и сообщать сообщения. Отрицание этой точки зрения может временно блокировать и препятствовать операторам замечать изменение состояния или аномальное поведение. Данные и процессы окружающей среды все еще могут быть оперативными, но функционировать непреднамеренным или состязательным образом."
    },
    "T0816": {
      "name": "Перезагрузка устройства / Shutdown",
      "description": "Противники могут принудительно перезапустить или отключить устройство в среде ICS, чтобы нарушить и потенциально негативно повлиять на физические процессы. Методы перезапуска и выключения устройств существуют в некоторых устройствах как встроенные стандартные функции. Эти функции могут быть выполнены с использованием интерактивных веб-интерфейсов устройств, CLI и команд сетевого протокола.\n\nНеожиданный перезапуск или отключение устройств системы управления может предотвратить ожидаемые функции реагирования во время критических состояний.\n\nПерезапуск устройства также может быть признаком модификации вредоносного устройства, так как многие обновления требуют отключения, чтобы вступить в силу."
    },
    "T0817": {
      "name": "Drive-by Компромисс",
      "description": "Противники могут получить доступ к системе во время компрометации, когда пользователь посещает веб-сайт в рамках регулярного сеанса просмотра. С помощью этой техники веб-браузер пользователя нацелен и используется просто путем посещения скомпрометированного веб-сайта.\n\nПротивник может нацелиться на определенное сообщество, такое как доверенные сторонние поставщики или другие отраслевые группы, которые часто посещают целевой веб-сайт. Этот вид целенаправленной атаки опирается на общий интерес и известен как стратегический веб-компромисс или атака на водопой.\n\nНациональная система кибербезопасности (NCAS) опубликовала Техническое предупреждение (TA) о киберактивности российского правительства в критически важных секторах инфраструктуры. Анализ, проведенный DHS и ФБР в марте 2018 года, выявил две различные категории жертв в кампании Dragonfly в западном энергетическом секторе: постановка и намеченные цели. Противник нацелился на менее защищенные сети постановочных целей, включая надежных сторонних поставщиков и связанные с ними периферийные организации. Первоначальный доступ к намеченным целям использовался для атак на водопои для контроля процессов, СУИ и критически важных инфраструктурных торговых публикаций и информационных веб-сайтов."
    },
    "T0819": {
      "name": "Использовать публичное приложение",
      "description": "Противники могут использовать слабые места для использования программного обеспечения, ориентированного на Интернет, для первоначального доступа в промышленную сеть. Программным обеспечением, ориентированным на Интернет, могут быть пользовательские приложения, базовые сетевые реализации, операционная система активов, слабая защита и т.д. Цели этого метода могут быть намеренно выставлены с целью удаленного управления и видимости.\n\nПротивник может стремиться к нацеливанию на общедоступные приложения, поскольку они могут обеспечить прямой доступ к среде ICS или возможность перехода в сеть ICS. Публично открытые приложения можно найти с помощью онлайн-инструментов, которые сканируют Интернет для открытых портов и сервисов. Номера версий для открытого приложения могут предоставить противникам возможность нацеливаться на определенные известные уязвимости. Обнаруженные протоколы управления или порты удаленного доступа могут представлять интерес для противников."
    },
    "T0820": {
      "name": "Эксплуатация для уклонения",
      "description": "Противники могут использовать уязвимость программного обеспечения, чтобы воспользоваться ошибкой программирования в программе, службе или в программном обеспечении операционной системы или самом ядре, чтобы избежать обнаружения. Уязвимости могут существовать в программном обеспечении, которое может использоваться для отключения или обхода функций безопасности.\n\nПротивники могут иметь предварительные знания через [Remote System Information Discovery] (https://attack.mitre.org/techniques/T0888) о функциях безопасности, реализованных на устройствах управления. Эти функции безопасности устройства, вероятно, будут нацелены непосредственно на эксплуатацию. Существуют примеры проверки согласованности прошивки RAM/ROM на устройствах управления, на которые нацелены противники, чтобы включить установку вредоносного ПО (https://attack.mitre.org/techniques/T0857)."
    },
    "T0821": {
      "name": "Модифицировать Controller Tasking",
      "description": "Противники могут изменять задачи контроллера, чтобы обеспечить выполнение своих собственных программ. Это может позволить противнику манипулировать потоком выполнения и поведением контроллера.\n\nСогласно пункту 61131-3, объединение задачи с подразделением программной организации (ПОУ) определяет целевую ассоциацию. (перенаправлено с «IEC February 2013») Противник может изменить эти ассоциации или создать новые, чтобы манипулировать потоком исполнения контроллера. Модификация задач контроллера может быть выполнена с помощью загрузки программы в дополнение к другим типам модификации программы, таким как онлайн-редактирование и приложение программы.\n\nЗадачи имеют такие свойства, как интервал, частота и приоритетность выполнения программы. Некоторые поставщики контроллеров реализуют задачи с неявными, заранее определенными свойствами, в то время как другие позволяют четко формулировать эти свойства. Противник может ассоциировать свою программу с задачами, которые имеют более высокий приоритет или выполнять связанные программы чаще. Например, чтобы обеспечить циклическое выполнение своей программы на контроллере Siemens, противник может добавить свою программу к задаче Organization Block 1 (OB1)."
    },
    "T0822": {
      "name": "Внешние удаленные услуги",
      "description": "Противники могут использовать внешние удаленные службы в качестве точки первоначального доступа в вашу сеть. Эти сервисы позволяют пользователям подключаться к внутренним сетевым ресурсам из внешних локаций. Примерами являются VPN, Citrix и другие механизмы доступа. Шлюзы удаленного обслуживания часто управляют соединениями и аутентификацией учетных данных для этих служб. (перенаправлено с «Daniel Oakley, Travis Smith, Tripwire»)\n\nВнешние удаленные службы позволяют управлять системой управления извне. Зачастую поставщики и внутренние инженерные группы имеют доступ к внешним удаленным службам для управления сетями системы через корпоративную сеть. В некоторых случаях этот доступ обеспечивается непосредственно из Интернета. В то время как удаленный доступ обеспечивает простоту обслуживания, когда система управления находится в удаленной области, компромисс решений удаленного доступа является обязательством. Противник может использовать эти службы для получения доступа и выполнения атак на сеть системы управления. Доступ к действующим счетам часто является обязательным требованием.\n\nКогда они ищут точку входа в сеть системы управления, противники могут начать поиск существующих реализаций VPN «точка-точка» в доверенных сторонних сетях или через удаленные подключения сотрудников службы поддержки, где включено разделение туннелирования. (Цитата: Центр обмена и анализа электрической информации; Системы промышленного контроля SANS, март 2016 г.)"
    },
    "T0823": {
      "name": "Графический пользовательский интерфейс",
      "description": "Противники могут попытаться получить доступ к машине через графический пользовательский интерфейс (GUI) для улучшения возможностей выполнения. Доступ к графическому интерфейсу позволяет пользователю взаимодействовать с компьютером более визуально, чем CLI. GUI позволяет пользователям перемещать курсор и нажимать на объекты интерфейса, с мышью и клавиатурой в качестве основных устройств ввода, в отличие от простого использования клавиатуры.\n\nЕсли физический доступ не является вариантом, то доступ может быть возможен через протоколы, такие как VNC на операционных системах на базе Linux и Unix, и RDP на операционных системах Windows. Противник может использовать этот доступ для выполнения программ и приложений на целевой машине."
    },
    "T0826": {
      "name": "Потеря доступности",
      "description": "Противники могут попытаться нарушить основные компоненты или системы, чтобы помешать владельцу и оператору предоставлять продукты или услуги. (Citation: Corero) (Citation: Michael J. Assante and Robert M. Lee) (Citation: Tyson Macaulay)\n\nПротивники могут использовать вредоносное ПО для удаления или шифрования критически важных данных на HMI, рабочих станциях или базах данных.\n\nВ инциденте с вымогателями Colonial Pipeline в 2021 году работы трубопровода были временно приостановлены 7 мая и не были полностью возобновлены до 12 мая. (Citation: Colonial Pipeline Company, май 2021)"
    },
    "T0827": {
      "name": "Потеря контроля",
      "description": "Противники могут стремиться к достижению устойчивой потери контроля или безудержного состояния, при котором операторы не могут выдавать какие-либо команды, даже если вредоносное вмешательство утихло. (Citation: Corero) (Citation: Michael J. Assante and Robert M. Lee) (Citation: Tyson Macaulay)\n\nФедеральное управление по информационной безопасности Германии (BSI) сообщило о целенаправленной атаке на сталелитейный завод в своем отчете по ИТ-безопасности за 2014 год. Эти целенаправленные атаки повлияли на промышленные операции и привели к поломкам компонентов системы управления и даже целых установок. В результате этих поломок массивное воздействие привело к повреждению и небезопасным условиям от неконтролируемого отключения доменной печи."
    },
    "T0828": {
      "name": "Потеря производительности и доходов",
      "description": "Противники могут привести к потере производительности и доходов из-за нарушения и даже повреждения доступности и целостности операций системы управления, устройств и связанных с ними процессов. Этот метод может проявляться как прямой эффект атаки ICS-таргетинга или косвенно, из-за атаки ИТ-таргетинга против несегрегированных сред.\n\nВ тех случаях, когда эти операции или услуги прекращаются, потеря производительности может в конечном итоге оказать влияние на конечных пользователей или потребителей продуктов и услуг. Нарушенная цепочка поставок может привести к дефициту предложения и росту цен, среди других последствий.\n\nАтака вымогателей на австралийскую компанию по производству напитков привела к закрытию некоторых производственных площадок, включая предупредительные остановки для защиты ключевых систем. (Цитата: Паганини, Пьерлуиджи, июнь 2020 года) Компания объявила о возможной временной нехватке своей продукции после атаки. (Citation: Paganini, Pierluigi June 2020) (Citation: Lion Corporation June 2020)\n\nВ инциденте с вымогателями Colonial Pipeline в 2021 году трубопровод не смог транспортировать примерно 2,5 миллиона баррелей топлива в день на Восточное побережье. (Citation: Colonial Pipeline Company, май 2021)"
    },
    "T0829": {
      "name": "Потеря зрения",
      "description": "Противники могут вызвать устойчивую или постоянную потерю зрения, когда оборудование ICS потребует вмешательства местного оператора, например, перезапуска или ручной работы. Вызывая постоянную отчетность или потерю видимости, противник может эффективно скрыть текущее состояние операций. Эта потеря зрения может происходить без воздействия на сами физические процессы. (Citation: Corero) (Citation: Michael J. Assante and Robert M. Lee) (Citation: Tyson Macaulay)"
    },
    "T0830": {
      "name": "Противник в центре",
      "description": "Противники с привилегированным доступом к сети могут пытаться изменять сетевой трафик в режиме реального времени с помощью атак типа «противник посередине» (AiTM). (перенаправлено с «Gabriel Sanchez October 2017») Этот тип атаки позволяет противнику перехватывать трафик на и/или с конкретного устройства в сети. Если установлена атака AiTM, то противник имеет возможность блокировать, регистрировать, изменять или вводить трафик в поток связи. Существует несколько способов совершения этой атаки, но наиболее распространенными являются отравление протоколом адресной резолюции (ARP) и использование прокси-сервера. (перенаправлено с «Bonnie Zhu, Anthony Joseph, Shankar Sastry 2011»)\n\nАтака AiTM может позволить противнику выполнить следующие атаки:\n[Block Reporting Message] (https://attack.mitre.org/techniques/T0804), [Spoof Reporting Message] (https://attack.mitre.org/techniques/T0856), [Modify Parameter] (https://attack.mitre.org/techniques/T0836), [Unauthorized Command Message] (https://attack.mitre.org/techniques/T0855)"
    },
    "T0831": {
      "name": "Манипулирование контролем",
      "description": "Противники могут манипулировать физическими процессами в промышленной среде. Методы манипулирования контролем могут включать изменения значений заданных точек, тегов или других параметров. Противники могут манипулировать устройствами систем управления или, возможно, использовать свои собственные, для связи и управления процессами физического управления. Продолжительность манипуляции может быть временной или более длительной, в зависимости от обнаружения оператора.\n\nМетоды манипуляции контролем включают:\n\n* Человек посередине\n* Командное сообщение Spoof\n* Изменить настройки\n\nПольский студент использовал устройство дистанционного управления для взаимодействия с городской трамвайной системой Лодзи в Польше. (Цитирование: Джон Билл Май 2017) (Цитирование: Шелли Смит Февраль 2008) (Цитирование: Брюс Шнайер Январь 2008) Используя этот пульт, студент смог захватить и воспроизвести законные трамвайные сигналы. В результате четыре трамвая сошли с рельсов и двенадцать человек пострадали из-за аварийных остановок. (перенаправлено с «Шелли Смит», февраль 2008) Выданные команды управления треком, возможно, также привели к столкновениям с трамваями, что еще больше угрожает находящимся на борту и близлежащим районам удара. (перенаправлено с «Bruce Schneier January 2008»)"
    },
    "T0832": {
      "name": "Манипулирование взглядом",
      "description": "Противники могут пытаться манипулировать информацией, сообщенной операторам или контроллерам. Эта манипуляция может быть краткосрочной или длительной. В течение этого времени сам процесс может находиться в совершенно ином состоянии, чем то, о чем сообщается. (Citation: Corero) (Citation: Michael J. Assante and Robert M. Lee) (Citation: Tyson Macaulay)\n\nОператоры могут быть обмануты, чтобы сделать что-то, что вредно для системы в ситуации потери зрения. С манипулируемым представлением в системах операторы могут выдавать несоответствующие последовательности управления, которые вводят неисправности или катастрофические сбои в системе. Системы бизнес-анализа также могут быть снабжены неточными данными, приводящими к плохим управленческим решениям."
    },
    "T0834": {
      "name": "Нативный API",
      "description": "Противники могут напрямую взаимодействовать с нативным интерфейсом прикладного программирования ОС (API) для доступа к функциям системы. Нативные API-интерфейсы обеспечивают контролируемое средство вызова низкоуровневых служб ОС в ядре, таких как те, которые включают аппаратное обеспечение / устройства, память и процессы. (перенаправлено с «The MITRE Corporation May 2017») Эти собственные API используются ОС во время загрузки системы (когда другие компоненты системы еще не инициализированы), а также при выполнении задач и запросов во время рутинных операций.\n\nФункциональность, обеспечиваемая нативными API, часто также подвергается воздействию пользовательских приложений через интерфейсы и библиотеки. Например, такие функции, как memcpy и прямые операции на регистрах памяти, могут использоваться для изменения пространства памяти пользователя и системы."
    },
    "T0835": {
      "name": "Манипулирование изображением I/O",
      "description": "Противники могут манипулировать изображением ПЛК с помощью различных средств, чтобы предотвратить их функционирование. Способы манипулирования изображениями ввода/вывода могут включать в себя переопределение таблицы ввода/вывода посредством прямой манипуляции памятью или использование функции переопределения, используемой для тестирования программ PLC. (Цитирование: Доктор Кельвин Т. Эриксон, декабрь 2010) Во время цикла сканирования ПЛК считывает состояние всех входов и хранит их в таблице изображений. (перенаправлено с «Nanjundaiah, Vaidyanath») Таблица изображений представляет собой внутреннее место хранения ПЛК, где хранятся значения входов/выходов для одного сканирования при выполнении пользовательской программы. После того, как ПЛК решил всю логическую программу, он обновляет таблицу выходных изображений. Содержимое этой таблицы выходного изображения записывается в соответствующие точки вывода в модулях ввода/вывода.\n\nОдной из уникальных характеристик ПЛК является их способность переопределять статус физического дискретного ввода или переопределять логику, приводящую в движение физическую выходную катушку, и заставлять выход в желаемый статус."
    },
    "T0836": {
      "name": "Изменить параметр",
      "description": "Противники могут изменять параметры, используемые для инструктажа устройств промышленной системы управления. Эти устройства работают через программы, которые диктуют, как и когда выполнять действия на основе таких параметров. Такие параметры могут определять степень выполнения действия и могут указывать дополнительные параметры. Например, программа на устройстве системы управления, диктующая двигательные процессы, может принимать параметр, определяющий общее количество секунд для запуска этого двигателя.\n\nПротивник может изменить эти параметры, чтобы получить результат за пределами того, что было задумано операторами. Изменяя критические параметры системы и процесса, противник может вызвать [Impact] (https://attack.mitre.org/tactics/TA0105) к оборудованию и/или процессам управления. Модифицированные параметры могут быть превращены в опасные, несвязанные или неожиданные значения от типичных операций. Например, определение того, что процесс выполняется в течение более или менее времени, чем он должен, или диктовка необычно высокого, низкого или недействительного значения в качестве параметра."
    },
    "T0837": {
      "name": "Потеря защиты",
      "description": "Противники могут скомпрометировать защитные функции системы, предназначенные для предотвращения последствий неисправностей и аномальных условий. Это может привести к повреждению оборудования, длительным сбоям процесса и опасностям для персонала.\n\nМногие неисправности и ненормальные условия в процессе управления происходят слишком быстро, чтобы человек-оператор мог реагировать. Скорость имеет решающее значение для исправления этих условий, чтобы ограничить серьезные последствия, такие как потеря контроля и повреждение имущества.\n\nПротивники могут нацеливаться и отключать функции защитной системы в качестве предпосылки для последующего выполнения атаки или для того, чтобы будущие неисправности и ненормальные условия оставались без контроля. Обнаружение операторами потери защиты может привести к остановке процесса из-за строгой политики в отношении систем защиты. Это может привести к потере производительности и доходов и может соответствовать техническим целям противников, стремящихся вызвать сбои процесса."
    },
    "T0838": {
      "name": "Модифицировать настройки сигнализации",
      "description": "Противники могут изменять настройки тревоги, чтобы предотвратить оповещения, которые могут информировать операторов об их присутствии, или предотвратить реакцию на опасные и непреднамеренные сценарии. Сообщения являются стандартной частью сбора данных в системах управления. Сообщения отчетности используются как способ передачи информации о состоянии системы и подтверждения того, что произошли конкретные действия. Эти сообщения предоставляют жизненно важную информацию для управления физическим процессом и информируют операторов, инженеров и администраторов о состоянии системных устройств и физических процессов.\n\nЕсли противник может изменить настройки отчетности, некоторые события могут быть предотвращены. Этот тип модификации также может помешать операторам или устройствам выполнять действия для поддержания системы в безопасном состоянии. Если сообщения с критическими сообщениями не могут вызвать эти действия, то может произойти [Impact] (https://attack.mitre.org/tactics/TA0105).\n\nВ средах ICS противнику, возможно, придется использовать [подавление тревоги] (https://attack.mitre.org/techniques/T0878) или бороться с множественными сигналами тревоги и/или распространением сигнала тревоги для достижения конкретной цели, чтобы избежать обнаружения или предотвратить намеченные ответы. (перенаправлено с «Jos Wetzels, Marina Krotofil 2019») Методы подавления часто основаны на изменении настроек сигнализации, таких как изменение в коде памяти на фиксированные значения или подделка кода команд уровня сборки."
    },
    "T0839": {
      "name": "Модуль прошивки",
      "description": "Противники могут устанавливать вредоносные или уязвимые прошивки на модульные аппаратные устройства. Устройства системы управления часто содержат модульные аппаратные устройства. Эти устройства могут иметь свой собственный набор прошивки, который отделен от прошивки основного оборудования системы управления.\n\nЭтот метод аналогичен [System Firmware] (https://attack.mitre.org/techniques/T0857), но проводится на других компонентах системы, которые могут не иметь таких же возможностей или уровня проверки целостности. Хотя это приводит к повторному отображению устройства, прошивка вредоносного устройства может обеспечить постоянный доступ к оставшимся устройствам. (перенаправлено с «Daniel Peck, Dale Peterson January 2009»)\n\nПростой точкой доступа для противника является карта Ethernet, которая может иметь свой собственный процессор, оперативную память и операционную систему. Противник может атаковать и, вероятно, использовать компьютер на карте Ethernet. Эксплуатация карточного компьютера Ethernet может позволить противнику совершить дополнительные атаки, такие как: (Ситуация: Дэниел Пек, Дейл Петерсон, январь 2009)\n\nЗадержка атаки - Противник может заранее организовать атаку и выбрать, когда ее начать, например, в особенно опасное время.\nКирпичная карта Ethernet - вредоносное прошивка может быть запрограммировано, чтобы привести к отказу карты Ethernet, требуя возврата на заводе.\nСлучайная атака или сбой - противник может загрузить вредоносное ПО на несколько полевых устройств. Выполнение атаки и время ее возникновения генерируется генератором псевдослучайных чисел.\nПолевое устройство червя - Противник может выбрать идентификацию всех полевых устройств одной и той же модели с конечной целью выполнения компрометации всего устройства.\nАтака других карт на полевое устройство - хотя это не самый важный модуль в полевом устройстве, карта Ethernet наиболее доступна противнику и вредоносным программам. Компромисс карты Ethernet может обеспечить более прямой путь к компрометации других модулей, таких как модуль процессора."
    },
    "T0840": {
      "name": "Перечисление сетевого подключения",
      "description": "Противники могут выполнять перечисление сетевых соединений, чтобы обнаружить информацию о моделях связи устройства. Если противник может проверить состояние сетевого соединения с такими инструментами, как Netstat (Citation: Netstat), совместно с [System Firmware] (https://attack.mitre.org/techniques/T0857), то он может определить роль определенных устройств в сети (Citation: MITRE). Противник также может использовать [Network Sniffing] (https://attack.mitre.org/techniques/T0842) для просмотра сетевого трафика для получения подробной информации об источнике, пункте назначения, протоколе и контенте."
    },
    "T0842": {
      "name": "Сеть Sniffing",
      "description": "Сетевой сниффинг — это практика использования сетевого интерфейса на компьютерной системе для мониторинга или сбора информации (Citation: Enterprise ATT & CK January 2018) независимо от того, является ли она указанной целью для информации.\n\nПротивник может попытаться пронюхать трафик, чтобы получить информацию о цели. Эта информация может варьироваться по уровню важности. Относительно неважная информация — это общая связь с машинами и от них. Относительно важной информацией будет информация для входа. Пользовательские учетные данные могут быть отправлены по незашифрованному протоколу, такому как Telnet, который может быть захвачен и получен с помощью анализа сетевых пакетов.\n\nКроме того, отравление ARP и службой доменных имен (DNS) может использоваться для захвата учетных данных веб-сайтов, прокси-серверов и внутренних систем путем перенаправления трафика на противника."
    },
    "T0843": {
      "name": "Скачать программу",
      "description": "Противники могут выполнить загрузку программы для передачи пользовательской программы контроллеру.\n\nВариации загрузки программы, такие как онлайн-редактирование и приложение к программе, позволяют контроллеру продолжать работу во время процесса передачи и реконфигурации без перерыва для управления процессом. Однако перед началом полной загрузки программы (т.е. загрузки всех) контроллеру может потребоваться перейти в стоп-состояние. Это может иметь негативные последствия для физического процесса, особенно если контроллер не способен выполнять чувствительные ко времени действия. Противники могут выбрать, чтобы избежать загрузки все в пользу онлайн-редактирования или приложения программы, чтобы избежать нарушения физического процесса. Противнику может потребоваться использовать метод обнаружения операционного режима или изменения операционного режима, чтобы убедиться, что контроллер находится в правильном режиме для приема загрузки программы.\n\nГранулярность управления для передачи пользовательской программы целиком или частично продиктована протоколом управления (например, S7CommPlus, TriStation) и базовым API контроллера. Таким образом, загрузка программы - это высокоуровневый термин для набора вызовов API для конкретных поставщиков, используемых для настройки пространства памяти пользовательской программы контроллера.\n\n[Modify Controller Tasking] (https://attack.mitre.org/techniques/T0821) и [Modify Program] (https://attack.mitre.org/techniques/T0889) представляют собой изменения конфигурации, которые передаются контроллеру через загрузку программы."
    },
    "T0845": {
      "name": "Скачать программу",
      "description": "Противники могут попытаться загрузить программу из ПЛК для сбора информации о промышленном процессе. Загрузка программы может позволить им приобрести и изучить основную логику. Способы загрузки программы включают программное обеспечение поставщика, которое позволяет пользователю загружать и читать программу, работающую на PLC. Это программное обеспечение может использоваться для загрузки целевой программы на рабочую станцию, прыжковую коробку или устройство сопряжения."
    },
    "T0846": {
      "name": "Дистанционное обнаружение системы",
      "description": "Противники могут попытаться получить список других систем по IP-адресу, имени хоста или другому логическому идентификатору в сети, который может использоваться для последующих методов бокового перемещения или обнаружения. Функциональность может существовать в инструментах противника, но также могут использоваться утилиты, доступные в операционной системе или программном обеспечении поставщика. (перенаправлено с «Enterprise ATT&CK January 2018»)"
    },
    "T0847": {
      "name": "Репликация через удаляемые носители",
      "description": "Противники могут переходить на системы, например, отделенные от корпоративной сети, путем копирования вредоносных программ на съемные носители, которые вставляются в среду систем управления. Противник может полагаться на незнание доверенных третьих сторон, таких как поставщики или подрядчики с привилегиями доступа, для введения съемных носителей. Этот метод обеспечивает первоначальный доступ к целевым устройствам, которые никогда не подключаются к ненадежным сетям, но физически доступны.\n\nОператоры немецкой атомной электростанции Gundremmingen обнаружили вредоносное ПО на компьютере объекта, не подключенном к Интернету. (Citation: Kernkraftwerk Gundremmingen April 2016) (Citation: Trend Micro April 2016) Вредоносные программы включали Conficker и W32. Ramnit, которые также были обнаружены на восемнадцати съемных дисках в объекте. (Citation: Christoph Steitz, Eric Auchard April 2016) (Citation: Catalin Cimpanu April 2016) (Citation: Peter Dockrill April 2016) (Citation: Lee Mathews April 2016) (Citation: Sean Gallagher April 2016) (Citation: Dark Reading Staff April 2016) С тех пор завод проверил наличие инфекции и очистил более 1000 компьютеров. (перенаправлено с «BBC April 2016») Исследователь ESET отметил, что отключение интернета не гарантирует безопасность системы от заражения или выполнения полезной нагрузки. (перенаправлено с «ESET April 2016»)"
    },
    "T0848": {
      "name": "Изгой Мастер",
      "description": "Противники могут настроить мастера-изгоя, чтобы использовать функции сервера управления для связи с аутстациями. Мастер-изгой может использоваться для отправки законных сообщений управления другим устройствам системы управления, влияя на процессы непреднамеренным образом. Он также может быть использован для нарушения сетевых коммуникаций путем захвата и приема сетевого трафика, предназначенного для реального мастера. Выдача себя за мастера может также позволить противнику избежать обнаружения.\n\nВ случае с инцидентом в Даллас Сирене в 2017 году противники использовали мастера-изгоя для отправки командных сообщений 156 распределенным сиренам по всему городу либо через один передатчик-изгой с сильным сигналом, либо с помощью многих распределенных ретрансляторов. (Citation: Bastille April 2017) (Citation: Zack Whittaker April 2017)"
    },
    "T0849": {
      "name": "маскировка",
      "description": "Противники могут использовать маскировку для маскировки вредоносного приложения или исполняемого файла, чтобы избежать подозрений оператора и инженера. Возможные маскировки этих маскирующих файлов могут включать в себя обычно встречающиеся программы, ожидаемые исполняемые файлы поставщиков и файлы конфигурации, а также другие распространенные приложения и соглашения об именах. Выдавая себя за ожидаемые и релевантные поставщику файлы и приложения, операторы и инженеры могут не заметить наличие базового вредоносного контента и, возможно, в конечном итоге запустить те, которые маскируются под законные функции.\n\nПриложения и другие файлы, обычно встречающиеся в системах Windows или на рабочих станциях, выдавали себя за других. Это может быть так же просто, как переименование файла, чтобы эффективно замаскировать его в среде ICS."
    },
    "T0851": {
      "name": "Руткит",
      "description": "Противники могут использовать руткиты, чтобы скрыть наличие программ, файлов, сетевых соединений, сервисов, драйверов и других компонентов системы. Rootkits - это программы, которые скрывают существование вредоносных программ путем перехвата и изменения вызовов API операционной системы, которые предоставляют системную информацию. Функциональные возможности руткитов или руткитов могут находиться на уровне пользователя или ядра в операционной системе или ниже. (перенаправлено с «Enterprise ATT&CK January 2018»)\n\nРуткиты прошивки, которые влияют на операционную систему, дают почти полный контроль над системой. Хотя руткиты прошивки обычно разрабатываются для основной платы обработки, они также могут быть разработаны для ввода-вывода, который прикреплен к активу. Компромисс этой прошивки позволяет изменять все переменные процесса и функции, которыми занимается модуль. Это может привести к тому, что команды будут игнорироваться, а ложная информация будет подаваться на основное устройство. Вмешиваясь в процессы устройства, противник может ингибировать свои ожидаемые функции реагирования и, возможно, включить [Impact] (https://attack.mitre.org/tactics/TA0105)."
    },
    "T0852": {
      "name": "Захват экрана",
      "description": "Противники могут попытаться выполнить захват экрана устройств в среде системы управления. Скриншоты могут быть сделаны рабочих станций, HMI или других устройств, которые отображают соответствующий окружающей среде процесс, устройство, отчетность, сигнализацию или связанные данные. Эти дисплеи устройств могут раскрывать информацию о процессе ICS, компоновке, управлении и связанных с ними схемах. В частности, HMI может предоставить много важной информации о промышленных процессах. (Цитирование: ICS-CERT, октябрь 2017 г.) Анализ снимков экрана может дать противнику понимание предполагаемых операций и взаимодействий между критическими устройствами."
    },
    "T0853": {
      "name": "Сценарий",
      "description": "Противники могут использовать языки сценариев для выполнения произвольного кода в виде предварительно написанного сценария или в виде предоставленного пользователем кода для интерпретатора. Языки сценариев - это языки программирования, которые отличаются от компилируемых языков, в которых языки сценариев используют интерпретатор, а не компилятор. Эти интерпретаторы читают и компилируют часть исходного кода непосредственно перед его выполнением, в отличие от компиляторов, которые компилируют каждую строку кода в исполняемый файл. Скриптинг позволяет разработчикам программного обеспечения запускать свой код в любой системе, где существует интерпретатор. Таким образом, они могут распространять один пакет вместо предварительной компиляции исполняемых файлов для различных систем. Языки сценариев, такие как Python, имеют свои интерпретаторы по умолчанию со многими дистрибутивами Linux.\n\nВ дополнение к тому, чтобы быть полезным инструментом для разработчиков и администраторов, интерпретаторы языка сценариев могут быть использованы противником для выполнения кода в целевой среде. Из-за характера языков сценариев это позволяет легко развертывать вооруженный код на цель и оставляет открытой возможность выполнения задачи."
    },
    "T0855": {
      "name": "Несанкционированное командное сообщение",
      "description": "Противники могут отправлять несанкционированные командные сообщения, чтобы инструктировать активы системы управления выполнять действия за пределами их предполагаемой функциональности или без логических предварительных условий для запуска их ожидаемой функции. Командные сообщения используются в сетях АСУ ТП для предоставления прямых инструкций устройствам систем управления. Если противник может отправить несанкционированное командное сообщение в систему управления, то он может поручить устройству системы управления выполнить действие за пределами обычных границ действий устройства. Противник может поручить устройству системы управления выполнить действие, которое вызовет [Impact] (https://attack.mitre.org/tactics/TA0105). (перенаправлено с «Bonnie Zhu, Anthony Joseph, Shankar Sastry 2011»)\n\nВ инциденте с «Даллас Сирен» противники смогли отправить командные сообщения для активации систем сигнализации торнадо по всему городу без надвигающегося торнадо или другой катастрофы. (Citation: Zack Whittaker April 2017) (Citation: Benjamin Freed March 2019)"
    },
    "T0856": {
      "name": "Спуф сообщает сообщение",
      "description": "Противники могут подделывать сообщения в средах системы управления для уклонения и нарушения управления процессом. В системах управления сообщения отчетности содержат данные телеметрии (например, значения ввода/вывода), относящиеся к текущему состоянию оборудования и промышленному процессу. Сообщения отчетности важны для мониторинга нормальной работы системы или выявления важных событий, таких как отклонения от ожидаемых значений.\n\nЕсли противник имеет возможность отправлять сообщения, он может повлиять на систему управления несколькими способами. Противник может спуфить сообщения, в которых говорится, что процесс работает нормально, как форма уклонения. Противник также может заставить защитников и операторов думать, что происходят другие ошибки, чтобы отвлечь их от фактического источника проблемы. (перенаправлено с «Bonnie Zhu, Anthony Joseph, Shankar Sastry 2011»)"
    },
    "T0857": {
      "name": "Системные прошивки",
      "description": "Прошивка системы на современных активах часто разрабатывается с функцией обновления. Старые прошивки устройств могут быть установлены на заводе и требуют специального перепрограммирующего оборудования. При наличии функция обновления прошивки позволяет поставщикам удаленно исправлять ошибки и выполнять обновления. Обновления прошивки устройства часто делегируются пользователю и могут быть сделаны с помощью пакета обновления программного обеспечения. Также возможно выполнение этой задачи по сети.\n\nПротивник может использовать функцию обновления прошивки на доступных устройствах для загрузки вредоносного или устаревшего прошивки. Вредоносная модификация прошивки устройства может обеспечить противнику корневой доступ к устройству, при этом прошивка является одним из самых низких уровней абстракции программирования. (перенаправлено с «Basnight, Zachry, et al.»)"
    },
    "T0858": {
      "name": "Изменить режим работы",
      "description": "Противники могут изменить режим работы контроллера, чтобы получить дополнительный доступ к инженерным функциям, таким как загрузка программы. Программируемые контроллеры обычно имеют несколько режимов работы, которые контролируют состояние программы пользователя и контролируют доступ к API контроллеров. Режимы работы могут быть физически выбраны с помощью переключателя клавиш на лицевой стороне контроллера, но также могут быть выбраны с вызовами в API контроллеров. Режимы работы и механизмы, с помощью которых они выбираются, часто варьируются в зависимости от поставщика и линейки продуктов. Некоторые обычно реализуемые режимы работы описаны ниже:\n\n* Программа - Этот режим должен быть включен до внесения изменений в программу устройства. Это позволяет загружать программы между устройством и инженерной рабочей станцией. Часто логика ПЛК Приостанавливается, и все выходы могут быть вытеснены. (перенаправлено с «N.A. October 2017»)\n* Run - выполнение программы устройства происходит в этом режиме. Ввод и вывод (значения, точки, теги, элементы и т.д.) контролируются и используются в соответствии с логикой программ. [Загрузка программы] (https://attack.mitre.org/techniques/T0845) и [Загрузка программы] (https://attack.mitre.org/techniques/T0843) отключены в этом режиме. (Citation: Omron) (Citation: Machine Information Systems 2007) (Citation: N.A. October 2017) (Citation: PLCgurus 2021)\n* Удаленное - позволяет удаленно изменять режим работы ПЛК. (перенаправлено с «PLCgurus 2021»)\n*Стоп! ПЛК и программа останавливаются, а в этом режиме вытесняются выходы. (перенаправлено с «Машинные информационные системы 2007»)\n* Перезагрузка - Условия на ПЛК сбрасываются в исходные состояния. Теплые сбросы могут сохранять некоторую память, в то время как холодные сбросы будут сбрасывать все регистры ввода-вывода и данных. (перенаправлено с «Машинные информационные системы 2007»)\n* Режим тестирования/монитора - Подобно режиму запуска, обрабатывается ввод/вывод, хотя этот режим позволяет осуществлять мониторинг, настройку силы, сбросы и, в более общем плане, настройку или отладку системы. Часто режим монитора может использоваться в качестве пробного для инициализации. (перенаправлено с «Omron»)"
    },
    "T0859": {
      "name": "Действительные счета",
      "description": "Противники могут украсть учетные данные конкретного пользователя или учетной записи службы, используя методы доступа к учетным данным. В некоторых случаях учетные данные по умолчанию для устройств системы управления могут быть общедоступными. Компрометированные учетные данные могут использоваться для обхода средств управления доступом, размещенных на различных ресурсах на хостах и в сети, и могут даже использоваться для постоянного доступа к удаленным системам. Компрометированные и по умолчанию учетные данные могут также предоставлять противнику повышенные привилегии для конкретных систем и устройств или доступ к ограниченным областям сети. Противники могут отказаться от использования вредоносных программ или инструментов в сочетании с законным доступом, предоставляемым этими учетными данными, чтобы затруднить обнаружение их присутствия или управление устройствами и отправку законных команд непреднамеренным образом.\n\nПротивники могут также создавать учетные записи, иногда используя заранее определенные имена учетных записей и пароли, чтобы обеспечить средства резервного доступа для сохранения. (перенаправлено с «Booz Allen Hamilton»)\n\nПерекрытие учетных данных и разрешений в сети систем вызывает озабоченность, поскольку противник может иметь возможность переключаться между учетными записями и системами для достижения высокого уровня доступа (т.е. администратора домена или предприятия) и, возможно, между средой предприятия и операционной технологией. Противники могут использовать действительные учетные данные одной системы для получения доступа к другой системе."
    },
    "T0860": {
      "name": "Беспроводной компромисс",
      "description": "Противники могут выполнять беспроводные компрометации как способ получения связи и несанкционированного доступа к беспроводной сети. Доступ к беспроводной сети может быть получен посредством компрометации беспроводного устройства. (Цитирование: Александр Большев, Глеб Чербов июль 2014) (Цитирование: Александр Большев март 2014) Противники могут также использовать радиоприемники и другие устройства беспроводной связи на той же частоте, что и беспроводная сеть. Беспроводной компромисс может быть выполнен в качестве начального вектора доступа с удаленного расстояния.\n\nПольский студент использовал модифицированный телевизионный пульт дистанционного управления, чтобы получить доступ и контроль над городской трамвайной системой Лодзи в Польше. (Цитирование: Джон Билл Мэй 2017) (Цитирование: Шелли Смит февраль 2008) Устройство дистанционного управления позволило студенту взаимодействовать с трамвайной сетью для изменения настроек трека и переопределения управления оператором. Противник, возможно, достиг этого путем приведения контроллера в соответствие с частотой и амплитудой сигналов протокола управления ИК. (перенаправлено с «Bruce Schneier January 2008») Затем контроллер включил первоначальный доступ к сети, позволяя захватывать и воспроизводить сигналы трамвая. (перенаправлено с «John Bill May 2017»)"
    },
    "T0861": {
      "name": "Point & Tag Идентификация",
      "description": "Противники могут собирать значения точек и тегов, чтобы получить более полное понимание среды процесса. Точки могут быть значениями, такими как входы, местоположения памяти, выходы или другие переменные, специфичные для процесса. (перенаправлено с «Dennis L. Sloatman September 2016») Теги - это идентификаторы, присваиваемые точкам для удобства оператора.\n\nСбор таких тегов обеспечивает ценный контекст для экологических точек и позволяет противнику отображать входы, выходы и другие значения для своих процессов управления. Понимание собираемых точек может информировать противника о том, какие процессы и ценности следует отслеживать в ходе операции."
    },
    "T0862": {
      "name": "Компромисс цепочки поставок",
      "description": "Противники могут выполнять компрометацию цепочки поставок, чтобы получить доступ к среде систем управления с помощью зараженных продуктов, программного обеспечения и рабочих процессов. Компромисс цепочки поставок - это манипулирование продуктами, такими как устройства или программное обеспечение, или их механизмами доставки до получения конечным потребителем. Компромисс со стороны противника этих продуктов и механизмов осуществляется с целью компрометации данных или системы, как только зараженные продукты попадают в целевую среду.\n\nКомпромисс в цепочке поставок может происходить на всех этапах цепочки поставок, от манипулирования инструментами разработки и средами до манипулирования разработанными продуктами и механизмами распределения инструментов. Это может включать в себя компромисс и замену законного программного обеспечения и исправлений, например, на веб-сайтах третьих сторон или поставщиков. Нацеливание на компромисс в цепочке поставок может быть сделано в попытках проникнуть в среду конкретной аудитории. В средах систем управления с активами как в сетях ИТ, так и в сетях ОТ возможен компромисс в цепочке поставок, влияющий на ИТ-среду, что может обеспечить дальнейший доступ к среде ОТ.\n\nКонтрафактные устройства могут быть внедрены в глобальную цепочку поставок, что создает риски для владельцев активов и операторов. Эти устройства могут не соответствовать требованиям безопасности, инженерных и производственных требований регулирующих органов, но могут иметь маркировку, указывающую на соответствие отраслевым стандартам. Из-за отсутствия соблюдения стандартов и общего снижения качества контрафактная продукция может представлять серьезную угрозу безопасности и эксплуатации. (перенаправлено с «Control Global May 2019»)\n\nYokogawa выявила случаи, когда их клиенты получали поддельные датчики дифференциального давления с использованием логотипа Yokogawa. Поддельные передатчики были почти неразличимы с подобием функциональности и интерфейса, который имитирует подлинный продукт. (перенаправлено с «Control Global May 2019»)\n\nF-Secure Labs проанализировала подход противника, используемый для компрометации систем жертвы с Havex. (перенаправлено с «Daavid Hentunen, Antti Tikkanen June 2014») Противник установил троянизированные установщики программного обеспечения, доступные на законных веб-сайтах поставщиков ICS / SCADA. После загрузки это программное обеспечение заразило хост-компьютер трояном удаленного доступа (RAT)."
    },
    "T0863": {
      "name": "Исполнение пользователя",
      "description": "Противники могут полагаться на целевое взаимодействие пользователей организаций для выполнения вредоносного кода. Взаимодействие с пользователем может состоять из установки приложений, открытия вложений электронной почты или предоставления более высоких разрешений на документы.\n\nПротивники могут встраивать вредоносный код или визуальный базовый код в такие файлы, как документы Microsoft Word и Excel или установщики программного обеспечения. (перенаправлено с «Booz Allen Hamilton») Выполнение этого кода требует, чтобы пользователь включил скриптинг или написал доступ в документе. Встроенный код не всегда может быть заметен пользователю, особенно в случае троянизированного программного обеспечения. (перенаправлено с «Daavid Hentunen, Antti Tikkanen June 2014»)\n\nКитайская кампания по удалению копий, проводившаяся с 9 декабря 2011 года по 29 февраля 2012 года, доставляла вредоносные программы через вложения, требующие действий пользователя для достижения выполнения. (перенаправлено с «CISA AA21-201A Pipeline Intrusion July 2021»)"
    },
    "T0864": {
      "name": "Переходный киберактив",
      "description": "Противники могут нацеливаться на устройства, которые являются переходными по сетям ICS и внешним сетям. Как правило, временные активы вводятся в окружающую среду уполномоченным персоналом и не остаются в этой среде на постоянной основе. (перенаправлено с «North American Electric Reliability Corporation» в июне 2021 года) Переходные активы обычно необходимы для поддержки функций управления и могут быть более распространенными в системах, где удаленно управляемый актив невозможен, внешние соединения для удаленного доступа не существуют или требуется доступ подрядчика / поставщика 3-й стороны.\n\nПротивники могут использовать переходные активы по-разному. Например, противники могут нацелиться на переходный актив, когда он подключен к внешней сети, а затем использовать его надежный доступ в другой среде для запуска атаки. Они также могут использовать установленные приложения и библиотеки, которые используются законными конечными пользователями для взаимодействия с устройствами системы управления.\n\nВ некоторых случаях переходные активы не могут быть развернуты с безопасной конфигурацией, приводящей к недостаткам, которые могут позволить противнику распространять вредоносный исполняемый код, например, переходный актив может быть заражен вредоносным ПО, а при подключении к среде ICS вредоносное ПО распространяется на другие системы."
    },
    "T0865": {
      "name": "Спирфишинговая привязка",
      "description": "Противники могут использовать вложение копья, вариант копья, как форму атаки социальной инженерии против конкретных целей. Вложения Spearphishing отличаются от других форм Spearphishing тем, что они используют вредоносные программы, прикрепленные к электронной почте. Все формы копьефишинга поставляются в электронном виде и нацелены на конкретного человека, компанию или отрасль. В этом сценарии противники прикрепляют файл к электронной почте и обычно полагаются на [User Execution] (https://attack.mitre.org/techniques/T0863) для получения исполнения и доступа. (перенаправлено с «Enterprise ATT&CK October 2019»)\n\nС 9 декабря 2011 года по 29 февраля 2012 года в Китае проводилась кампания по борьбе с хищничеством, направленная против НПО и их сотрудников. Электронные письма были построены с высоким уровнем сложности, чтобы убедить сотрудников открыть вредоносные вложения файлов. (перенаправлено с «CISA AA21-201A Pipeline Intrusion July 2021»)"
    },
    "T0866": {
      "name": "Эксплуатация удаленных услуг",
      "description": "Противники могут использовать уязвимость программного обеспечения, чтобы воспользоваться ошибкой программирования в программе, службе или в программном обеспечении операционной системы или самом ядре для обеспечения удаленного злоупотребления услугами. Общая цель посткомпромиссного использования удаленных служб заключается в том, чтобы обеспечить первоначальный доступ к среде АСУ ТП и ее боковое перемещение в нее для обеспечения доступа к целевым системам. (перенаправлено с «Enterprise ATT&CK»)\n\nВладельцы активов и операторы ICS пострадали от вымогателей (или вредоносных программ, маскирующихся под вымогателей), мигрирующих из корпоративных ИТ в среды ICS: WannaCry, NotPetya и BadRabbit. В каждом из этих случаев самораспространяющееся вредоносное ПО первоначально инфицировало ИТ-сети, но через эксплойт (особенно уязвимость MS17-010, нацеленную на SMBv1) распространилось на промышленные сети, что оказало значительное влияние. (перенаправлено с «Joe Slowik April 2019»)"
    },
    "T0867": {
      "name": "Перенос бокового инструмента",
      "description": "Противники могут передавать инструменты или другие файлы из одной системы в другую для создания инструментов противника или других файлов в ходе операции. (перенаправлено с «Enterprise ATT&CK») Копирование файлов также может выполняться поперечно между внутренними системами-жертвами для поддержки бокового перемещения с удаленным выполнением с использованием встроенных протоколов совместного использования файлов, таких как совместное использование файлов через SMB для подключенных сетевых акций. (перенаправлено с «Enterprise ATT&CK»)\n\nВ средах систем управления вредоносные программы могут использовать SMB и другие протоколы обмена файлами для перемещения по бокам через промышленные сети."
    },
    "T0868": {
      "name": "Обнаружение операционного режима",
      "description": "Противники могут собирать информацию о ПЛК или контроллерах текущего режима работы. Операционные режимы диктуют, какими функциями изменения или обслуживания можно манипулировать, и часто управляются ключевым переключателем на PLC (например, запустить, прог [программу] и удаленно). Знание этих состояний может быть ценным для противника, чтобы определить, могут ли они перепрограммировать ПЛК. Режимы работы и механизмы, с помощью которых они выбираются, часто варьируются в зависимости от поставщика и линейки продуктов. Некоторые обычно реализуемые режимы работы описаны ниже:\n\n* Программа - Этот режим должен быть включен до внесения изменений в программу устройства. Это позволяет загружать программы между устройством и инженерной рабочей станцией. Часто логика ПЛК Приостанавливается, и все выходы могут быть вытеснены. (перенаправлено с «N.A. October 2017»)\n* Run - выполнение программы устройства происходит в этом режиме. Ввод и вывод (значения, точки, теги, элементы и т.д.) контролируются и используются в соответствии с логикой программ.[Загрузка программы] (https://attack.mitre.org/techniques/T0845) и [Загрузка программы] (https://attack.mitre.org/techniques/T0843) отключены в этом режиме. (Citation: Omron) (Citation: Machine Information Systems 2007) (Citation: N.A. October 2017) (Citation: PLCgurus 2021)\n* Удаленное - позволяет удаленно изменять режим работы ПЛК. (перенаправлено с «PLCgurus 2021»)\n*Стоп! ПЛК и программа останавливаются, а в этом режиме вытесняются выходы. (перенаправлено с «Машинные информационные системы 2007»)\n* Перезагрузка - Условия на ПЛК сбрасываются в исходные состояния. Теплые сбросы могут сохранять некоторую память, в то время как холодные сбросы будут сбрасывать все регистры ввода-вывода и данных. (перенаправлено с «Машинные информационные системы 2007»)\n* Режим тестирования/монитора - Подобно режиму запуска, обрабатывается ввод/вывод, хотя этот режим позволяет осуществлять мониторинг, настройку силы, сбросы и, в более общем плане, настройку или отладку системы. Часто режим монитора может использоваться в качестве пробного для инициализации. (перенаправлено с «Omron»)"
    },
    "T0869": {
      "name": "Стандартный протокол уровня применения",
      "description": "Противники могут устанавливать возможности управления и контроля над широко используемыми протоколами прикладного уровня, такими как HTTP (S), OPC, RDP, telnet, DNP3 и modbus. Эти протоколы могут использоваться для маскировки действий противника в качестве доброкачественного сетевого трафика. Стандартные протоколы могут быть видны на соответствующем порту или в некоторых случаях на нестандартном порту. Противники могут использовать эти протоколы, чтобы выйти из сети для командования и управления, или в некоторых случаях на другие зараженные устройства в сети."
    },
    "T0871": {
      "name": "Выполнение через API",
      "description": "Противники могут попытаться использовать интерфейсы прикладных программ (API), используемые для связи между программным обеспечением управления и оборудованием. Специфическая функциональность часто кодируется в API, которые могут быть вызваны программным обеспечением для выполнения определенных функций на устройстве или другом программном обеспечении."
    },
    "T0872": {
      "name": "Удаление индикатора на хосте",
      "description": "Противники могут попытаться удалить индикаторы своего присутствия в системе, чтобы замести следы. В тех случаях, когда противник может почувствовать, что обнаружение неизбежно, он может попытаться перезаписать, удалить или скрыть изменения, которые он внес в устройство."
    },
    "T0873": {
      "name": "Файловая инфекция проекта",
      "description": "Противники могут попытаться заразить файлы проекта вредоносным кодом. Эти файлы проекта могут состоять из объектов, блоков организации программы, переменных, таких как теги, документация и другие конфигурации, необходимые для функционирования программ PLC. (перенаправлено с «Beckhoff») Используя встроенные функции инженерного программного обеспечения, противники могут загружать зараженную программу в ПЛК в операционной среде, позволяющей использовать дополнительные методы [Execution] (https://attack.mitre.org/tactics/TA0104) и [Persistence] (https://attack.mitre.org/tactics/TA0110). (перенаправлено с «PLCdev»)\n\nПротивники могут экспортировать свой собственный код в файлы проекта с условиями для выполнения через определенные промежутки времени. (Ссылка: Николас Фэлльер, Лиам О Мурчу, Эрик Чиен, февраль 2011 года) Вредоносные программы позволяют противникам контролировать все аспекты процесса, включенного ПЛК. После загрузки файла проекта в PLC устройство рабочей станции может быть отключено с зараженным файлом проекта, который все еще выполняется. (перенаправлено с «PLCdev»)"
    },
    "T0874": {
      "name": "крюк",
      "description": "Противники могут подключаться к функциям интерфейса прикладного программирования (API), используемым процессами для перенаправления вызовов для выполнения и средств повышения привилегий. Процессы Windows часто используют эти функции API для выполнения задач, требующих многоразовых системных ресурсов. Функции API Windows обычно хранятся в библиотеках динамических ссылок (DLL) в качестве экспортируемых функций. (перенаправлено с «Enterprise ATT&CK»)\n\nОдин тип подключения, наблюдаемый в ICS, включает перенаправление вызовов на эти функции через подключение к таблице адресов импорта (IAT). IAT-подключение использует модификации процесса IAT, где хранятся указатели на импортированные функции API. (перенаправлено с «Nicolas Falliere, Liam O Murchu, Eric Chien February 2011»)"
    },
    "T0877": {
      "name": "Изображение I/O",
      "description": "Противники могут стремиться захватить значения процесса, связанные с входами и выходами ПЛК. Во время цикла сканирования ПЛК считывает состояние всех входов и хранит их в таблице изображений. (перенаправлено с «Nanjundaiah, Vaidyanath») Таблица изображений представляет собой внутреннее место хранения ПЛК, где хранятся значения входов/выходов для одного сканирования при выполнении пользовательской программы. После того, как ПЛК решил всю логическую программу, он обновляет таблицу выходных изображений. Содержимое этой таблицы выходного изображения записывается в соответствующие точки вывода в модулях ввода/вывода.\n\nТаблицы ввода и вывода изображений, описанные выше, составляют изображение ввода/вывода на PLC. Это изображение используется пользовательской программой вместо прямого взаимодействия с физическим вводом/выводом (цитата: Spenneberg, Ralf 2016)\n\nПротивники могут собирать состояние изображения ввода/вывода ПЛК, используя устройства [Native API] (https://attack.mitre.org/techniques/T0834) для прямого доступа к областям памяти. Сбор состояния ввода/вывода ПЛК может использоваться для замены значений или информирования о будущих этапах атаки."
    },
    "T0878": {
      "name": "Подавление тревоги",
      "description": "Противники могут нацеливаться на защитную функцию сигнализации, чтобы предотвратить оповещение операторов о критических условиях. Сообщения тревоги могут быть частью общей системы отчетности и представлять особый интерес для противников. Нарушение работы системы сигнализации не означает нарушения работы системы отчетности в целом.\n\nВ презентации Secura о нацеливании на OT отмечается двойная цель для противников, пытающихся подавить тревогу: предотвратить поднятие исходящей сигнализации и предотвратить ответ на входящую. (перенаправлено с «Jos Wetzels, Marina Krotofil 2019») Способ подавления может сильно зависеть от типа сигнализации:\n\n* Тревога, поднятая протокольным сообщением\n* Сигнал тревоги с I/ О!\n* Сигнал тревоги установлен на флаге (и читается)\n\nВ средах АСУ ТП противнику, возможно, придется подавлять или бороться с множественными сигналами тревоги и/или распространением сигнализации для достижения конкретной цели, чтобы избежать обнаружения или предотвратить намеченные ответы. (перенаправлено с «Jos Wetzels, Marina Krotofil 2019») Способы подавления могут включать в себя подделку или изменение дисплеев и журналов устройств, изменение кода памяти до фиксированных значений или даже подделку кода команд уровня сборки."
    },
    "T0879": {
      "name": "Ущерб имуществу",
      "description": "Противники могут нанести ущерб и уничтожить имущество инфраструктуры, оборудования и окружающей среды при атаке систем управления. Этот метод может привести к поломке устройства и операционного оборудования или представлять собой тангенциальный ущерб от других методов, используемых в атаке. В зависимости от тяжести физического повреждения и сбоев, вызванных процессами и системами управления, этот метод может привести к потере безопасности (https://attack.mitre.org/techniques/T0880). Операции, которые приводят к [утрате контроля] (https://attack.mitre.org/techniques/T0827), также могут нанести ущерб имуществу, который может быть прямо или косвенно мотивирован противником, стремящимся вызвать воздействие в виде [утраты производительности и доходов] (https://attack.mitre.org/techniques/T0828).\n\n\nФедеральное ведомство по информационной безопасности Германии (BSI) сообщило о целенаправленной атаке на сталелитейный завод в рамках инцидентов, затрагивающих бизнес-секцию его отчета по информационной безопасности за 2014 год. (перенаправлено с «BSI State of IT Security 2014») Эти целенаправленные атаки повлияли на промышленные операции и привели к поломкам компонентов системы управления и даже целых установок. В результате этих поломок массивное воздействие и повреждение возникли в результате неконтролируемого отключения доменной печи.\n\nПольский студент использовал устройство дистанционного управления для взаимодействия с городской трамвайной системой Лодзи в Польше. (Цитирование: Джон Билл Май 2017) (Цитирование: Шелли Смит Февраль 2008) (Цитирование: Брюс Шнайер Январь 2008) Используя этот пульт, студент смог захватить и воспроизвести законные трамвайные сигналы. Это привело к повреждению пострадавших трамваев, людей и окружающей собственности. Сообщается, что четыре трамвая сошли с рельсов и были вынуждены сделать аварийные остановки. Командования, выпущенные студентом в феврале 2008 года, также могли привести к столкновениям трамваев, причинив вред тем, кто находится на борту, и окружающей среде снаружи. (перенаправлено с «Bruce Schneier January 2008»)"
    },
    "T0880": {
      "name": "Потеря безопасности",
      "description": "Противники могут скомпрометировать функции системы безопасности, предназначенные для поддержания безопасной работы процесса при возникновении неприемлемых или опасных условий. Системы безопасности часто состоят из тех же элементов, что и системы управления, но имеют единственную цель - обеспечить сбой процесса в заранее определенном безопасном режиме.\n\nМногие небезопасные условия в процессе управления происходят слишком быстро, чтобы человек мог реагировать. Скорость имеет решающее значение для исправления этих условий, чтобы ограничить серьезные последствия, такие как потеря контроля и повреждение имущества.\n\nПротивники могут нацеливаться и отключать функции системы безопасности в качестве предварительного условия для последующего выполнения атаки или позволять будущим небезопасным условиям оставаться неконтролируемыми. Обнаружение операторами потери безопасности может привести к остановке процесса из-за строгой политики в отношении систем безопасности. Это может привести к потере производительности и доходов и может соответствовать техническим целям противников, стремящихся вызвать сбои процесса."
    },
    "T0881": {
      "name": "Остановить сервис",
      "description": "Противники могут прекратить или отключить услуги в системе, чтобы сделать эти услуги недоступными для законных пользователей. Прекращение работы критически важных служб может препятствовать или останавливать реагирование на инцидент или помощь в достижении общих целей противника, чтобы нанести ущерб окружающей среде. (перенаправлено с «Enterprise ATT&CK») Сервисы могут не допускать модификации своих хранилищ данных во время работы. Злоумышленники могут останавливать службы для проведения Уничтожения Данных. (перенаправлено с «Enterprise ATT&CK»)"
    },
    "T0882": {
      "name": "Кража оперативной информации",
      "description": "Противники могут украсть оперативную информацию о производственной среде в качестве прямого результата миссии для личной выгоды или для информирования будущих операций. Эта информация может включать в себя проектные документы, расписания, вращательные данные или аналогичные артефакты, которые обеспечивают понимание операций. В инциденте с плотиной Боуман противники исследовали системы для оперативных данных. (Цитирование: Марк Томпсон март 2016) (Цитирование: Дэнни Ядрон декабрь 2015)"
    },
    "T0883": {
      "name": "Доступное для Интернета устройство",
      "description": "Противники могут получить доступ в промышленную среду через системы, непосредственно подключенные к Интернету для удаленного доступа, а не через [External Remote Services] (https://attack.mitre.org/techniques/T0822). Устройства, доступные в Интернете, подвергаются воздействию Интернета непреднамеренно или намеренно без надлежащей защиты. Это может позволить противникам перейти непосредственно в сеть системы управления. Доступ к этим устройствам осуществляется без использования эксплойтов, они будут представлены в [Exploit Public-Facing Application] (https://attack.mitre.org/techniques/T0819).\n\nПротивники могут использовать встроенные функции удаленного доступа, которые могут быть не защищены, или использовать минимальные устаревшие средства защиты, которые могут быть нацелены. (перенаправлено с «NCCIC January 2014») Эти услуги могут быть обнаружены с помощью онлайн-инструментов сканирования.\n\nВ случае инцидента с плотиной Боумана противники использовали доступ к сети управления плотиной через сотовый модем. Доступ к устройству был защищен аутентификацией пароля, хотя приложение было уязвимо для грубого принуждения. (Citation: NCCIC January 2014) (Citation: Danny Yadron December 2015) (Citation: Mark Thompson March 2016)\n\nВ Trend Micros были обнаружены противники, использующие прямой доступ в Интернет к среде ICS посредством воздействия операционных протоколов, таких как Siemens S7, Omron FINS и EtherNet / IP, в дополнение к неправильно настроенному доступу VNC. (перенаправлено с «Stephen Hilt, Federico Maggi, Charles Perine, Lord Remorin, Martin Rsler, and Rainer Vosseler»)"
    },
    "T0884": {
      "name": "Подключение Proxy",
      "description": "Противники могут использовать прокси-сервер для направления сетевого трафика между системами или выступать в качестве посредника для сетевых коммуникаций.\n\nОпределение прокси также может быть расширено, чтобы охватить доверительные отношения между сетями в одноранговых, сетчатых или доверенных соединениях между сетями, состоящими из хостов или систем, которые регулярно взаимодействуют друг с другом.\n\nСеть может находиться в пределах одной организации или нескольких организаций с доверительными отношениями. Противники могут использовать эти типы отношений для управления командно-контрольной связью, для уменьшения количества одновременных исходящих сетевых соединений, для обеспечения устойчивости перед лицом потери соединения или для преодоления существующих доверенных путей связи между жертвами, чтобы избежать подозрений. (перенаправлено с «Enterprise ATT&CK January 2018»)"
    },
    "T0885": {
      "name": "Обычно используемый порт",
      "description": "Противники могут связываться через обычно используемый порт, чтобы обойти брандмауэры или системы обнаружения сети и слиться с нормальной сетевой активностью, чтобы избежать более детального контроля. Они могут использовать протокол, связанный с портом, или совершенно другой протокол. Они могут использовать обычно открытые порты, такие как приведенные ниже примеры.\n\nTCP:80 (HTTP)\nTCP:443 (HTTPS)\nTCP/UDP:53 (DNS)\nTCP:1024-4999 (OPC для XP/Win2k3)\nTCP:49152-65535 (OPC на Vista и позже)\nTCP:23 (TELNET)\nUDP:161 (SNMP)\nTCP:502 (MODBUS)\nTCP:102 (S7comm/ISO-TSAP)\nTCP: 20000 (DNP3)\nTCP:44818 (Ethernet/IP)"
    },
    "T0886": {
      "name": "Дистанционные услуги",
      "description": "Противники могут использовать удаленные сервисы для перемещения между активами и сегментами сети. Эти сервисы часто используются для того, чтобы операторы могли удаленно взаимодействовать с системами в сети, некоторые примеры — RDP, SMB, SSH и другие подобные механизмы. (Citation: Blake Johnson, Dan Caban, Marina Krotofil, Dan Scali, Nathan Brubaker, Christopher Glyer December 2017) (Citation: Dragos December 2017) (Citation: Joe Slowik April 2019)\n\nУдаленные службы могут использоваться для поддержки удаленного доступа, передачи данных, аутентификации, разрешения имен и других удаленных функций. Кроме того, удаленные службы могут быть необходимы для того, чтобы операторы и администраторы могли настраивать системы в сети со своих рабочих станций. Противник может использовать эту технику для доступа к устройствам, которые могут быть двухдомными (Citation: Blake Johnson, Dan Caban, Marina Krotofil, Dan Scali, Nathan Brubaker, Christopher Glyer December 2017), к нескольким сегментам сети и могут использоваться для [Загрузка программы] (https://attack.mitre.org/techniques/T0843) или для выполнения атак на устройства управления непосредственно через [Valid Accounts] (https://attack.mitre.org/techniques/T0859).\n\nКонкретные удаленные службы (RDP & VNC) могут быть предшественником для обеспечения выполнения [Graphical User Interface] (https://attack.mitre.org/techniques/T0823) на таких устройствах, как HMI или программное обеспечение для инженерных рабочих станций.\n\nНа основе данных об инцидентах CISA и ФБР оценили, что спонсируемые государством китайские субъекты также скомпрометировали различные авторизованные каналы удаленного доступа, включая системы, предназначенные для передачи данных и / или обеспечения доступа между корпоративными и сетями ICS. (перенаправлено с «CISA AA21-201A Pipeline Intrusion July 2021»)"
    },
    "T0887": {
      "name": "Беспроводной нюх",
      "description": "Противники могут стремиться захватить радиочастотную (РЧ) связь, используемую для дистанционного управления и отчетности в распределенных средах. Частоты радиочастотной связи варьируются от 3 кГц до 300 ГГц, хотя обычно они варьируются от 300 МГц до 6 ГГц. (Citation: Candell, R., Hany, M., Lee, K. B., Liu, Y., Quimby, J., Remley, K. April 2018) Длина волны и частота сигнала влияют на то, как сигнал распространяется через открытый воздух, препятствия (например, стены и деревья) и тип радио, необходимый для их захвата. Эти характеристики часто стандартизируются в протоколе и аппаратных средствах и могут влиять на захват сигнала. Некоторые примеры беспроводных протоколов, которые можно найти в киберфизических средах: WirelessHART, Zigbee, WIA-FA и 700 МГц Public Safety Spectrum.\n\nПротивники могут захватывать радиочастотные коммуникации с помощью специализированного оборудования, такого как программно-определяемое радио (SDR), портативное радио или компьютер с радиодемодулятором, настроенным на частоту связи. (Ситуация: Бастилия, апрель 2017 г.) Информация, передаваемая по беспроводному носителю, может передаваться транзитом, независимо от того, является ли устройство для обнюхивания предполагаемым местом назначения или нет. Этот метод может быть особенно полезен противнику, когда сообщения не зашифрованы. (Citation: Gallagher, S. April 2017)\n\nВ инциденте с Dallas Siren в 2017 году есть подозрение, что противники, вероятно, захватили беспроводные командные сообщения на частоте 700 МГц во время регулярного тестирования системы. Позже эти сообщения были перезапущены для запуска систем сигнализации. (Citation: Gallagher, S. April 2017)"
    },
    "T0888": {
      "name": "Дистанционное обнаружение системной информации",
      "description": "Противник может попытаться получить подробную информацию об удаленных системах и их периферийных устройствах, таких как марка / модель, роль и конфигурация. Противники могут использовать информацию из Remote System Information Discovery, чтобы помочь в нацеливании и формировании последующего поведения. Например, оперативная роль системы и информация о модели могут определять, является ли она соответствующей целью для оперативных целей противника. Кроме того, конфигурация системы может использоваться для охвата последующего использования техники.\n\nЗапросы на системную информацию обычно выполняются с использованием протоколов автоматизации и управления и часто автоматически запрашиваются программным обеспечением поставщика во время нормальной работы. Эта информация может быть использована для адаптации действий управления, таких как загрузка программы и прошивки системы или модуля. Противник может использовать эту же информацию, выдавая вызовы непосредственно в API системы."
    },
    "T0889": {
      "name": "Модифицировать программу",
      "description": "Противники могут изменять или добавлять программу на контроллере, чтобы влиять на то, как она взаимодействует с физическим процессом, периферийными устройствами и другими узлами в сети. Модификация программ контроллера может быть выполнена с помощью загрузки программы в дополнение к другим типам модификации программы, таким как онлайн-редактирование и приложение программы.\n\nМодификация программы включает в себя добавление и изменение инструкций и логики, содержащихся в блоках организации программы (POU) (Citation: IEC February 2013) и аналогичных элементах программирования, обнаруженных на контроллерах. Это может включать, например, добавление новых функций в контроллер, изменение логики в существующих функциях и совершение новых вызовов из одной функции в другую.\n\nНекоторые программы могут позволить противнику напрямую взаимодействовать с нативным API контроллера, чтобы воспользоваться неясными функциями или уязвимостями."
    },
    "T0890": {
      "name": "Эксплуатация для расширения привилегий",
      "description": "Противники могут использовать уязвимости программного обеспечения в попытке повысить привилегии. Использование уязвимости программного обеспечения происходит, когда противник использует ошибку программирования в программе, службе или в программном обеспечении операционной системы или самом ядре для выполнения кода, контролируемого противником. Конструкции безопасности, такие как уровни разрешений, часто препятствуют доступу к информации и использованию определенных методов, поэтому противникам, вероятно, потребуется выполнить эскалацию привилегий, чтобы включить использование программного обеспечения для обхода этих ограничений. (перенаправлено с «The MITRE Corporation»)\n\nПри первоначальном получении доступа к системе противник может действовать в рамках менее привилегированного процесса, который будет препятствовать доступу к определенным ресурсам системы. Уязвимости могут существовать, как правило, в компонентах операционной системы и программном обеспечении, обычно работающих при более высоких разрешениях, которые могут быть использованы для получения более высоких уровней доступа в системе. Это может позволить кому-то перейти от непривилегированных разрешений уровня пользователя к SYSTEM или корневым разрешениям в зависимости от уязвимого компонента. Это может быть необходимым шагом для противника, компрометирующего систему конечных точек, которая была правильно настроена и ограничивает другие методы эскалации привилегий. (перенаправлено с «The MITRE Corporation»)"
    },
    "T0891": {
      "name": "Hardcoded учетные данные",
      "description": "Противники могут использовать учетные данные, которые жестко закодированы в программном обеспечении или прошивке, чтобы получить несанкционированный интерактивный сеанс пользователя в актив. Примеры учетных данных, которые могут быть жестко закодированы в активе, включают:\n\n* Имя пользователя/Пароли\n* Криптографические ключи/сертификаты\n* Токены API\n\nВ отличие от [Default Credentials] (https://attack.mitre.org/techniques/T0812), эти учетные данные встроены в систему таким образом, что они либо не могут быть изменены владельцем актива, либо могут быть неосуществимы для изменения из-за воздействия, которое это вызовет на работу системы управления. Эти учетные данные могут быть повторно использованы по всей линейке продуктов или моделей устройств и часто не публикуются или не известны владельцу и операторам актива.\n\nПротивники могут использовать эти жестко закодированные учетные данные для перемещения по всей среде системы управления или обеспечения надежного доступа к своим инструментам для взаимодействия с промышленными активами."
    },
    "T0892": {
      "name": "Изменение полномочий",
      "description": "Противники могут изменять учетные данные программного обеспечения и устройств, чтобы предотвратить доступ оператора и ответчика. В зависимости от устройства, изменение или добавление этого пароля может предотвратить выполнение любых действий конфигурации устройства и может потребовать сброса или замены оборудования. Эти учетные данные часто являются встроенными функциями, предоставляемыми поставщиками устройств в качестве средства ограничения доступа к интерфейсам управления.\n\nПротивник с доступом к действительным или жестко закодированным учетным данным может изменить учетные данные, чтобы предотвратить будущий авторизованный доступ к устройству. Изменение учетных данных может быть особенно вредным в сочетании с другими методами, такими как программа модификации, уничтожение данных или задание контроллера модификации. В этих случаях конфигурация устройства может быть уничтожена или включать вредоносные действия для среды процесса, которые не могут быть удалены посредством обычных действий конфигурации устройства.\n\nКроме того, восстановление устройства и исходная конфигурация могут быть затруднены в зависимости от функций, предоставляемых устройством. В некоторых случаях эти пароли не могут быть удалены на месте и могут потребовать, чтобы устройство было отправлено обратно поставщику для дополнительных шагов восстановления.\n\n\nЦепь инцидентов произошла в Германии, где противники заблокировали операторов из своих контроллеров системы автоматизации зданий, включив ранее не установленный ключ BCU. (перенаправлено с «German BAS Lockout Dec 2021»)"
    },
    "T0893": {
      "name": "Данные из локальной системы",
      "description": "Противники могут нацеливаться и собирать данные из локальных системных источников, таких как файловые системы, файлы конфигурации или локальные базы данных. Это может включать в себя конфиденциальные данные, такие как спецификации, схемы или диаграммы макетов системы управления, устройств и процессов.\n\nПротивники могут сделать это, используя [Command-Line Interface] (https://attack.mitre.org/techniques/T0807) или [Scripting] (https://attack.mitre.org/techniques/T0853) методы взаимодействия с файловой системой для сбора информации. Противники могут также использовать [Automated Collection] (https://attack.mitre.org/techniques/T0802) в локальной системе."
    },
    "T0894": {
      "name": "Системное исполнение Binary Proxy",
      "description": "Противники могут обходить процесс и/или защиту на основе подписи, прокси-серверизируя выполнение вредоносного контента с помощью подписанных или иным образом доверенных двоичных файлов. Бинарные файлы, используемые в этой технике, часто являются файлами, подписанными Microsoft, что указывает на то, что они были либо загружены из Microsoft, либо уже являются нативными в операционной системе. (перенаправлено с «LOLBAS Project») Двоичные, подписанные доверенными цифровыми сертификатами, обычно могут выполняться в системах Windows, защищенных проверкой цифровой подписи. Несколько подписанных Microsoft двоичных файлов, которые по умолчанию установлены в Windows, могут использоваться для прокси-исполнения других файлов или команд. Аналогичным образом, в системах Linux противники могут злоупотреблять доверенными двоичными файлами, такими как разделение на прокси-выполнение вредоносных команд. (Citation: split man page) (Цитирование: GTFO split)\n\nПротивники могут злоупотреблять бинарными приложениями, установленными в системе для прокси-исполнения вредоносного кода или команд, специфичных для домена. Эти команды могут использоваться для таргетинга локальных ресурсов на устройстве или сетевых устройствах в окружающей среде с помощью определенных API ([Execution through API] (https://attack.mitre.org/techniques/T0871)) или языков программирования для конкретных приложений (например, MicroSCADA SCIL). Прикладные двоичные файлы могут быть подписаны разработчиком или, как правило, доверены операторами, аналитиками и инструментами мониторинга, привыкшими к окружающей среде. Эти приложения могут быть разработаны и/или непосредственно предоставлены поставщиком устройств для обеспечения конфигурации, управления и работы их устройств без множества альтернатив.\n\nПротивники могут стремиться нацелиться на эти доверенные двоичные файлы приложений для выполнения или отправки команд без разработки пользовательского вредоносного ПО. Например, противники могут нацеливаться на двоичный сервер SCADA, который имеет существующую возможность отправлять команды на устройства подстанции, например, через командные сообщения IEC 104. Выполнение прокси может по-прежнему требовать разработки пользовательских инструментов для подключения к исполнению двоичного приложения."
    },
    "T0895": {
      "name": "Автозапуск изображения",
      "description": "Противники могут использовать функцию AutoRun или скрипты для выполнения вредоносного кода. Устройства, сконфигурированные для обеспечения функциональности AutoRun или устаревших операционных систем, могут быть подвержены злоупотреблению этими функциями для запуска вредоносного кода, хранящегося на различных формах удаляемых носителей (например, USB, Disk Images [.ISO]). Как правило, AutoRun или AutoPlay отключены во многих конфигурациях операционных систем, чтобы смягчить этот метод. Если устройство выполнено с возможностью включения AutoRun или AutoPlay, противники могут выполнять код на устройстве, устанавливая съемные носители на устройство, либо с помощью физических или виртуальных средств. Это может быть особенно актуально для сред виртуальных машин, где изображения диска могут динамически отображаться в гостевую систему на гипервизоре.\n\nПример может включать в себя получение противником доступа к гипервизору через интерфейс управления для изменения конфигурации оборудования виртуальной машины. Затем они могут развернуть изображение изо с вредоносным скриптом AutoRun, чтобы виртуальная машина автоматически выполняла код, содержащийся на изображении диска. Это позволит выполнять вредоносный код в виртуальной машине без необходимости какого-либо предварительного удаленного доступа к этой системе."
    }
  },
  "meta": {
    "language": "ru",
    "domain": "ics",
    "generated_at": "2025-12-18T12:44:19+00:00",
    "generator": "argostranslate en->ru",
    "note": "Это неофициальный машинный перевод. Возможны неточности."
  },
  "groups": {
    "G0032": {
      "name": "Группа Lazarus",
      "description": "[Lazarus Group] (https://attack.mitre.org/groups/G0032) — северокорейская государственная группа киберугроз, приписанная Генеральному бюро разведки (RGB). (Citation: US-CERT HIDDEN COBRA June 2017) (Citation: Treasury North Korean Cyber Groups September 2019) [Lazarus Group] (https://attack.mitre.org/groups/G0032) была активна, по крайней мере, с 2009 года и, как сообщается, несет ответственность за разрушительную атаку стеклоочистителя в ноябре 2014 года на Sony Pictures Entertainment, идентифицированную Novetta как часть операции Blockbuster. Вредоносное ПО, используемое [Lazarus Group] (https://attack.mitre.org/groups/G0032), коррелирует с другими зарегистрированными кампаниями, включая Operation Flame, Operation 1Mission, Operation Troy, DarkSeoul и Ten Days of Rain.\n\nКибероперации Северной Кореи показали последовательную модель адаптации, формирования и реорганизации подразделений по мере изменения национальных приоритетов. Эти подразделения часто делятся персоналом, инфраструктурой, вредоносными программами и торговыми операциями, что затрудняет приписывание конкретных операций с высокой степенью уверенности. Публичная отчетность часто использует «Группу Лазаря» в качестве зонтичного термина для нескольких северокорейских кибер-операторов, проводящих шпионаж, разрушительные атаки и финансово мотивированные кампании. (Ссылка: Мандиант КНДР Разрушение Лаз Орг 2022) (Ссылка: Мандиант КНДР Группы 2023) (Ссылка: JPCert Blog Laz Subgroups 2025)"
    },
    "G0034": {
      "name": "Группа Sandworm",
      "description": "[Sandworm Team] (https://attack.mitre.org/groups/G0034) является группой деструктивной угрозы, которая была приписана главному разведывательному управлению Генерального штаба России (GRU) Главному центру специальных технологий (GTsST) воинской части 74455. (Ситуация: Обвинение окружного суда США подразделение GRU 74455 октябрь 2020) (Ситуация: Олимпийские атаки NCSC Великобритании октябрь 2020) Эта группа активна, по крайней мере, с 2009 года. (Citation: iSIGHT Sandworm 2014) (Citation: CrowdStrike VOODOO BEAR) (Citation: USDOJ Sandworm Feb 2020) (Citation: NCSC Sandworm Feb 2020)\n\nВ октябре 2020 года США предъявили обвинение шести офицерам подразделения 74455 ГРУ, связанным с [Sandworm Team] (https://attack.mitre.org/groups/G0034) в следующих кибер-операциях: атаки 2015 и 2016 годов против украинских электрических компаний и правительственных организаций, атака 2017 года во всем мире [NotPetya] (https://attack.mitre.org/software/S0368), нацеленная на президентскую кампанию 2017 года во Франции, атака 2018 года [https://attack.mitre.org/software/S0365] против Зимних Олимпийских игр, операция 2018 года против Организации по запрещению химического оружия и атаки против страны Грузия в 2018 и 2019 годах. (Ситуация: Обвинение Окружного суда США Подразделение ГРУ 74455 Октябрь 2020) (Ситуация: Великобритания NCSC Олимпийские атаки Октябрь 2020) Некоторые из них были проведены при содействии подразделения 26165 ГРУ, которое также упоминается как [APT28] (ht"
    },
    "G0035": {
      "name": "Стрекоза",
      "description": "[Dragonfly] (https://attack.mitre.org/groups/G0035) - это кибершпионская группа, которая была приписана Центру 16 Федеральной службы безопасности (FSB) России. (Citation: DOJ Russia Targeting Critical Infrastructure March 2022) (Citation: UK GOV FSB Factsheet April 2022) Активная, по крайней мере, с 2010 года, [Dragonfly] (https://attack.mitre.org/groups/G0035) нацелена на оборонные и авиационные компании, государственные структуры, компании, связанные с промышленными системами управления, и критические инфраструктурные сектора по всему миру посредством цепочек поставок, spearphishing и компрометирующих атак. (Citation: Symantec Dragonfly July 2019) (Citation: Symantec Dragonfly Sept 2017) (Citation: Fortune Dragonfly 2.0 Sept 2017) (Citation: Gigamon Berserk Bear October 2021) (Citation: CISA AA20-296A Ber"
    },
    "G0037": {
      "name": "Фин6",
      "description": "[FIN6] (https://attack.mitre.org/groups/G0037) — киберпреступная группа, которая украла данные платежных карт и продала их для получения прибыли на подземных рынках. Эта группа агрессивно нацелилась и скомпрометировала системы точек продаж (PoS) в секторах гостеприимства и розничной торговли. (Citation: FireEye FIN6 April 2016) (Citation: FireEye FIN6 Apr 2019)"
    },
    "G0046": {
      "name": "Фин7",
      "description": "[FIN7] (https://attack.mitre.org/groups/G0046) — финансово мотивированная группа угроз, активная с 2013 года. [FIN7] (https://attack.mitre.org/groups/G0046) нацелен на розничную торговлю, рестораны, гостиничный бизнес, программное обеспечение, консалтинг, финансовые услуги, медицинское оборудование, облачные услуги, средства массовой информации, продукты питания и напитки, транспорт, фармацевтику и коммунальные услуги в Соединенных Штатах. Часть [FIN7] (https://attack.mitre.org/groups/G0046) управлялась подставной компанией Combi Security и часто использовалась для таргетинга. С 2020 года [FIN7] (https://attack.mitre.org/groups/G0046) перевела операции на крупную охоту за играми (BGH), включая использование вымогателей [REvil] (https://attack.mitre.org/software/S0496) и собственного Ransomware-as-a-Service (RaaS), Darkside. FIN7 может быть связан с [Carbanak] (https://attack.mitre.org/groups/G0008) Группа, но несколько групп угроз наблюдались с использованием [Carbanak] (https://attack.mitre.org/software/S0030), что привело к отдельному отслеживанию этих групп. (Citation: FireEye FIN7 March 2017) (Citation: FireEye FIN7 April 2017) (Citation: FireEye CARBANAK June 2017) (Citation: FireEye FIN7 Aug 2018) (Citation: CrowdStrike Carbon Spider August 2021) (Citation: Mandiant FIN7 Apr 2022) (Citation: BiZone Lizar May 2021)"
    },
    "G0049": {
      "name": "Нефть Риг",
      "description": "[OilRig] (https://attack.mitre.org/groups/G0049) — подозреваемая иранская группа угроз, нацеленная на ближневосточных и международных жертв, по крайней мере, с 2014 года. Группа нацелена на различные сектора, включая финансовый, государственный, энергетический, химический и телекоммуникационный. Похоже, что группа осуществляет атаки на цепочки поставок, используя доверительные отношения между организациями для атаки на их основные цели. Группа работает от имени иранского правительства, основываясь на деталях инфраструктуры, которые содержат ссылки на Иран, использование иранской инфраструктуры и таргетинг, который согласуется с интересами национального государства. (Citation: FireEye APT34 Dec 2017) (Citation: Palo Alto OilRig April 2017) (Citation: ClearSky OilRig Jan 2017) (Citation: Palo Alto OilRig May 2016) (Citation: Palo Alto OilRig Oct 2016) (Citation: Unit42 OilRig Playbook 2023) (Citation: Unit 42 QUADAGENT July 2018)"
    },
    "G0064": {
      "name": "APT33",
      "description": "[APT33] (https://attack.mitre.org/groups/G0064) — подозреваемая иранская группа угроз, которая проводила операции по крайней мере с 2013 года. Группа нацелилась на организации в нескольких отраслях промышленности в Соединенных Штатах, Саудовской Аравии и Южной Корее, с особым интересом к авиационному и энергетическому секторам. (Ситуация: FireEye APT33 Sept 2017)"
    },
    "G0082": {
      "name": "APT38",
      "description": "[APT38] (https://attack.mitre.org/groups/G0082) - северокорейская государственная группа угроз, которая специализируется на финансовых кибероперациях; она была приписана Генеральному бюро разведки. (Citation: CISA AA20-239A BeagleBoyz August 2020) Активная, по крайней мере, с 2014 года, [APT38] (https://attack.mitre.org/groups/G0082) нацелена на банки, финансовые учреждения, казино, криптовалютные биржи, конечные точки системы SWIFT и банкоматы по крайней мере в 38 странах мира. Значительные операции включают ограбление Банка Бангладеш в 2016 году, во время которого [APT38] (https://attack.mitre.org/groups/G0082) украл 81 миллион долларов, а также атаки на Bancomext (Citation: FireEye APT38 Oct 2018) и Banco de Chile (Citation: FireEye APT38 Oct 2018); некоторые из их атак были разрушительными. (Citation: CISA AA20-239A BeagleBoyz August 2020) (Citation: FireEye APT38 Oct 2018) (Citation: DOJ North Korea Indictment Feb 2021) (Citation: Kaspersky Lazarus Under The Hood Blog 2017)\n\nОпределения северокорейских групп, как известно, имеют значительное совпадение, и некоторые исследователи безопасности сообщают обо всей спонсируемой северокорейским государством киберактивности под названием [Lazarus Group] (https://attack.mitre.org/groups/G0032) вместо отслеживания кластеров или подгрупп."
    },
    "G0088": {
      "name": "Темп. Велес",
      "description": "[TEMP.Veles] (https://attack.mitre.org/groups/G0088) — российская группа угроз, нацеленная на критически важную инфраструктуру. Группа была замечена с использованием [TRITON] (https://attack.mitre.org/software/S0609), вредоносной платформы, предназначенной для манипулирования системами промышленной безопасности. (Citation: FireEye TRITON 2019) (Citation: FireEye TEMP.Veles 2018) (Citation: FireEye TEMP). Veles JSON апрель 2019"
    },
    "G0102": {
      "name": "Волшебник Паук",
      "description": "[Wizard Spider] (https://attack.mitre.org/groups/G0102) - российская финансово мотивированная группа угроз, первоначально известная созданием и развертыванием [TrickBot] (https://attack.mitre.org/software/S0266) по крайней мере с 2016 года. [Wizard Spider] (https://attack.mitre.org/groups/G0102) обладает разнообразным арсеналом инструментов и проводит кампании вымогателей против различных организаций, начиная от крупных корпораций до больниц. (Citation: CrowdStrike Ryuk January 2019) (Citation: DHS/CISA Ransomware Targeting Healthcare October 2020) (Citation: CrowdStrike Wizard Spider October 2020)"
    },
    "G0115": {
      "name": "Золотое южное поле",
      "description": "[GOLD SOUTHFIELD] (https://attack.mitre.org/groups/G0115) является финансово мотивированной группой угроз, активной, по крайней мере, с 2018 года, которая управляет [REvil] (https://attack.mitre.org/software/S0496) Ransomware-as-a Service (RaaS). [GOLD SOUTHFIELD] (https://attack.mitre.org/groups/G0115) предоставляет бэкэнд-инфраструктуру для аффилированных лиц, набираемых на подпольных форумах для выполнения высокоценных развертываний. К началу 2020 года [GOLD SOUTHFIELD] (https://attack.mitre.org/groups/G0115) начали извлекать выгоду из новой тенденции кражи данных и дальнейшего вымогательства у жертвы оплаты за свои данные, чтобы не получить публичной утечки. (Citation: Secureworks REvil September 2019) (Citation: Secureworks GandCrab and REvil September 2019) (Citation: Secureworks GOLD SOUTHFIELD) (Citation: CrowdStrike Evolution of Pinchy Spider July 2021)"
    },
    "G1000": {
      "name": "АЛЛАНИТ",
      "description": "[ALLANITE] (https://attack.mitre.org/groups/G1000) — подозреваемая российская группа кибершпионажа, которая в первую очередь нацелена на сектор электроэнергетики в Соединенных Штатах и Соединенном Королевстве. Тактика и методы группы, как сообщается, аналогичны тактике и методам [Dragonfly] (https://attack.mitre.org/groups/G0035), хотя технические возможности [ALLANITE] (https://attack.mitre.org/groups/G1000) не проявляют разрушительных или разрушительных способностей. Было высказано предположение о том, что группа сохраняет свое присутствие в СУИ с целью получения понимания процессов и поддержания устойчивости. (перенаправлено с «Dragos»)"
    },
    "G1001": {
      "name": "Хексан",
      "description": "[HEXANE] (https://attack.mitre.org/groups/G1001) — группа угроз кибершпионажа, нацеленная на нефтегазовые, телекоммуникационные, авиационные и интернет-провайдерские организации по крайней мере с 2017 года. Целевые компании были расположены на Ближнем Востоке и в Африке, включая Израиль, Саудовскую Аравию, Кувейт, Марокко и Тунис. [HEXANE] (https://attack.mitre.org/groups/G1001) TTP выглядят аналогично [APT33] (https://attack.mitre.org/groups/G0064) и [OilRig] (https://attack.mitre.org/groups/G0049), но из-за различий в жертвах и инструментах они отслеживаются как отдельная сущность. (Citation: Dragos Hexane) (Citation: Kaspersky Lyceum October 2021) (Citation: ClearSky Siamesekitten August 2021) (Citation: Accenture Lyceum Targets November 2021)"
    },
    "G1027": {
      "name": "CyberAv3ngers",
      "description": "[CyberAv3ngers] (https://attack.mitre.org/groups/G1027) является подозреваемой группой APT, связанной с Корпусом стражей исламской революции (КСИР). Известно, что [CyberAv3ngers] (https://attack.mitre.org/groups/G1027) активны, по крайней мере, с 2020 года, с оспариваемыми и ложными заявлениями о компромиссах в отношении критической инфраструктуры в Израиле. (цитата: CISA AA23-335A IRGC-Affiliated December 2023)\n\nВ 2023 году [CyberAv3ngers] (https://attack.mitre.org/groups/G1027) занялся глобальным таргетингом и взломом Unitronics [Programmable Logic Controller (PLC)] (https://attack.mitre.org/assets/A0003) с [Human-Machine Interface (HMI)] (https://attack.mitre.org/assets/A0002). Этот ПЛК можно найти в нескольких секторах, включая воду и сточные воды, энергетику, производство продуктов питания и напитков и здравоохранение. Наиболее заметной особенностью этой атаки стало разрушение пользовательского интерфейса устройств.(цитата: CISA AA23-335A IRGC-Affiliated December 2023)"
    }
  },
  "software": {
    "S0038": {
      "name": "Дурак",
      "description": "[Duqu] (https://attack.mitre.org/software/S0038) - это вредоносная платформа, которая использует модульный подход для расширения функциональности после развертывания в целевой сети. (перенаправлено с «Symantec W32») Дуку?"
    },
    "S0089": {
      "name": "Черная энергия",
      "description": "[BlackEnergy] (https://attack.mitre.org/software/S0089) - это инструментарий для вредоносных программ, который использовался как преступниками, так и участниками APT. Он восходит по крайней мере к 2007 году и изначально был разработан для создания ботнетов для использования при проведении DDoS-атак, но его использование развивалось для поддержки различных плагинов. Он хорошо известен тем, что использовался во время противостояния Грузии и России в 2008 году, а также в нападении на украинские институты. Варианты включают BlackEnergy 2 и BlackEnergy 3. (цитата: F-Secure BlackEnergy 2014)"
    },
    "S0093": {
      "name": "Задняя дверь. Олдреа",
      "description": "[Backdoor.Oldrea] (https://attack.mitre.org/software/S0093) — модульный бэкдор, используемый [Dragonfly] (https://attack.mitre.org/groups/G0035) против энергетических компаний по крайней мере с 2013 года. Oldrea (https://attack.mitre.org/software/S0093) распространялась через компрометацию цепочки поставок и включала специализированные модули для перечисления и отображения систем, процессов и протоколов, характерных для ICS. (Citation: Symantec Dragonfly) (Citation: Gigamon Berserk Bear October 2021) (Citation: Symantec Dragonfly Sept 2017)"
    },
    "S0143": {
      "name": "Пламя",
      "description": "[Flame] (https://attack.mitre.org/software/S0143) - это сложный инструментарий, который используется для сбора информации по крайней мере с 2010 года, в основном ориентированный на страны Ближнего Востока. (перенаправлено с « Kaspersky Flame»)"
    },
    "S0366": {
      "name": "WannaCry",
      "description": "[WannaCry] (https://attack.mitre.org/software/S0366) — это программа-вымогатель, которая впервые была замечена в глобальной атаке в мае 2017 года, которая затронула более 150 стран. Он содержит червеобразные функции для распространения по компьютерной сети с использованием эксплойта SMBv1 EternalBlue.(Citation: LogRhythm WannaCry)(Citation: US-CERT WannaCry 2017)(Citation: Washington Post WannaCry 2017)(Citation: FireEye WannaCry 2017)"
    },
    "S0368": {
      "name": "Не Петя",
      "description": "[NotPetya] (https://attack.mitre.org/software/S0368) — вредоносное ПО, которое использовалось [Sandworm Team] (https://attack.mitre.org/groups/G0034) во всемирной атаке, начиная с 27 июня 2017 года. В то время как [NotPetya] (https://attack.mitre.org/software/S0368) выступает в качестве формы вымогателей, его основной целью было уничтожение данных и дисковых структур на скомпрометированных системах; злоумышленники никогда не намеревались сделать зашифрованные данные восстанавливаемыми. Таким образом, [NotPetya] (https://attack.mitre.org/software/S0368) можно более уместно рассматривать как форму вредоносного ПО для стиральной машины. [NotPetya](https://attack.mitre.org/software/S0368) содержит червеобразные функции для распространения по компьютерной сети с использованием эксплойтов SMBv1 EternalBlue и EternalRomance.(Citation: Talos Nyetya June 2017)(Citation: US-CERT NotPetya 2017)(Citation: ESET Telebots June 2017)(Citation: US District Court Indictment GRU Unit 74455 October 2020)"
    },
    "S0372": {
      "name": "Локергога",
      "description": "[LockerGoga] (https://attack.mitre.org/software/S0372) - это программа-вымогатель, которая была впервые зарегистрирована в январе 2019 года и была связана с различными атаками на европейские компании, включая промышленные и производственные фирмы. (Citation: Unit42 LockerGoga 2019) (Citation: CarbonBlack LockerGoga 2019)"
    },
    "S0446": {
      "name": "Рюк",
      "description": "[Ryuk] (https://attack.mitre.org/software/S0446) - это программа-вымогатель, предназначенная для атак на корпоративные среды, которые использовались в атаках, по крайней мере, с 2018 года. [Ryuk](https://attack.mitre.org/software/S0446) разделяет сходство кода с вирусом-вымогателем Hermes.(Citation: CrowdStrike Ryuk January 2019)(Citation: FireEye Ryuk and Trickbot January 2019)(Citation: FireEye FIN6 Apr 2019)"
    },
    "S0496": {
      "name": "назойливый",
      "description": "[REvil] (https://attack.mitre.org/software/S0496) - это семейство вымогателей, которое было связано с группой [GOLD SOUTHFIELD] (https://attack.mitre.org/groups/G0115) и работало как вымогатель-как-услуга (RaaS) по крайней мере с апреля 2019 года. [REvil] (https://attack.mitre.org/software/S0496), который используется против организаций в производственном, транспортном и электрическом секторах, является высококонфигурируемым и имеет кодовое сходство с GandCrab RaaS. (Citation: Secureworks REvil September 2019) (Citation: Intel 471 REvil March 2020) (Citation: Group IB Ransomware May 2020)"
    },
    "S0603": {
      "name": "Stuxnet",
      "description": "[Stuxnet] (https://attack.mitre.org/software/S0603) был первым публично сообщенным вредоносным ПО, специально предназначенным для промышленных устройств управления. [Stuxnet] (https://attack.mitre.org/software/S0603) - это большая и сложная часть вредоносного ПО, которая использовала несколько различных типов поведения, включая несколько уязвимостей нулевого дня, сложный руткит Windows и сетевые инфекции. (Citation: Nicolas Falliere, Liam O Murchu, Eric Chien February 2011) (Citation: CISA ICS Advisory ICSA-10-272-01) (Citation: ESET Stuxnet Under the Microscope) (Citation: Langer Stuxnet) [Stuxnet] (https://attack.mitre.org/software/S0603) был обнаружен в 2010 году, некоторые компоненты использовались уже в ноябре 2008 года. (Citation: Nicolas Falliere, Liam O Murchu, Eric Chien February 2011)"
    },
    "S0604": {
      "name": "Промышленник",
      "description": "[Industroyer] (https://attack.mitre.org/software/S0604) представляет собой сложную структуру вредоносных программ, предназначенную для воздействия на рабочие процессы промышленных систем управления (ICS), в частности, на компоненты, используемые в электрических подстанциях. (Ситуация: ESET Industroyer) [Industroyer] (https://attack.mitre.org/software/S0604) была использована при атаках на украинскую энергосистему в декабре 2016 года. (Ситуация: Dragos Crashoverride 2017) Это первое публично известное вредоносное ПО, специально предназначенное для таргетинга и воздействия на операции в электрической сети. (цитата: Dragos Crashoverride 2018)"
    },
    "S0605": {
      "name": "ЭКАН",
      "description": "[EKANS] (https://attack.mitre.org/software/S0605) - это вариант вымогателей, написанный на Golang, который впервые появился в середине декабря 2019 года и использовался против нескольких секторов, включая энергетику, здравоохранение и автомобилестроение, что в некоторых случаях приводило к значительным сбоям в работе. [EKANS] (https://attack.mitre.org/software/S0605) использовала жестко закодированный список убийств процессов, включая некоторые, связанные с распространенными программными платформами ICS (например, GE Proficy, Honeywell HMIWeb и т.д.), аналогичные тем, которые определены в [MegaCortex] (https://attack.mitre.org/software/S0576)."
    },
    "S0606": {
      "name": "Плохой кролик",
      "description": "[Bad Rabbit] (https://attack.mitre.org/software/S0606) — самораспространяющийся вымогатель, повлиявший на украинский транспортный сектор в 2017 году. [Bad Rabbit] (https://attack.mitre.org/software/S0606) также нацелен на организации и потребителей в России. (Citation: Secure List Bad Rabbit) (Citation: ESET Bad Rabbit) (Citation: Dragos Apr 2019)"
    },
    "S0607": {
      "name": "Kill Disk",
      "description": "[KillDisk] (https://attack.mitre.org/software/S0607) - это инструмент для протирания диска, предназначенный для перезаписи файлов со случайными данными, чтобы сделать ОС незагружаемой. Впервые он был замечен как компонент [BlackEnergy] (https://attack.mitre.org/software/S0089) вредоносного ПО во время кибератак против Украины в 2015 году. [KillDisk] (https://attack.mitre.org/software/S0607) с тех пор превратился в автономное вредоносное ПО, используемое различными субъектами угроз против дополнительных целей в Европе и Латинской Америке; в 2016 году компонент вымогателя также был включен в некоторые варианты [KillDisk] (https://attack.mitre.org/software/S0607). (Citation: KillDisk Ransomware) (Citation: ESEST Black Energy Jan 2016) (Citation: Trend Micro KillDisk 1) (Citation: Trend Micro KillDisk 2)"
    },
    "S0608": {
      "name": "конфайкер",
      "description": "[Conficker] (https://attack.mitre.org/software/S0608) - компьютерный червь, впервые обнаруженный в октябре 2008 года, который нацелился на Microsoft Windows с использованием уязвимости MS08-067 Windows для распространения.(Citation: SANS Conficker) В 2016 году на компьютеры и съемные диски, принадлежащие атомной электростанции, появился вариант [Conficker] (https://attack.mitre.org/software/S0608)."
    },
    "S1000": {
      "name": "ACAD/Medre.A",
      "description": "[ACAD/Medre.A] (https://attack.mitre.org/software/S1000) — это червь, который крадет оперативную информацию. Червь собирает файлы AutoCAD с чертежами. [ACAD/Medre.A] (https://attack.mitre.org/software/S1000) имеет возможность использоваться для промышленного шпионажа."
    },
    "S1006": {
      "name": "ПЛК-бластер",
      "description": "[PLC-Blaster] (https://attack.mitre.org/software/S1006) является частью доказательства концепции вредоносного ПО, которое работает на Siemens S7 PLC. Этот червь находит в сети другие ПЛК Siemens S7 и пытается заразить их. Как только этот червь заразил свою цель и попытался заразить другие устройства в сети, он может запустить один из многих модулей. (Citation: Spenneberg, Ralf, Maik Brggemann, and Hendrik Schwartke March 2016) (Citation: Spenneberg, Ralf 2016)"
    },
    "S1009": {
      "name": "Тритон",
      "description": "[Triton] (https://attack.mitre.org/software/S1009) — это структура атаки, созданная для взаимодействия с контроллерами системы безопасности Triconex (SIS). (Citation: Blake Johnson, Dan Caban, Marina Krotofil, Dan Scali, Nathan Brubaker, Christopher Glyer December 2017) (Citation: Dragos December 2017) (Citation: DHS CISA February 2019) (Citation: Schneider Electric January 2018) (Citation: Julian Gutmanis March 2019) (Citation: Schneider December 2018) (Citation: Jos Wetzels January 2018)"
    },
    "S1010": {
      "name": "VPN фильтр",
      "description": "[VPNFilter] (https://attack.mitre.org/software/S1010) представляет собой многоступенчатую модульную платформу с универсальными возможностями для поддержки как сбора разведданных, так и разрушительных операций кибератаки. [VPNFilter] (https://attack.mitre.org/software/S1010) модули, такие как его сниффер пакетов ('ps'), могут собирать трафик, который проходит через зараженное устройство, позволяя кражу учетных данных веб-сайта и мониторинг протоколов Modbus SCADA. (Citation: William Largent June 2018) (Citation: Carl Hurd March 2019) [VPNFilter] (https://attack.mitre.org/software/S1010) был оценен как заменён [Sandworm Team] (https://attack.mitre.org/groups/G0034) на [Cyclops Blink] (https://attack.mitre.org/software/S0687), начиная с 2019 года. (Citation: NCSC CISA Cyclops Blink Advisory February 2022)"
    },
    "S1045": {
      "name": "неисполнитель",
      "description": "[INCONTROLLER] (https://attack.mitre.org/software/S1045) - это пользовательское вредоносное ПО, которое включает в себя несколько модулей, адаптированных к устройствам и технологиям ICS, включая ПЛК Schneider Electric и Omron, а также протоколы OPC UA, Modbus и CODESYS. [INCONTROLLER] (https://attack.mitre.org/software/S1045) имеет возможность обнаруживать конкретные устройства, загружать логику на устройства и использовать уязвимости, характерные для платформы. По состоянию на сентябрь 2022 года некоторые исследователи безопасности оценили [INCONTROLLER](https://attack.mitre.org/software/S1045) был разработан CHERNOVITE.(Citation: CISA-AA22-103A)(Citation: Brubaker-Incontroller)(Citation: Dragos-Pipedream)(Citation: Schneider-Incontroller)(Citation: Wylie-22)"
    },
    "S1072": {
      "name": "Industroyer2",
      "description": "[Industroyer2] (https://attack.mitre.org/software/S1072) представляет собой скомпилированную и статичную часть вредоносного ПО, которая имеет возможность общаться по протоколу IEC-104. Он похож на модуль IEC-104, найденный в [Industroyer] (https://attack.mitre.org/software/S0604). Исследователи безопасности оценивают, что [Industroyer2] (https://attack.mitre.org/software/S1072) был разработан, чтобы вызвать воздействие на высоковольтные электрические подстанции. Первоначальный [Industroyer2](https://attack.mitre.org/software/S1072) образец был составлен на 03/23/2022 и запланирован к выполнению на 04/08/2022, однако он был обнаружен до развертывания, в результате чего никакого воздействия."
    },
    "S1157": {
      "name": "Фукснет",
      "description": "[Fuxnet] (https://attack.mitre.org/software/S1157) - вредоносное ПО, предназначенное для воздействия на промышленную сетевую инфраструктуру, управляющую датчиками системы управления для коммунальных операций в Москве. [Fuxnet] (https://attack.mitre.org/software/S1157) связана с организацией, называемой хакерской группой Blackjack, которая, по оценкам, связана с украинскими спецслужбами. (цитата: Claroty Fuxnet 2024)"
    },
    "S1165": {
      "name": "Фрости Гуп",
      "description": "[FrostyGoop] (https://attack.mitre.org/software/S1165) - это двоичный файл на базе Windows, написанный на Golang, который позволяет взаимодействовать с оборудованием промышленной системы управления (ICS) через Modbus TCP через порт 502. [FrostyGoop] (https://attack.mitre.org/software/S1165) позволяет считывать и записывать данные для хранения регистров на целевых устройствах, манипулируя работой систем в злонамеренных целях. [FrostyGoop](https://attack.mitre.org/software/S1165) связан с [FrostyGoop Incident](https://attack.mitre.org/campaigns/C0041) в Украине.(Citation: Dragos FROSTYGOOP 2024)(Citation: Nozomi BUSTLEBERM 2024)"
    }
  },
  "mitigations": {
    "M0800": {
      "name": "Уполномоченное исполнение",
      "description": "Устройство или система должны ограничивать чтение, манипулирование или выполнение привилегий только для аутентифицированных пользователей, которым требуется доступ на основе утвержденных политик безопасности. Схемы управления доступом на основе ролей (RBAC) могут помочь уменьшить накладные расходы по назначению разрешений на большое количество устройств в ICS. Например, IEC 62351 предоставляет примеры ролей, используемых для поддержки общих системных операций в секторе электроэнергетики (Citation: International Electrotechnical Commission July 2020), в то время как IEEE 1686 определяет стандартные разрешения для пользователей СВУ. (Ситуация: Институт инженеров электротехники и электроники, январь 2014)"
    },
    "M0801": {
      "name": "Управление доступом",
      "description": "Технологии управления доступом могут использоваться для обеспечения соблюдения политик авторизации и решений, особенно когда существующие полевые устройства не обеспечивают достаточных возможностей для поддержки идентификации и аутентификации пользователей. (Citation: McCarthy, J et al. July 2018) Эти технологии обычно используют встроенное сетевое устройство или систему шлюза для предотвращения доступа к неаутентифицированным пользователям, а также интегрируются со службой аутентификации для первой проверки учетных данных пользователей. Центр защиты национальной инфраструктуры (ноябрь 2010 г.)"
    },
    "M0802": {
      "name": "Коммуникационная подлинность",
      "description": "При общении по ненадежной сети используйте безопасные сетевые протоколы, которые аутентифицируют отправителя сообщения и могут проверить его целостность. Это может быть сделано либо с помощью кодов аутентификации сообщений (MAC), либо с помощью цифровых подписей для обнаружения поддельных сетевых сообщений и несанкционированных соединений."
    },
    "M0803": {
      "name": "Предотвращение потери данных",
      "description": "Технологии предотвращения потери данных (DLP) могут использоваться для выявления враждебных попыток эксфильтрации оперативной информации, такой как инженерные планы, коммерческие секреты, рецепты, интеллектуальная собственность или телеметрия процессов. Функциональность DLP может быть встроена в другие продукты безопасности, такие как брандмауэры или автономные пакеты, работающие в сети и агенты на основе хоста. DLP может быть сконфигурирован для предотвращения передачи информации через корпоративные ресурсы, такие как электронная почта, Интернет и физические носители, такие как USB для хост-решений."
    },
    "M0804": {
      "name": "Аутентификация пользователей",
      "description": "Требуйте аутентификации пользователя, прежде чем разрешить доступ к данным или принимать команды на устройство. Хотя сильная многофакторная аутентификация предпочтительнее, она не всегда возможна в средах ICS. Для выполнения надежной аутентификации пользователей также требуются дополнительные средства управления безопасностью и процессы, которые часто являются целью соответствующих состязательных методов (например, действительные учетные записи, учетные данные по умолчанию). Следовательно, в дополнение к этому следует рассмотреть связанные с ATT & CK смягчения, включая [Multi-factor Authentication] (https://attack.mitre.org/mitigations/M0932), [Account Use Policies] (https://attack.mitre.org/mitigations/M0927), [User Account Management] (https://attack.mitre.org/mitigations/M0918), [Privileged Account Management] (https://attack.mitre.org/mitigations/M0926) и [User Account Control] (https://attack.mitre.org/mitigations/M1052)."
    },
    "M0805": {
      "name": "Слои механической защиты",
      "description": "Используйте многоуровневую конструкцию защиты, основанную на физических или механических системах защиты, чтобы предотвратить повреждение имущества, оборудования, безопасности человека или окружающей среды. Примеры включают блокировки, разрыв диска, значения высвобождения и т. Д. (Citation: A G Foord, W G Gulland, C R Howard, T Kellacher, W H Smith 2004)"
    },
    "M0806": {
      "name": "Минимизация распространения беспроводных сигналов",
      "description": "Беспроводные сигналы часто распространяются за пределами организационных границ, что дает противникам возможность контролировать или получать несанкционированный доступ к беспроводной сети. (перенаправлено с «CISA March 2010») Чтобы минимизировать эту угрозу, организации должны принять меры по обнаружению, пониманию и сокращению ненужного распространения радиочастот. (Цитата: DHS National Urban Security Technology Laboratory, апрель 2019)"
    },
    "M0807": {
      "name": "Сетевые списки разрешений",
      "description": "Сетевые списки разрешений могут быть реализованы через файлы на основе хоста или файлы системных хостов, чтобы указать, какие соединения (например, IP-адрес, MAC-адрес, порт, протокол) могут быть сделаны с устройства. Методы разрешительного списка, которые работают на прикладном уровне (например, DNP3, Modbus, HTTP), рассматриваются в [Filter Network Traffic] (https://attack.mitre.org/mitigations/M0937) смягчении."
    },
    "M0808": {
      "name": "Шифровать сетевой трафик",
      "description": "Используйте сильные криптографические методы и протоколы для предотвращения прослушивания сетевых коммуникаций."
    },
    "M0809": {
      "name": "Операционная информационная конфиденциальность",
      "description": "Развернуть механизмы для защиты конфиденциальности информации, связанной с операционными процессами, местоположениями объектов, конфигурациями устройств, программами или базами данных, которые могут иметь информацию, которая может быть использована для вывода организационных торговых секретов, рецептов и другой интеллектуальной собственности (IP)."
    },
    "M0810": {
      "name": "Канал связи Out-of-Band",
      "description": "Используйте альтернативные методы для поддержки требований к связи во время сбоев связи и атак на целостность данных. (Citation: National Institute of Standards and Technology April 2013) (Citation: Defense Advanced Research Projects Agency)"
    },
    "M0811": {
      "name": "Увольнение службы",
      "description": "Увольнение может быть обеспечено как для критически важных устройств АСУ ТП, так и для таких услуг, как резервные устройства или горячие стоянки."
    },
    "M0812": {
      "name": "Приборные системы безопасности",
      "description": "Используйте приборные системы безопасности (SIS) для обеспечения дополнительного уровня защиты от опасных сценариев, которые могут привести к повреждению имущества. SIS обычно включает в себя датчики, логические решатели и конечный элемент управления, который может быть использован для автоматического реагирования на опасное состояние (Citation: A G Foord, W G Gulland, C R Howard, T Kellacher, W H Smith 2004). Обеспечить, чтобы все СИС были отделены от операционных сетей, чтобы они не подвергались нападкам со стороны противника."
    },
    "M0813": {
      "name": "Программный процесс и аутентификация устройств",
      "description": "Требует аутентификации устройств и программных процессов, где это необходимо. Устройства, которые подключаются удаленно к другим системам, должны требовать надежной аутентификации для предотвращения спуфинга связи. Кроме того, процессы программного обеспечения также должны требовать аутентификации при доступе к API."
    },
    "M0814": {
      "name": "Статическая конфигурация сети",
      "description": "Конфигурация хостов и устройств для использования статических сетевых конфигураций, когда это возможно, протоколы, которые требуют динамического обнаружения/адресации (например, ARP, DHCP, DNS), могут использоваться для манипулирования пересылкой сетевых сообщений и включения различных атак AiTM. Это смягчение не всегда может быть полезным из-за ограниченных функций устройства или проблем, связанных с различными конфигурациями сети."
    },
    "M0815": {
      "name": "Сторож Тимерс",
      "description": "Используйте часовые таймеры, чтобы устройства могли быстро определить, не реагирует ли система."
    },
    "M0816": {
      "name": "Смягчение ограничено или не эффективно",
      "description": "Этот тип атаки не может быть легко смягчен с помощью профилактического контроля, поскольку он основан на злоупотреблении функциями системы."
    },
    "M0817": {
      "name": "Управление цепочками поставок",
      "description": "Внедрить программу управления цепочками поставок, включая политики и процедуры, чтобы гарантировать, что все устройства и компоненты происходят от надежного поставщика и проверяются для проверки их целостности."
    },
    "M0818": {
      "name": "Валидация входов в программу",
      "description": "Устройства и программы, предназначенные для взаимодействия с параметрами системы управления, должны проверять формат и содержание всех пользовательских входов и действий, чтобы гарантировать, что значения находятся в пределах предполагаемых рабочих диапазонов. Эти значения должны быть оценены и дополнительно реализованы с помощью программной логики, работающей на контроллере поля. При выявлении проблемного или недействительного ввода программы должны либо использовать заданное безопасное значение, либо входить в известное безопасное состояние, а также регистрировать или предупреждать о событии. (цитата: PLCTop20 Mar 2023)"
    },
    "M0913": {
      "name": "Руководство для разработчиков приложений",
      "description": "Это смягчение описывает любое руководство или обучение, данное разработчикам приложений, чтобы избежать появления слабых мест безопасности, которыми противник может воспользоваться."
    },
    "M0915": {
      "name": "Конфигурация Active Directory",
      "description": "Настройка Active Directory для предотвращения использования определенных методов; использование фильтрации идентификатора безопасности (SID) и т.д."
    },
    "M0916": {
      "name": "Сканирование уязвимостей",
      "description": "Сканирование уязвимостей используется для поиска потенциально эксплуатируемых уязвимостей программного обеспечения для их устранения."
    },
    "M0917": {
      "name": "Обучение пользователей",
      "description": "Обучить пользователей быть в курсе попыток доступа или манипуляций со стороны противника, чтобы уменьшить риск успешного копья, социальной инженерии и других методов, которые включают взаимодействие с пользователем."
    },
    "M0918": {
      "name": "Управление счетами пользователей",
      "description": "Управление созданием, модификацией, использованием и разрешениями, связанными с учетными записями пользователей."
    },
    "M0919": {
      "name": "Программа Threat Intelligence",
      "description": "Программа разведки угроз помогает организации генерировать свою собственную информацию разведки угроз и отслеживать тенденции для информирования оборонных приоритетов для снижения риска."
    },
    "M0920": {
      "name": "Проверка SSL/TLS",
      "description": "Пройдите и проверьте сеансы SSL / TLS, чтобы посмотреть зашифрованный веб-трафик для активности противника."
    },
    "M0921": {
      "name": "Ограничение веб-контента",
      "description": "Ограничьте использование определенных веб-сайтов, блокируйте загрузки / приложения, блокируйте JavaScript, ограничивайте расширения браузера и т. Д."
    },
    "M0922": {
      "name": "Ограничение разрешений файлов и каталогов",
      "description": "Ограничьте доступ, установив разрешения каталогов и файлов, которые не являются специфическими для пользователей или привилегированных учетных записей."
    },
    "M0924": {
      "name": "Разрешения реестра ограничений",
      "description": "Ограничьте возможность изменения определенных ульев или ключей в реестре Windows."
    },
    "M0926": {
      "name": "Привилегированное управление счетами",
      "description": "Управление созданием, модификацией, использованием и разрешениями, связанными с привилегированными учетными записями, включая SYSTEM и root."
    },
    "M0927": {
      "name": "Политика паролей",
      "description": "Установить и обеспечить безопасность политики паролей для учетных записей."
    },
    "M0928": {
      "name": "Конфигурация операционной системы",
      "description": "Внесите изменения конфигурации, связанные с операционной системой или общей особенностью операционной системы, которые приводят к затвердеванию системы против методов."
    },
    "M0930": {
      "name": "Сетевая сегментация",
      "description": "Архитектурные разделы сети для выделения критических систем, функций или ресурсов. Использование физической и логической сегментации для предотвращения доступа к потенциально чувствительным системам и информации. Используйте DMZ, чтобы содержать любые интернет-услуги, которые не должны быть открыты из внутренней сети. Ограничение доступа к сети только необходимых систем и услуг. Кроме того, системы из других сетей или бизнес-функций (например, предприятия) не имеют доступа к критически важным системам управления технологическими процессами. Например, в МЭК 62443 системы в пределах одного безопасного уровня должны быть сгруппированы в зону, и доступ к этой зоне ограничен каналом или механизмом для ограничения потоков данных между зонами путем сегментирования сети. (Citation: IEC February 2019) (Citation: IEC August 2013)"
    },
    "M0931": {
      "name": "Предотвращение сетевых вторжений",
      "description": "Используйте сигнатуры обнаружения вторжений для блокировки трафика на границах сети. В промышленных средах управления должна быть настроена профилактика сетевых вторжений, чтобы она не нарушала протоколы и коммуникации, ответственные за функции реального времени, связанные с контролем или безопасностью."
    },
    "M0932": {
      "name": "Многофакторная аутентификация",
      "description": "Используйте два или более доказательств для аутентификации системы; например, имя пользователя и пароль в дополнение к токену от физической смарт-карты или генератора токенов. В промышленных средах управления такие активы, как низкоуровневые контроллеры, рабочие станции и HMI, имеют требования к оперативному контролю и безопасности в режиме реального времени, которые могут ограничивать использование многофакторных устройств."
    },
    "M0934": {
      "name": "Ограничить установку аппаратного обеспечения",
      "description": "Блокировать пользователей или группы от установки или использования несанкционированного оборудования в системах, включая USB-устройства."
    },
    "M0935": {
      "name": "Ограничить доступ к ресурсам через сеть",
      "description": "Предотвратить доступ к файлам, удаленный доступ к системам, ненужным сервисам. Механизмы ограничения доступа могут включать использование сетевых концентраторов, шлюзов RDP и т.д."
    },
    "M0936": {
      "name": "Политика использования аккаунтов",
      "description": "Настройка функций, связанных с использованием учетной записи, таких как локауты попытки входа, конкретные времена входа и т. Д."
    },
    "M0937": {
      "name": "Фильтр сетевого трафика",
      "description": "Используйте сетевые устройства для фильтрации входного или выходного трафика и выполнения фильтрации на основе протокола. Настройка программного обеспечения на конечных точках для фильтрации сетевого трафика. Выполнять встроенное разрешение/отрицание сетевых сообщений на основе протокола прикладного уровня (OSI Layer 7), особенно для протоколов автоматизации. Списки разрешений приложений полезны, когда есть четко определенные последовательности связи, типы, скорости или шаблоны, необходимые во время ожидаемых системных операций. Отрицательные списки приложений могут потребоваться, если все приемлемые последовательности связи не могут быть определены, но вместо этого может быть отказано в наборе известных вредоносных применений (например, чрезмерные попытки связи, сообщения отключения, недействительные команды). Устройства, выполняющие эти функции, часто называют брандмауэрами с глубоким пакетом (DPI), брандмауэрами с контекстной информацией или брандмауэрами, блокирующими брандмауэры, известные по протоколу SCADA. (Citation: Centre for the Protection of National Infrastructure, февраль 2005)"
    },
    "M0938": {
      "name": "Предупреждение исполнения",
      "description": "Блокировать выполнение кода в системе посредством управления приложениями и/или блокировки сценариев."
    },
    "M0941": {
      "name": "Шифрование чувствительной информации",
      "description": "Защитите конфиденциальные данные в режиме покоя с помощью надежного шифрования."
    },
    "M0942": {
      "name": "Отключить или удалить функцию или программу",
      "description": "Удалить или запретить доступ к ненужному и потенциально уязвимому программному обеспечению для предотвращения злоупотреблений со стороны противников."
    },
    "M0944": {
      "name": "Ограничение загрузки библиотеки",
      "description": "Предотвращение злоупотребления механизмами загрузки библиотеки в операционной системе и программном обеспечении для загрузки ненадежного кода путем настройки соответствующих механизмов загрузки библиотеки и исследования потенциально уязвимого программного обеспечения."
    },
    "M0945": {
      "name": "Подписание кода",
      "description": "Обеспечить целостность двоичных и прикладных программ с помощью проверки цифровой подписи, чтобы предотвратить выполнение ненадежного кода."
    },
    "M0946": {
      "name": "Boot целостность",
      "description": "Используйте безопасные методы для загрузки системы и проверки целостности операционной системы и механизмов загрузки."
    },
    "M0947": {
      "name": "Аудит",
      "description": "Проводить аудиты или сканирование систем, разрешений, небезопасного программного обеспечения, небезопасных конфигураций и т.д. для выявления потенциальных недостатков. Выполняйте периодические проверки целостности устройства для проверки правильности прошивки, программного обеспечения, программ и конфигураций. Проверки целостности, которые обычно включают криптографические хэши или цифровые подписи, следует сравнивать с теми, которые получены в известных валидных состояниях, особенно после таких событий, как перезагрузка устройства, загрузка программы или перезапуск программы."
    },
    "M0948": {
      "name": "Изоляция приложений и песочница",
      "description": "Ограничить выполнение кода в виртуальной среде на или в пути к системе конечных точек."
    },
    "M0949": {
      "name": "Антивирус/Antimalware",
      "description": "Используйте подписи или эвристику для обнаружения вредоносного программного обеспечения. В промышленных средах управления антивирусные установки должны быть ограничены активами, которые не участвуют в критических операциях или операциях в режиме реального времени. Чтобы свести к минимуму воздействие на доступность системы, все продукты должны быть сначала проверены в репрезентативной тестовой среде перед развертыванием в производственных системах. (перенаправлено с «NCCIC August 2018»)"
    },
    "M0950": {
      "name": "Защита от эксплуатации",
      "description": "Используйте возможности для обнаружения и блокировки условий, которые могут привести или указывать на возникновение эксплойта программного обеспечения."
    },
    "M0951": {
      "name": "Обновление программного обеспечения",
      "description": "Выполняйте регулярные обновления программного обеспечения для снижения риска эксплуатации. Обновления программного обеспечения, возможно, должны быть запланированы в рабочее время."
    },
    "M0953": {
      "name": "Обновление данных",
      "description": "Возьмите и храните резервные копии данных из систем конечных пользователей и критических серверов. Убедитесь, что системы резервного копирования и хранения затвердевают и хранятся отдельно от корпоративной сети для предотвращения компрометации. Поддерживать и осуществлять планы реагирования на инциденты (Citation: Department of Homeland Security October 2009), включая управление резервными изображениями и конфигурациями «золотой копии» для ключевых систем, чтобы обеспечить быстрое восстановление и ответ от враждебных действий, которые влияют на контроль, просмотр или доступность."
    },
    "M0954": {
      "name": "Конфигурация программного обеспечения",
      "description": "Внедрение изменений конфигурации программного обеспечения (кроме операционной системы) для снижения рисков безопасности, связанных с работой программного обеспечения."
    }
  }
}
