{
  "tactics": {
    "TA0027": {
      "name": "Первоначальный доступ",
      "description": "Противник пытается проникнуть в ваше устройство.\n\nТактика первоначального доступа представляет собой векторы, используемые противниками для первоначального закрепления на мобильном устройстве."
    },
    "TA0028": {
      "name": "настойчивость",
      "description": "Противник пытается сохранить свою опору.\n\nНастойчивость - это любое изменение доступа, действия или конфигурации мобильного устройства, которое дает злоумышленнику постоянное присутствие на устройстве. Злоумышленникам часто необходимо поддерживать доступ к мобильным устройствам через перезагрузку устройств и, возможно, даже сброс заводских данных."
    },
    "TA0029": {
      "name": "Эскалация привилегий",
      "description": "Противник пытается получить разрешения более высокого уровня.\n\nЭскалация привилегий включает в себя методы, которые позволяют злоумышленнику получить более высокий уровень разрешений на мобильном устройстве. Злоумышленники могут войти в мобильное устройство с очень ограниченными привилегиями и могут быть обязаны воспользоваться слабостью устройства, чтобы получить более высокие привилегии, необходимые для успешного выполнения своих задач."
    },
    "TA0030": {
      "name": "Уклонение от обороны",
      "description": "Противник пытается избежать обнаружения.\n\nУклонение от защиты состоит из техник, которые противник может использовать, чтобы избежать обнаружения или избежать других защит. Иногда эти действия такие же, как или вариации методов в других категориях, которые имеют дополнительное преимущество подрыва конкретной защиты или смягчения. Уклонение от обороны можно считать набором атрибутов, которые противник применяет ко всем остальным этапам операции."
    },
    "TA0031": {
      "name": "Полный доступ",
      "description": "Противник пытается украсть имена учетных записей, пароли или другие секреты, которые обеспечивают доступ к ресурсам.\n\nУдостоверенный доступ представляет собой методы, которые могут быть использованы противниками для получения доступа или контроля над паролями, токенами, криптографическими ключами или другими значениями, которые могут быть использованы противником для получения несанкционированного доступа к ресурсам. Удостоверительный доступ позволяет противнику принять личность учетной записи со всеми разрешениями этой учетной записи в системе и сети и затрудняет для защитников обнаружение противника. При достаточном доступе к сети противник может создавать учетные записи для последующего использования в среде."
    },
    "TA0032": {
      "name": "открытие",
      "description": "Противник пытается выяснить ваше окружение.\n\nОткрытие состоит из методов, которые позволяют противнику получить знания о характеристиках мобильного устройства и, возможно, других сетевых систем. Когда противники получают доступ к новой системе, они должны ориентироваться на то, что они теперь контролируют и какие выгоды от этой системы дают их текущей цели или общим целям во время вторжения. Операционная система может предоставить возможности, которые помогают на этом этапе сбора информации."
    },
    "TA0033": {
      "name": "Латеральное движение",
      "description": "Противник пытается проникнуть в ваше окружение.\n\nБоковое движение состоит из методов, которые позволяют противнику получить доступ и управлять удаленными системами в сети и могут, но не обязательно, включать в себя выполнение инструментов в удаленных системах. Методы бокового перемещения позволяют противнику собирать информацию из системы без необходимости использования дополнительных инструментов, таких как инструмент удаленного доступа."
    },
    "TA0034": {
      "name": "Воздействие",
      "description": "Противник пытается манипулировать, прерывать или уничтожать ваши устройства и данные.\n\nТактика воздействия состоит из методов, используемых противником для выполнения его или ее целей миссии, но которые не вписываются в другую категорию, такую как Коллекция. Цели миссии варьируются в зависимости от целей каждого противника, но примеры включают мошенничество с платой за проезд, уничтожение данных устройства или блокировку пользователя из своего устройства до тех пор, пока выкуп не будет выплачен."
    },
    "TA0035": {
      "name": "Коллекция",
      "description": "Противник пытается собрать данные, представляющие интерес для его цели.\n\nСбор состоит из методов, используемых для идентификации и сбора информации, такой как конфиденциальные файлы, из целевой сети до эксфильтрации. Эта категория также охватывает места в системе или сети, где противник может искать информацию для эксфильтрации."
    },
    "TA0036": {
      "name": "экстракция",
      "description": "Противник пытается украсть данные.\n\nЭксфильтрация относится к методам и атрибутам, которые приводят или помогают противнику удалять файлы и информацию с целевого мобильного устройства.\n\nВ мобильной среде мобильные устройства часто подключаются к сетям вне корпоративного контроля, таким как сотовые сети или общедоступные сети Wi-Fi. Противники могут попытаться избежать обнаружения, общаясь в этих сетях, и, возможно, даже используя механизмы, не связанные с Интернет-протоколом, такие как служба коротких сообщений (SMS). Тем не менее, сотовые сети часто имеют ограничения данных и / или дополнительные сборы данных, которые могут увеличить потенциал для обнаружения состязательной связи."
    },
    "TA0037": {
      "name": "Командование и контроль",
      "description": "Противник пытается общаться с скомпрометированными устройствами, чтобы контролировать их.\n\nТактика командования и управления представляет собой то, как противники взаимодействуют с системами, находящимися под их контролем, в пределах целевой сети. Есть много способов, которыми противник может установить управление с различными уровнями скрытности, в зависимости от конфигурации системы и топологии сети. Из-за широкой степени изменчивости, доступной противнику на сетевом уровне, для описания различий в командовании и управлении использовались только наиболее распространенные факторы. В документированных методах по-прежнему существует множество конкретных методов, в основном из-за того, насколько легко определить новые протоколы и использовать существующие, законные протоколы и сетевые службы для связи.\n\nВ результате сбой должен помочь передать концепцию, согласно которой обнаружение вторжения через протоколы командования и управления без предварительного знания является трудным предложением в долгосрочной перспективе. Основными ограничениями противников в предотвращении защиты на сетевом уровне являются тестирование и развертывание инструментов для быстрого изменения своих протоколов, осведомленность о существующих защитных технологиях и доступ к законным веб-сервисам, которые при надлежащем использовании затрудняют различие их инструментов от доброкачественного трафика.\n\nКроме того, в мобильной среде мобильные устройства часто подключаются к сетям вне корпоративного управления, таким как сотовые сети или общедоступные сети Wi-Fi. Противники могут попытаться избежать обнаружения, общаясь в этих сетях, и, возможно, даже используя механизмы, не связанные с Интернет-протоколом, такие как служба коротких сообщений (SMS). Тем не менее, сотовые сети часто имеют ограничения данных и / или дополнительные сборы данных, которые могут увеличить потенциал для обнаружения состязательной связи."
    },
    "TA0041": {
      "name": "Казнь",
      "description": "Противник пытается запустить вредоносный код.\n\nИсполнение состоит из методов, которые приводят к контролируемому противником коду, работающему на мобильном устройстве. Техники, которые запускают вредоносный код, часто сочетаются с методами из всех других тактик для достижения более широких целей, таких как исследование сети или кража данных."
    }
  },
  "techniques": {
    "T1398": {
      "name": "Скрипты инициализации Boot или Logon",
      "description": "Противники могут использовать скрипты, автоматически выполняемые при загрузке или инициализации логотипа, чтобы установить настойчивость. Скрипты инициализации являются частью базовой операционной системы и не доступны пользователю, если устройство не было укоренено или взломано."
    },
    "T1404": {
      "name": "Эксплуатация для расширения привилегий",
      "description": "Противники могут использовать уязвимости программного обеспечения для повышения привилегий. Эксплуатация уязвимости программного обеспечения происходит, когда противник использует ошибку программирования в приложении, службе, в программном обеспечении операционной системы или самом ядре для выполнения кода, контролируемого противником. Конструкции безопасности, такие как уровни разрешений, часто препятствуют доступу к информации и использованию определенных методов. Противникам, вероятно, потребуется усилить привилегии, чтобы использовать программное обеспечение для обхода этих ограничений.\n\nПри первоначальном получении доступа к устройству противник может работать в рамках менее привилегированного процесса, который не позволит ему получить доступ к определенным ресурсам системы. Уязвимости могут существовать, как правило, в компонентах операционной системы и приложениях, работающих при более высоких разрешениях, которые могут быть использованы для получения более высоких уровней доступа в системе. Это может позволить кому-то перейти от непривилегированного разрешения уровня пользователя к корневым разрешениям в зависимости от уязвимого компонента."
    },
    "T1406": {
      "name": "Запутанные файлы или информация",
      "description": "Противники могут попытаться затруднить обнаружение или анализ полезной нагрузки или файла путем шифрования, кодирования или иным образом запутывания его содержимого на устройстве или в пути. Это обычное поведение, которое может использоваться на разных платформах и в сети для уклонения от защиты.\n\nПолезные нагрузки могут быть сжаты, архивированы или зашифрованы, чтобы избежать обнаружения. Эти полезные нагрузки могут использоваться во время начального доступа или позже для смягчения обнаружения. Части файлов также могут быть закодированы, чтобы скрыть строки простого текста, которые в противном случае помогли бы защитникам с обнаружением. Загрузки также могут быть разделены на отдельные, казалось бы, доброкачественные файлы, которые только раскрывают вредоносную функциональность при повторной сборке. (перенаправлено с «Microsoft MalLockerB»)"
    },
    "T1406.001": {
      "name": "Стеганография",
      "description": "Противники могут использовать методы стеганографии, чтобы предотвратить обнаружение скрытой информации. Стеганографические методы могут использоваться для сокрытия данных в цифровых носителях, таких как изображения, аудиодорожки, видеоклипы или текстовые файлы."
    },
    "T1406.002": {
      "name": "Упаковка программного обеспечения",
      "description": "Противники могут выполнять упаковку программного обеспечения, чтобы скрыть свой код. Программная упаковка - это способ сжатия или шифрования исполняемого файла. Упаковка исполняемого файла изменяет подпись файла в попытке избежать обнаружения на основе подписи. Большинство методов декомпрессии декомпрессируют исполняемый код в памяти.\n\nУтилиты, используемые для выполнения упаковки программного обеспечения, называются упаковщиками. Примером упаковщика является FTT. Доступен более полный список известных упаковщиков, но противники могут создавать свои собственные методы упаковки, которые не оставляют те же артефакты, что и известные упаковщики, чтобы уклониться от защиты."
    },
    "T1407": {
      "name": "Скачать новый код в Runtime",
      "description": "Противники могут загружать и выполнять динамический код, не включенный в исходный пакет приложения после установки. Этот метод в основном используется для уклонения от проверок статического анализа и предварительного сканирования публикаций в официальных магазинах приложений. В некоторых случаях более продвинутые методы динамического или поведенческого анализа могут обнаружить это поведение. Однако в сочетании с методами [Execution Guardrails] (https://attack.mitre.org/techniques/T1627) обнаружение вредоносного кода, загруженного после установки, может быть затруднено.\n\nНа Android динамический код может включать в себя нативный код, код Dalvik или код JavaScript, который использует функцию «Интерфейс JavaScript» Android WebView.\n\nНа iOS динамический код может быть загружен и выполнен через библиотеки 3rd party, такие как JSPatch. (перенаправлено с «FireEye-JSPatch»)"
    },
    "T1409": {
      "name": "Хранимые данные приложения",
      "description": "Противники могут попытаться получить доступ и собрать данные приложения, находящиеся на устройстве. Противники часто нацелены на популярные приложения, такие как Facebook, WeChat и Gmail. (цитата: SWB Exodus March 2019)\n\n\n\nБлагодаря песочнице для мобильных ОС этот метод возможен только в трех сценариях:\n\n\n\nПриложение хранит файлы в незащищенном внешнем хранилище\nПриложение хранит файлы в своем внутреннем каталоге хранения с небезопасными разрешениями (например, 777).\n* Противник получает корневые разрешения на устройстве"
    },
    "T1414": {
      "name": "Данные Clipboard",
      "description": "Противники могут злоупотреблять API менеджера буфера обмена для получения конфиденциальной информации, скопированной в буфер обмена устройства. Например, пароли, копируемые и вставленные из приложения менеджера паролей, могут быть захвачены вредоносным приложением, установленным на устройстве. (цитата: Fahl-Clipboard)\n\n\n\nНа Android приложения могут использовать «ClipboardManager». OnPrimaryClipChangedListener()' API для регистрации в качестве слушателя и мониторинга буфера обмена для изменений. Однако, начиная с Android 10, это может быть использовано только в том случае, если приложение находится на переднем плане или установлено в качестве редактора метода ввода устройства по умолчанию (IME).(Citation: Github Capture Clipboard 2019)(Citation: Android 10 Privacy Changes)\n\n\n\nВ iOS это можно сделать, зайдя в поле «UIPasteboard.general.string». Однако, начиная с iOS 14, при доступе к буферу обмена пользователю будет показано системное уведомление, если доступный текст возник в другом приложении. Например, если пользователь копирует текст iMessage из приложения Messages, уведомление будет читать «application name вставлено из сообщений», когда текст был вставлен в другое приложение."
    },
    "T1417": {
      "name": "Входящий захват",
      "description": "Противники могут использовать методы захвата пользовательского ввода для получения учетных данных или сбора информации. Во время обычного использования устройства пользователи часто предоставляют учетные данные в различных местах, таких как страницы входа в систему / порталы или системные диалоговые окна. Механизмы захвата ввода могут быть прозрачными для пользователя (например, [Keylogging] (https://attack.mitre.org/techniques/T1417/001)) или полагаться на обман пользователя для предоставления ввода в то, что они считают подлинной подсказкой приложения (например, [GUI Input Capture] (https://attack.mitre.org/techniques/T1417/002))."
    },
    "T1417.001": {
      "name": "кейлогинг",
      "description": "Противники могут регистрировать нажатия клавиш пользователя для перехвата учетных данных или другой информации от пользователя по мере их ввода пользователем.\n\nНекоторые методы кейлогинга включают в себя:\n\n* Маскировка в качестве законной сторонней клавиатуры для записи нажатий клавиш пользователя. (Цитирование: Zeltser-Keyboard) Как на Android, так и на iOS пользователи должны явно разрешить использование сторонних приложений для клавиатуры. Пользователям следует рекомендовать проявлять крайнюю осторожность перед предоставлением этого разрешения, когда оно запрашивается.\n* Злоупотребление функциями доступности. На Android противники могут злоупотреблять функциями доступности для записи нажатий клавиш, регистрируя класс «AccessibilityService», преодолевая метод «onAccessibilityEvent» и слушая «AccessibilityEvent». Тип события TYPE VIEW TEXT CHANGED. Объект события, переданный в функцию, будет содержать данные, набранные пользователем.\n* Дополнительные методы кейлогинга могут быть возможны при наличии корневого доступа."
    },
    "T1417.002": {
      "name": "GUI Input Capture",
      "description": "Противники могут имитировать общие компоненты графического интерфейса операционной системы, чтобы побуждать пользователей к конфиденциальной информации с, казалось бы, законным запросом. Операционная система и установленные приложения часто имеют законные потребности побуждать пользователя к конфиденциальной информации, такой как учетные данные учетной записи, информация о банковском счете или личная информация (PII). По сравнению с традиционными ПК ограниченный размер дисплея мобильных устройств может ухудшить возможность предоставления пользователям контекстной информации, что делает пользователей более восприимчивыми к использованию этой техники. (перенаправлено с «Felt-PhishingOnMobileDevices»)\n\nСуществует несколько подходов, которые противники могут использовать для имитации этой функции. Противники могут выдавать себя за личность законного приложения (например, использовать одно и то же имя приложения и / или значок) и, при установке на устройство, могут запросить у пользователя конфиденциальную информацию. Противники также могут отправлять пользователю поддельные уведомления об устройстве, которые могут вызвать отображение подсказки ввода при нажатии. (Citation: Group IB Gustuff Mar 2019)\n\nКроме того, противники могут отображать подсказку поверх запущенного законного приложения, чтобы обмануть пользователей, вводя конфиденциальную информацию в вредоносное приложение, а не в законное приложение. Как правило, противники должны знать, когда целевое приложение и индивидуальная деятельность в целевом приложении работают на переднем плане, чтобы отображать подсказку в нужное время. Противники могут злоупотреблять функциями доступности Android, чтобы определить, какое приложение в настоящее время находится на переднем плане. (перенаправлено с « ThreatFabric Cerberus») Два известных подхода к отображению подсказки включают:\n\n* Противники начинают новую деятельность поверх запущенного законного приложения.(Citation: Felt-PhishingOnMobileDevices)(Citation: Hassell-ExploitingAndroid) Android 10 устанавливает новые ограничения на возможность приложения начать новую деятельность поверх другого приложения, что может затруднить использование этой техники противниками.\n* Противники создают окно наложения приложения поверх запущенного законного приложения. Приложения должны иметь разрешение System ALERT WINDOW для создания оверлейных окон. Это разрешение обрабатывается иначе, чем обычные разрешения Android, и, по крайней мере, при определенных условиях, автоматически предоставляется приложениям, установленным из Google Play Store. Ожидается, что разрешение SYSTEM ALERT WINDOW и связанная с ним возможность создания оверлейных окон приложений в будущем выпуске Android в пользу нового API. (перенаправлено с «XDA Bubbles»)"
    },
    "T1418": {
      "name": "Программное обеспечение Discovery",
      "description": "Противники могут попытаться получить список приложений, которые установлены на устройстве. Противники могут использовать информацию из [Software Discovery] (https://attack.mitre.org/techniques/T1418) во время автоматического обнаружения для формирования последующего поведения, в том числе для полного заражения цели и/или попыток конкретных действий.\n\n\n\nПротивники могут попытаться перечислить приложения по различным причинам, например, выяснить, какие меры безопасности присутствуют или определить наличие целевых приложений."
    },
    "T1418.001": {
      "name": "Программное обеспечение Discovery",
      "description": "Противники могут попытаться получить список приложений и конфигураций безопасности, установленных на устройстве. Это может включать в себя такие вещи, как мобильные продукты безопасности. Противники могут использовать информацию из [Security Software Discovery] (https://attack.mitre.org/techniques/T1418/001) во время автоматического обнаружения для формирования последующего поведения, в том числе для полного заражения цели и/или попытки конкретных действий."
    },
    "T1420": {
      "name": "Файл и каталог Discovery",
      "description": "Противники могут перечислить файлы и каталоги или искать в определенных местоположениях устройства необходимую информацию в файловой системе. Противники могут использовать информацию из [File and Directory Discovery] (https://attack.mitre.org/techniques/T1420) во время автоматического обнаружения для формирования последующего поведения, включая решение о том, должен ли противник полностью заразить цель и/или предпринять конкретные действия.\n\nНа Android разрешения на файлы Linux и политики SELinux обычно строго ограничивают доступ к приложениям, не воспользовавшись эксплойтом эскалации привилегий. Содержимое внешнего каталога хранения, как правило, видимо, что может представлять проблемы, если конфиденциальные данные хранятся там ненадлежащим образом. Архитектура безопасности iOS, как правило, ограничивает возможность выполнения любого типа файлов (https://attack.mitre.org/techniques/T1420) без использования расширенных привилегий."
    },
    "T1421": {
      "name": "Системные сетевые подключения Discovery",
      "description": "Противники могут попытаться получить список сетевых подключений к или от скомпрометированного устройства, к которому они в настоящее время обращаются, или от удаленных систем, запрашивая информацию по сети.\n\n\n\nЭто обычно достигается путем использования API устройств для сбора информации о близлежащих сетях, таких как Wi-Fi, Bluetooth и соединения сотовой вышки. На Android это можно сделать, запросив соответствующие API:\n\n\n\n«WifiInfo» для получения информации о текущем соединении Wi-Fi, а также о близлежащих сетях Wi-Fi. Запрос API «WiFiInfo» требует, чтобы приложение имело разрешение «ACCESS FINE LOCATION».\n\n«BluetoothAdapter» для информации об устройствах Bluetooth, которая также требует, чтобы приложение имело несколько разрешений, предоставленных пользователем во время выполнения.\n\nДля версий Android до Q приложения могут использовать метод «TelephonyManager.getNeighboringCellInfo()». Для Q и более поздних приложений можно использовать метод «TelephonyManager.getAllCellInfo()». Оба метода требуют, чтобы приложение имело разрешение ACCESS FINE LOCATION."
    },
    "T1422": {
      "name": "Системная сетевая конфигурация Discovery",
      "description": "Противники могут искать информацию о конфигурации и настройках сети, таких как IP-адреса и/или MAC-адреса устройств, к которым они обращаются, или путем обнаружения информации об удаленных системах.\n\nПротивники могут использовать информацию из [System Network Configuration Discovery] (https://attack.mitre.org/techniques/T1422) во время автоматического обнаружения для формирования последующего поведения, включая определение определенного доступа в целевой сети и действий, которые необходимо предпринять в дальнейшем.\n\nНа Android детали бортовых сетевых интерфейсов доступны приложениям через класс «java.net.NetworkInterface».(Citation: NetworkInterface) Ранее класс «TelephonyManager» Android можно было использовать для сбора идентификаторов устройств, связанных с телефонией, информации, такой как IMSI, IMEI и номер телефона. Однако, начиная с Android 10, только предварительно загруженные, оператор, SMS по умолчанию или приложения владельца устройства и профиля могут получить доступ к идентификаторам устройств, связанных с телефонией. (перенаправлено с «TelephonyManager»)\n\n\n\nНа iOS сбор информации о конфигурации сети невозможен без root-доступа.\n\n\n\nПротивники могут использовать информацию из [System Network Configuration Discovery] (https://attack.mitre.org/techniques/T1422) во время автоматического обнаружения для формирования последующего поведения, включая определение определенного доступа в целевой сети и действий, которые необходимо предпринять в дальнейшем."
    },
    "T1422.001": {
      "name": "Открытие подключения к Интернету",
      "description": "Противники могут проверить подключение к Интернету в скомпрометированных системах. Это может быть выполнено во время автоматического обнаружения и может быть выполнено различными способами, такими как использование «adb shell netstat» для Android.\n\nПротивники могут использовать результаты и ответы этих запросов, чтобы определить, способны ли мобильные устройства связываться с серверами C2, принадлежащими противнику, прежде чем пытаться подключиться к ним. Результаты также могут быть использованы для идентификации маршрутов, перенаправлений и прокси-серверов."
    },
    "T1422.002": {
      "name": "Wi-Fi Discovery",
      "description": "Противники могут искать информацию о сетях Wi-Fi, таких как имена сетей и пароли, в скомпрометированных системах. Противники могут использовать информацию Wi-Fi в рамках деятельности [Discovery] (https://attack.mitre.org/tactics/TA0032) или [Credential Access] (https://attack.mitre.org/tactics/TA0031) для поддержки как текущих, так и будущих кампаний."
    },
    "T1423": {
      "name": "Сканирование сетевых сервисов",
      "description": "Противники могут попытаться получить список служб, работающих на удаленных хостах, включая те, которые могут быть уязвимы для удаленной эксплуатации программного обеспечения. Способы получения этой информации включают сканирование портов и сканирование уязвимостей с мобильного устройства. Этот метод может использовать доступ мобильного устройства к внутренней корпоративной сети либо через локальное подключение, либо через виртуальную частную сеть (VPN)."
    },
    "T1424": {
      "name": "Процесс обнаружения",
      "description": "Противники могут попытаться получить информацию о запущенных процессах на устройстве. Полученная информация может быть использована для получения понимания общего программного обеспечения / приложений, работающих на устройствах в сети. Противники могут использовать информацию из [Process Discovery] (https://attack.mitre.org/techniques/T1424) во время автоматического обнаружения для формирования последующего поведения, включая то, полностью ли противник заражает цель и/или предпринимает конкретные действия.\n\n\n\nПоследние улучшения безопасности Android затрудняют получение списка запущенных процессов. В Android 7 и более поздних версиях приложения нет возможности получить список процессов без злоупотребления повышенными привилегиями. Это связано с тем, что ядро Android использует функцию скрытого крепления. До Android 7 приложения могли использовать команду «ps» или исследовать каталог «/proc» на устройстве.\n\n\n\nВ iOS приложения ранее могли использовать команду «sysctl» для получения списка запущенных процессов. Эта функция была удалена в более поздних версиях iOS."
    },
    "T1426": {
      "name": "Системная информация Discovery",
      "description": "Противники могут попытаться получить подробную информацию об операционной системе и оборудовании устройства, включая версии, патчи и архитектуру. Противники могут использовать информацию из [System Information Discovery] (https://attack.mitre.org/techniques/T1426) во время автоматического обнаружения для формирования последующего поведения, в том числе для полного заражения цели и/или попыток конкретных действий.\n\n\n\nНа Android большая часть этой информации программно доступна для приложений через Android.os. Постройте класс. (Цитирование: Android-Build) iOS гораздо более ограничена тем, какая информация видна приложениям. Как правило, приложения смогут запрашивать только модель устройства и какую версию iOS он запускает."
    },
    "T1428": {
      "name": "Эксплуатация удаленных услуг",
      "description": "Противники могут использовать удаленные сервисы корпоративных серверов, рабочих станций или других ресурсов для получения несанкционированного доступа к внутренним системам. Противники могут использовать удаленные службы, используя доступ мобильного устройства к внутренней корпоративной сети через локальное подключение или через виртуальную частную сеть (VPN). Использование уязвимости программного обеспечения происходит, когда противник использует ошибку программирования в программе, службе или в программном обеспечении операционной системы или самом ядре для выполнения кода, контролируемого противником. Общей целью посткомпромиссной эксплуатации удаленных служб является боковое перемещение для обеспечения доступа к удаленной системе.\n\nПротивнику может потребоваться определить, находится ли удаленная система в уязвимом состоянии, что может быть сделано с помощью [Network Service Scanning] (https://attack.mitre.org/techniques/T1423) или других методов Discovery. Они ищут общее, уязвимое программное обеспечение, которое может быть развернуто в сети, отсутствие определенных исправлений, которые могут указывать на уязвимости, или программное обеспечение безопасности, которое может использоваться для обнаружения или сдерживания удаленной эксплуатации. Серверы, вероятно, являются высококачественной мишенью для эксплуатации с боковым перемещением, но системы конечных точек также могут подвергаться риску, если они обеспечивают преимущество или доступ к дополнительным ресурсам.\n\nВ зависимости от уровня разрешений уязвимой удаленной службы противник может достичь [Эксплуатация для расширения привилегий] (https://attack.mitre.org/techniques/T1404) в результате эксплуатации бокового движения."
    },
    "T1429": {
      "name": "Аудио захват",
      "description": "Противники могут захватывать аудио для сбора информации, используя стандартные API операционной системы мобильного устройства. Примеры противников аудиоинформации могут включать в себя разговоры пользователей, окружение, телефонные звонки или другую конфиденциальную информацию.\n\n\n\nAndroid и iOS по умолчанию требуют, чтобы приложения запрашивали у пользователя доступ к микрофону устройства.\n\n\n\nНа устройствах Android приложения должны иметь разрешение «RECORD AUDIO» для доступа к микрофону или разрешение «CAPTURE AUDIO OUTPUT» для доступа к аудиовыходу. Поскольку Android не позволяет сторонним приложениям по умолчанию хранить разрешение «CAPTURE AUDIO OUTPUT», только привилегированные приложения, такие как те, которые распространяются Google или поставщиком устройств, могут получить доступ к аудиовыходу. Однако противники могут получить этот доступ после успешного повышения своих привилегий. С разрешения «CAPTURE AUDIO OUTPUT» противники могут пройти «MediaRecorder». Аудиоисточник. VOICE CALL' константа \"MediaRecorder.setAudioOutput\", позволяющая захватывать как голосовой вызов по восходящей, так и нисходящей линии связи.\n\n\n\nНа устройствах iOS приложения должны включать ключ «NSMicrophoneUsageDescription» в файл «Info.plist» для доступа к микрофону."
    },
    "T1430": {
      "name": "Отслеживание местоположения",
      "description": "Противники могут отслеживать физическое местоположение устройства с помощью стандартных API-интерфейсов операционной системы через вредоносные или эксплуатируемые приложения на скомпрометированном устройстве.\n\n\n\nНа Android приложения с разрешениями «ACCESS COAURSE LOCATION» или «ACCESS FINE LOCATION» предоставляют доступ к физическому местоположению устройства. На Android 10 и выше декларация разрешения «ACCESS BACKGROUND LOCATION» в манифесте приложения позволит приложениям запрашивать доступ к местоположению, даже когда приложение работает в фоновом режиме. (перенаправлено с «Android Request Location Permissions») Некоторые противники использовали интеграцию картографических служб Baidu для получения географического местоположения после получения разрешений на доступ к местоположению. (перенаправлено с «PaloAlto-SpyDealer») (перенаправлено с «Palo Alto HenBox»)\n\n\n\nВ iOS приложения должны включать клавиши «NSLocationWhenInUseUsageDescription», «NSLocationAlwaysAndWhenInUseUsageDescription» и/или «NSLocationAlwaysUsageDescription» в своем файле «Info.plist» в зависимости от степени запрашиваемого доступа к информации о местоположении.(Citation: Apple Request Authorization for Location Services) На iOS 8.0 и выше приложения вызывают «requestWhenInUseAuthorization()» для запроса доступа к информации о местоположении при использовании приложения или «requestAlwaysAuthorization()» для запроса доступа к информации о местоположении независимо от того, используется ли приложение. С повышенными привилегиями противник может получить доступ к данным о местоположении без явного согласия пользователя с ключом прав «com.apple.locationd.preauthorized»."
    },
    "T1430.001": {
      "name": "Услуги удаленного управления устройствами",
      "description": "Противник может использовать доступ к облачным сервисам (например, Google Android Device Manager или Apple iCloud Find my iPhone) или к серверной консоли управления корпоративной мобильностью (EMM) / управления мобильными устройствами (MDM) для отслеживания местоположения мобильных устройств, управляемых службой."
    },
    "T1430.002": {
      "name": "Олицетворение узлов SS7",
      "description": "Противники могут использовать отсутствие аутентификации в узлах сети сигнальной системы для отслеживания местоположения мобильных устройств, выдавая себя за узел. (Citation: Engel-SS7) (Citation: Engel-SS7-2008) (Citation: 3GPP-Security) (Citation: Positive-SS7) (Citation: CSRIC5-WG10-FinalReport)\n\n\n\nПредоставляя MSISDN жертвы (номер телефона) и выдавая себя за сетевые внутренние узлы для запроса информации абонента из других узлов, противники могут использовать данные, собранные из каждого прыжка, чтобы в конечном итоге определить географическую область сотовой связи устройства или ближайшую вышку сотовой связи."
    },
    "T1437": {
      "name": "Протокол уровня применения",
      "description": "Противники могут общаться, используя протоколы прикладного уровня, чтобы избежать обнаружения / фильтрации сети, смешиваясь с существующим трафиком. Команды на мобильное устройство и часто результаты этих команд будут встроены в протокольный трафик между мобильным устройством и сервером.\n\nПротивники могут использовать множество различных протоколов, включая те, которые используются для просмотра веб-страниц, передачи файлов, электронной почты или DNS."
    },
    "T1437.001": {
      "name": "Web протоколы",
      "description": "Противники могут общаться с использованием протоколов прикладного уровня, связанных с трафиком веб-протоколов, чтобы избежать обнаружения / фильтрации сети путем смешивания с существующим трафиком. Команды удаленных мобильных устройств и часто результаты этих команд будут встроены в протокольный трафик между мобильным клиентом и сервером.\n\nВеб-протоколы, такие как HTTP и HTTPS, используются для веб-трафика, а также службы уведомлений, нативные для мобильных служб обмена сообщениями, таких как Google Cloud Messaging (GCM) и недавно, Firebase Cloud Messaging (FCM), (GCM / FCM: двусторонняя связь) и служба уведомлений Apple Push (APNS; односторонний сервер-устройство). Такие службы уведомлений используют HTTP / S через соответствующий API и обычно злоупотребляют на Android и iOS соответственно, чтобы сочетаться с обычным трафиком устройств, что затрудняет проверку предприятий."
    },
    "T1451": {
      "name": "Своп SIM-карты",
      "description": "Противники могут получить доступ к мобильным устройствам через передачи или свопы с телефонных номеров жертв на SIM-карты и мобильные устройства, контролируемые противником. (Ситуация: ATT SIM Swap Scams)\n\nТипичный процесс заключается в следующем:\n\n1. Противники сначала собирают информацию о жертвах с помощью [Phishing] (https://attack.mitre.org/techniques/T1660), социальной инженерии, утечек данных или других средств.\n2. Противники затем выдают себя за жертв, когда они связываются с мобильными операторами, чтобы запросить свопы SIM. Например, противники будут предоставлять имя и адрес жертв мобильным операторам; после аутентификации противники будут запрашивать номера телефонов жертв для передачи на SIM-карты, контролируемые противником.\n3. После завершения операции жертвы теряют мобильные данные, такие как текстовые сообщения и телефонные звонки, на своих мобильных устройствах. В свою очередь, противники получат мобильные данные, которые предназначались для пострадавших.\n\nПротивники могут использовать перехваченные SMS-сообщения для входа в онлайн-аккаунты, которые используют аутентификацию на основе SMS. В частности, противники могут использовать аутентификацию на основе SMS для входа в банковские и / или криптовалютные счета, а затем переводить средства в кошельки, контролируемые противником."
    },
    "T1453": {
      "name": "Злоупотребление функциями доступности",
      "description": "Противники могут злоупотреблять функциями доступности на устройствах Android, чтобы украсть конфиденциальные данные и распространить вредоносное ПО на другие устройства. Функции доступности в Android предназначены для помощи пользователям с ограниченными возможностями, выполняя различные задачи, такие как использование блоков действий для управления лампочками и изменение пользовательского интерфейса устройства, такие как изменение размера шрифта и настройка контракта или цветов.\n\nОдним из примеров того, как противники злоупотребляют функциями доступности, является наложение объекта HTML, имитирующего законный экран входа в систему. Пользователь вводит свои учетные данные в наложенный HTML-объект, который затем отправляется противникам. (перенаправлено с «SahinSRLabs FluBot Dec2021»)\n\nДругим примером является вредоносная функция доступности, действующая как кейлоггер. Кейлоггер отслеживает изменения на полях EditText и отправляет их противникам. (перенаправлено с «SahinSRLabs FluBot Dec2021») Этот метод атаки также описан в [Keylogging] (https://attack.mitre.org/techniques/T1417/001); тогда как [Abuse Accessibility Features] (https://attack.mitre.org/techniques/T1453) фиксирует общее злоупотребление функциями доступности."
    },
    "T1456": {
      "name": "Drive-By Компромисс",
      "description": "Противники могут получить доступ к системе через пользователя, посещающего веб-сайт в ходе обычного просмотра. С помощью этого метода веб-браузер пользователя, как правило, предназначен для эксплуатации, но противники могут также использовать скомпрометированные веб-сайты для неэксплуатационного поведения, такого как приобретение [токена доступа к приложению] (https://attack.mitre.org/techniques/T1550/001).\n\nСуществует несколько способов доставки кода эксплойта в браузер, в том числе:\n\nЗаконный веб-сайт скомпрометирован, когда противники ввели некоторую форму вредоносного кода, такого как JavaScript, iFrames и межсайтовый скриптинг.\nВредоносная реклама оплачивается и обслуживается через законных поставщиков рекламы.\nВстроенные интерфейсы веб-приложений используются для вставки любого другого типа объекта, который может использоваться для отображения веб-контента или содержать скрипт, который выполняется на посещающем клиенте (например, сообщения на форуме, комментарии и другой контролируемый пользователем веб-контент).\n\nЧасто веб-сайт, используемый противником, посещается конкретным сообществом, таким как правительство, конкретная отрасль или регион, где цель состоит в том, чтобы скомпрометировать конкретного пользователя или набор пользователей на основе общего интереса. Этот вид целенаправленной атаки относится к стратегическому веб-компромиссу или атаке на водопой. Есть несколько известных примеров этого (цитата: Lookout-StealthMango).\n\nТипичный компромиссный процесс:\n\n1. Пользователь посещает веб-сайт, который используется для размещения контролируемого противником контента.\n2.Скрипты автоматически выполняются, как правило, для поиска версий браузера и плагинов для потенциально уязвимой версии.\n* Пользователю может потребоваться помощь в этом процессе путем включения сценариев или активных компонентов веб-сайта и игнорирования диалоговых окон.\n3.При обнаружении уязвимой версии код эксплойта доставляется в браузер.\n4.Если эксплуатация будет успешной, то она обеспечит выполнение кода противника в системе пользователя, если не будут созданы другие средства защиты.\nВ некоторых случаях требуется повторное посещение веб-сайта после первоначального сканирования, прежде чем будет доставлен код эксплойта."
    },
    "T1458": {
      "name": "Репликация через удаляемые носители",
      "description": "Противники могут перемещаться на устройства, используя или копируя вредоносные программы на устройства, подключенные через USB. В случае бокового перемещения противники могут использовать физическое подключение устройства к скомпрометированной или вредоносной зарядной станции или ПК, чтобы обойти требования магазина приложений и установить вредоносные приложения напрямую. (перенаправлено с «Lau-Mactans») В случае первоначального доступа противники могут попытаться использовать устройство через соединение, чтобы получить доступ к данным, хранящимся на устройстве. Примеры этого включают:\n\nИспользование небезопасных загрузчиков в устройстве Nexus 6 или 6P через USB и получение возможности выполнять действия, включая перехват телефонных звонков, перехват сетевого трафика и получение физического местоположения устройства.\nИспользование слабо усиленных границ безопасности в Android-устройствах, таких как Google Pixel 2 через USB.\nПродукты Cellebrite и Grayshift, которые могут эксплуатировать некоторые устройства iOS, используя физический доступ к порту данных для разблокировки пароля."
    },
    "T1461": {
      "name": "Скриншоты Bypass",
      "description": "Противник с физическим доступом к мобильному устройству может попытаться обойти экран блокировки устройства. Для этого существует несколько методов, в том числе:\n\nБиометрический спуфинг: если используется биометрическая аутентификация, противник может попытаться подделать механизм биометрической аутентификации мобильного устройства. И iOS, и Android частично смягчают эту атаку, требуя, чтобы пароль устройства, а не биометрические данные, разблокировали устройство после каждого перезапуска устройства и после установленного или случайного количества времени.\n* Обход кода разблокировки: противник может попытаться грубо заставить или иным образом угадать код доступа к экрану блокировки (обычно PIN-код или пароль), включая физическое наблюдение («серфинг плеча») использования владельцем устройства кода доступа к экрану блокировки. Продавцы мобильных ОС частично смягчают это, реализуя дополнительные таймеры обратного отключения после определенного количества неудачных попыток разблокировки, а также настраиваемую полную стирку устройства после нескольких неудачных попыток разблокировки.\nЭксплойт уязвимости: периодически демонстрируются методы использования мобильных устройств для обхода экрана блокировки. Уязвимости, как правило, исправляются поставщиком устройства или ОС после раскрытия. (цитата: Wired-AndroidBypass) (цитата: Kaspersky-iOSBypass)"
    },
    "T1464": {
      "name": "Сетевой отказ в обслуживании",
      "description": "Злоумышленники могут совершать атаки типа «Отказ в обслуживании сети» (DoS), чтобы ухудшить или заблокировать доступность целевых ресурсов для пользователей. Сетевая DoS может быть выполнена путем истощения пропускной способности сети, на которую полагаются службы, или путем подавления сигнала, идущего или идущего от устройств.\n\nСетевая DoS возникает, когда противник может заглушить радиосигналы (например, Wi-Fi, сотовая связь, GPS) вокруг устройства, чтобы предотвратить его связь. Например, чтобы заглушить сотовый сигнал, противник может использовать ручной помехой сигнала, который заклинивает устройства в рабочем диапазоне помех. (цитата: NIST-SP800187)\n\nИспользование помех сотовой связи было задокументировано в нескольких арестах, о которых сообщалось в новостях. (Citation: CNET-Celljammer) (Citation: NYTimes-Celljam) (Citation: Digitaltrends-Celljam) (Citation: Arstechnica-Celljam)"
    },
    "T1471": {
      "name": "Зашифрованные данные для Impact",
      "description": "Противник может шифровать файлы, хранящиеся на мобильном устройстве, чтобы предотвратить доступ пользователя к ним. Это может быть сделано для того, чтобы получить денежную компенсацию от жертвы в обмен на расшифровку или ключ расшифровки (вымогательство) или сделать данные постоянно недоступными в случаях, когда ключ не сохраняется или не передается."
    },
    "T1474": {
      "name": "Компромисс цепочки поставок",
      "description": "Противники могут манипулировать продуктами или механизмами доставки продуктов до получения конечным потребителем с целью компрометации данных или системы.\n\nКомпромисс в цепочке поставок может иметь место на любом этапе цепочки поставок, включая:\n\n* Манипулирование инструментами развития\n* Манипулирование средой развития\nМанипулирование репозиториями исходного кода (публичными или частными)\nМанипулирование исходным кодом в зависимостях с открытым исходным кодом\nМанипулирование механизмами обновления/распространения программного обеспечения\nКомпрометированные/инфицированные изображения системы\n* Замена законного программного обеспечения на модифицированные версии\nПродажи модифицированных/поддельных продуктов законным дистрибьюторам\n* Запрет на доставку\n\nВ то время как компрометация цепочки поставок может повлиять на любой компонент аппаратного или программного обеспечения, злоумышленники, желающие получить выполнение, часто сосредотачиваются на вредоносных дополнениях к законному программному обеспечению в каналах распространения или обновления программного обеспечения. Таргетинг может быть специфичным для желаемого набора жертв, или вредоносное программное обеспечение может быть распространено среди широкого круга потребителей, но только перейти к дополнительной тактике в отношении конкретных жертв. Популярные проекты с открытым исходным кодом, которые используются в качестве зависимостей во многих приложениях, также могут быть нацелены как средство добавления вредоносного кода пользователям зависимости, в частности, с широким использованием сторонних рекламных библиотек."
    },
    "T1474.001": {
      "name": "Компромиссные программные зависимости и инструменты разработки",
      "description": "Противники могут манипулировать продуктами или механизмами доставки продуктов до получения конечным потребителем с целью компрометации данных или системы. Приложения часто зависят от внешнего программного обеспечения для правильной работы. Популярные проекты с открытым исходным кодом, которые используются в качестве зависимостей во многих приложениях, могут быть нацелены как средство добавления вредоносного кода пользователям зависимости. (перенаправлено с «Grace-Advertisement»)"
    },
    "T1474.002": {
      "name": "Компромиссная цепочка поставок оборудования",
      "description": "Противники могут манипулировать аппаратными компонентами в продуктах до получения конечным потребителем с целью компрометации данных или системы. Изменяя оборудование или прошивку в цепочке поставок, противники могут вставить бэкдор в потребительские сети, который может быть трудно обнаружить и дать противнику высокую степень контроля над системой."
    },
    "T1474.003": {
      "name": "Компромиссная цепочка поставок программного обеспечения",
      "description": "Противники могут манипулировать прикладным программным обеспечением до получения конечным потребителем с целью компрометации данных или системы. Компромисс цепочки поставок программного обеспечения может иметь место несколькими способами, включая манипулирование исходным кодом приложения, манипулирование механизмом обновления / распространения для этого программного обеспечения или замену скомпилированных выпусков модифицированной версией."
    },
    "T1481": {
      "name": "Веб-сервис",
      "description": "Противники могут использовать существующий, законный внешний веб-сервис в качестве средства для передачи данных в / из скомпрометированной системы. Популярные сайты и социальные сети, выступающие в качестве механизма для C2, могут дать значительное количество прикрытия. Это связано с вероятностью того, что хосты в сети уже общаются с ними до компромисса. Использование общих сервисов, таких как те, которые предлагаются Google или Twitter, облегчает противникам прятаться в ожидаемом шуме. Поставщики веб-сервисов обычно используют шифрование SSL / TLS, предоставляя противникам дополнительный уровень защиты.\n\n\n\nИспользование веб-сервисов может также защитить серверную инфраструктуру C2 от обнаружения с помощью двоичного анализа вредоносных программ или обеспечить операционную устойчивость (поскольку эта инфраструктура может динамически изменяться)."
    },
    "T1481.001": {
      "name": "Обсуждение Dead Drop Resolver",
      "description": "Противники могут использовать существующий, законный внешний веб-сервис для размещения информации, которая указывает на дополнительную инфраструктуру командования и управления (C2). Противники могут размещать контент, известный как «решитель мертвой капли», на веб-сервисах со встроенными (и часто запутанными / закодированными) доменами или IP-адресами. После заражения жертвы будут обращаться к этим растворителям и перенаправлять их.\n\n\n\nПопулярные сайты и социальные сети, выступающие в качестве механизма для C2, могут дать значительное количество прикрытия. Это связано с вероятностью того, что хосты в сети уже общаются с ними до компромисса. Использование общих сервисов, таких как те, которые предлагаются Google или Twitter, облегчает противникам прятаться в ожидаемом шуме. Поставщики веб-сервисов обычно используют шифрование SSL / TLS, предоставляя противникам дополнительный уровень защиты.\n\n\n\nИспользование разрешителя мертвой капли также может защитить инфраструктуру C2 от обнаружения с помощью двоичного анализа вредоносных программ или обеспечить операционную устойчивость (поскольку эта инфраструктура может динамически изменяться)."
    },
    "T1481.002": {
      "name": "Двунаправленная коммуникация",
      "description": "Противники могут использовать существующий, законный внешний канал веб-сервиса в качестве средства для отправки команд и получения выводов из скомпрометированной системы. Компрометированные системы могут использовать популярные веб-сайты и социальные сети для размещения команд и команд (C2). Эти зараженные системы могут затем отправлять вывод из этих команд обратно по этому каналу веб-сервиса. Обратный трафик может происходить различными способами, в зависимости от используемого веб-сервиса. Например, обратный трафик может принимать форму скомпрометированной системы, размещающей комментарий на форуме, выдающей запрос на привлечение к проекту разработки, обновляющей документ, размещенный на веб-сервисе, или отправляющей твит.\n\n\n\nПопулярные сайты и социальные сети, выступающие в качестве механизма для C2, могут дать значительное количество прикрытия. Это связано с вероятностью того, что хосты в сети уже общаются с ними до компромисса. Использование общих сервисов, таких как те, которые предлагаются Google или Twitter, облегчает противникам прятаться в ожидаемом шуме. Поставщики веб-сервисов обычно используют шифрование SSL / TLS, предоставляя противникам дополнительный уровень защиты."
    },
    "T1481.003": {
      "name": "Одностороннее общение",
      "description": "Противники могут использовать существующий, законный внешний канал веб-сервиса в качестве средства для отправки команд в скомпрометированную систему без получения обратного вывода. Компрометированные системы могут использовать популярные веб-сайты и социальные сети для размещения команд и команд (C2). Эти зараженные системы могут выбрать отправку вывода из этих команд обратно по другому каналу C2, в том числе в другой отдельный веб-сервис. В качестве альтернативы, скомпрометированные системы могут вообще не возвращать никакой продукции в тех случаях, когда противники хотят отправлять инструкции системам и не хотят ответа.\n\n\n\nПопулярные сайты и социальные сети, выступающие в качестве механизма для C2, могут дать значительное количество прикрытия. Это связано с вероятностью того, что хосты в сети уже общаются с ними до компромисса. Использование общих сервисов, таких как те, которые предлагаются Google или Twitter, облегчает противникам прятаться в ожидаемом шуме. Поставщики веб-сервисов обычно используют шифрование SSL / TLS, предоставляя противникам дополнительный уровень защиты."
    },
    "T1509": {
      "name": "Нестандартный порт",
      "description": "Противники могут генерировать сетевой трафик, используя протокол и сопряжение портов, которые обычно не связаны. Например, HTTPS через порт 8088 или порт 587 в отличие от традиционного порта 443. Противники могут вносить изменения в стандартный порт, используемый протоколом для обхода фильтрации или анализа / анализа сетевых данных."
    },
    "T1512": {
      "name": "Видеозахват",
      "description": "Противник может использовать камеры устройства для сбора информации, захватывая видеозаписи. Изображения также могут быть захвачены, потенциально через определенные интервалы, вместо видеофайлов.\n\n\n\nВредоносные программы или скрипты могут взаимодействовать с камерами устройства через доступный API, предоставляемый операционной системой. Файлы видео или изображений могут быть записаны на диск и удалены позже. Этот метод отличается от [Screen Capture] (https://attack.mitre.org/techniques/T1513) из-за использования камер устройства для видеозаписи, а не захвата экрана жертвы.\n\n\n\nВ Android приложение должно содержать «android.permission». Разрешение CAMERA на доступ к камерам. В iOS приложения должны включать ключ «NSCameraUsageDescription» в файле «Info.plist». В обоих случаях пользователь должен предоставить разрешение запрашивающему приложению на использование камеры. Если устройство было укоренено или взломано, противник может получить доступ к камере без ведома пользователя."
    },
    "T1513": {
      "name": "Захват экрана",
      "description": "Противники могут использовать захват экрана для сбора дополнительной информации о целевом устройстве, такой как приложения, работающие на переднем плане, пользовательские данные, учетные данные или другая конфиденциальная информация. Приложения, работающие в фоновом режиме, могут захватывать скриншоты или видео другого приложения, работающего на переднем плане, с помощью Android «MediaProjectionManager» (как правило, требует согласия пользователя устройства). (Citation: Fortinet screencap July 2019) (Citation: Android ScreenCap1 2019) Фоновые приложения также могут использовать службы доступности Android для захвата содержимого экрана, отображаемого приложением переднего плана. (Citation: Lookout-Monokle) Противник с корневым доступом или доступом к Android Debug Bridge (adb) может называть команды Android «screencap» или «screenrecord» (Citation: Android ScreenCap2 2019) (Citation: Trend Micro ScreenCap July 2015)"
    },
    "T1516": {
      "name": "Вводная инъекция",
      "description": "Вредоносное приложение может вводить в пользовательский интерфейс для имитации взаимодействия с пользователем через злоупотребление API-интерфейсами доступности Android.\n\n[Инъекция ввода] (https://attack.mitre.org/techniques/T1516) может быть достигнута с использованием любого из следующих методов:\n\n* Имитация кликов пользователя на экране, например, чтобы украсть деньги со счета пользователя PayPal. (цитата: Android-trojan-steals-paypal-2fa)\nВнедрение глобальных действий, таких как «GLOBAL ACTION BACK» (программно имитируя нажатие физической кнопки «назад»), для инициирования действий от имени пользователя.\n* Вставка ввода в текстовые поля от имени пользователя. Этот метод законно используется для автоматического заполнения текстовых полей приложениями, такими как менеджеры паролей. (перенаправлено с «Bitwarden Autofill Logins»)"
    },
    "T1517": {
      "name": "Уведомления о доступе",
      "description": "Противники могут собирать данные в рамках уведомлений, отправляемых операционной системой или другими приложениями. Уведомления могут содержать конфиденциальные данные, такие как одноразовые коды аутентификации, отправленные через SMS, электронную почту или другие носители. В случае Credential Access противники могут попытаться перехватить одноразовый код, отправленный на устройство. Противники также могут отклонять уведомления, чтобы пользователь не заметил, что уведомление прибыло, и могут запускать кнопки действий, содержащиеся в уведомлениях. (перенаправлено с «ESET 2FA Bypass»)"
    },
    "T1521": {
      "name": "Зашифрованный канал",
      "description": "Противники могут явно использовать известный алгоритм шифрования для сокрытия командного и управляющего трафика, а не полагаться на какие-либо неотъемлемые защиты, предоставляемые протоколом связи. Несмотря на использование безопасного алгоритма, эти реализации могут быть уязвимы для обратной разработки, если секретные ключи кодируются и/или генерируются в образцах/конфигурационных файлах вредоносного ПО."
    },
    "T1521.001": {
      "name": "Симметричная криптография",
      "description": "Противники могут использовать известный алгоритм симметричного шифрования для сокрытия командного и управляющего трафика, а не полагаться на какие-либо встроенные защиты, предоставляемые протоколом связи. Алгоритмы симметричного шифрования используют один и тот же ключ для шифрования открытого текста и расшифровки шифрованного текста. Общие алгоритмы симметричного шифрования включают AES, Blowfish и RC4."
    },
    "T1521.002": {
      "name": "Асимметричная криптография",
      "description": "Противники могут использовать известный алгоритм асимметричного шифрования для сокрытия командного и управляющего трафика, а не полагаться на какие-либо неотъемлемые защиты, предоставляемые протоколом связи. Асимметричная криптография, также известная как криптография с открытым ключом, использует ключевую пару для каждой стороны: одну публичную, которая может быть свободно распределена, и одну частную, которая не должна распространяться. Из-за того, как работают асимметричные алгоритмы, отправитель шифрует данные с помощью открытого ключа приемника, а приемник расшифровывает данные с помощью своего закрытого ключа. Это гарантирует, что только предполагаемый получатель может прочитать зашифрованные данные. Общие алгоритмы шифрования с открытым ключом включают RSA, ElGamal и ECDSA.\n\nДля эффективности многие протоколы (включая SSL/TLS) используют симметричную криптографию после установления соединения, но используют асимметричную криптографию для установления или передачи ключа. Таким образом, эти протоколы классифицируются как [Asymmetric Cryptography] (https://attack.mitre.org/techniques/T1521/002)."
    },
    "T1521.003": {
      "name": "SSL Pinning",
      "description": "Противники могут использовать [SSL Pinning] (https://attack.mitre.org/techniques/T1521/003) для защиты трафика C2 от перехвата и анализа.\n\n[SSL Pinning] (https://attack.mitre.org/techniques/T1521/003) - это метод, обычно используемый законными веб-сайтами для обеспечения того, чтобы зашифрованные сообщения разрешались только с заранее определенным сертификатом. Если представлен другой сертификат, он может указывать на компрометацию устройства, перехват трафика или другую проблему. Хотя доброкачественное использование является обычным явлением, противники могут злоупотреблять этой технологией для защиты вредоносного трафика C2.\n\nПри обычной, не прикрепленной проверке SSL, когда клиент подключается к серверу с использованием HTTPS, он обычно проверяет, подписан ли сертификат SSL / TLS сервера доверенным органом по сертификации (CA) в доверительном хранилище устройства. Если сертификат действителен и подписан доверенным ЦА, соединение устанавливается. Тем не менее, с помощью [SSL Pinning] (https://attack.mitre.org/techniques/T1521/003) клиент настроен доверять определенному сертификату SSL/TLS или открытому ключу, а не полагаться на трастовый магазин устройства. Это означает, что даже если сертификат сервера подписан доверенным ЦА, клиент установит только соединение сертификата или ключ прикреплен.\n\nСуществует два типа [SSL Pinning] (https://attack.mitre.org/techniques/T1521/003):\n\n1. Certificate Pinning: клиент хранит копию сертификата сервера и сравнивает ее с сертификатом, полученным во время рукопожатия SSL. Если сертификаты совпадают, то клиент приступает к подключению. Этот подход также работает с самоподписанными сертификатами.\n\n2. Пиннинг с открытым ключом: вместо того, чтобы прикреплять весь сертификат, клиент прикрепляет только открытый ключ, извлеченный из сертификата. Это часто более гибко, так как позволяет серверу обновлять свой сертификат без необходимости обновления прикрепленного сертификата или нарушения соединения SSL."
    },
    "T1532": {
      "name": "Архив собранных данных",
      "description": "Противники могут сжимать и/или шифровать данные, собранные до эксфильтрации. Сжатие данных может помочь запутать их содержимое и минимизировать использование сетевых ресурсов. Шифрование может быть использовано, чтобы скрыть информацию, которая выводится из обнаружения или сделать выведение менее заметным при проверке защитником.\n\n\n\nКак сжатие, так и шифрование выполняются до эксфильтрации и могут быть выполнены с использованием утилиты, библиотеки программирования или пользовательского алгоритма."
    },
    "T1533": {
      "name": "Данные из локальной системы",
      "description": "Противники могут искать локальные системные источники, такие как файловые системы или локальные базы данных, чтобы найти интересующие файлы и конфиденциальные данные до эксфильтрации.\n\n\n\nДоступ к локальным системным данным, которые включают в себя информацию, хранящуюся в операционной системе, часто требует повышенных привилегий. Примеры локальных системных данных включают токены аутентификации, кэш клавиатуры устройства, пароли Wi-Fi и фотографии. На Android противники могут также попытаться получить доступ к файлам из внешнего хранилища, что может потребовать дополнительных разрешений на хранение."
    },
    "T1541": {
      "name": "На переднем плане настойчивость",
      "description": "Противники могут злоупотреблять API-методом Android StartForeground() для поддержания постоянного доступа к датчикам. Начиная с Android 9, простаивающие приложения, работающие в фоновом режиме, больше не имеют доступа к датчикам устройств, таким как камера, микрофон и гироскоп. (цитата: Android-SensorsOverview) Приложения могут сохранять доступ к датчикам, работая на переднем плане, используя метод API Android «startForeground()». Это информирует систему о том, что пользователь активно взаимодействует с приложением, и его не следует убивать. Единственным требованием для запуска службы переднего плана является постоянное уведомление пользователя.\n\nВредоносные приложения могут злоупотреблять методом API «startForeground()» для продолжения работы на переднем плане, одновременно представляя уведомление пользователю, притворяющемуся подлинным приложением. Это позволит получить беспрепятственный доступ к датчикам устройства, если ранее разрешение было предоставлено. (перенаправлено с «BlackHat Sutter Android Foreground 2019»)\n\nВредоносные приложения могут также злоупотреблять API StartForeground() для информирования системы Android о том, что пользователь активно взаимодействует с приложением, тем самым предотвращая его уничтожение убийцей с низкой памятью."
    },
    "T1544": {
      "name": "Трансфер инструментов Ingress",
      "description": "Противники могут передавать инструменты или другие файлы из внешней системы на скомпрометированное устройство для облегчения последующих действий. Файлы могут быть скопированы из внешней системы, контролируемой противником, через канал командования и управления или через альтернативные протоколы с другим инструментом, таким как FTP."
    },
    "T1575": {
      "name": "Нативный API",
      "description": "Противники могут использовать Android Native Development Kit (NDK) для написания нативных функций, которые могут выполнять двоичные файлы или функции. Как и системные вызовы в традиционной настольной операционной системе, нативный код выполняется на более низком уровне, чем обычные вызовы Android SDK.\n\nNDK позволяет разработчикам писать собственный код на C или C++, который компилируется непосредственно в машинный код, избегая всех промежуточных языков и этапов компиляции, которые обычно имеют языки более высокого уровня, такие как Java. Java Native Interface (JNI) - это компонент, который позволяет функциям Java в приложении Android вызывать функции в родной библиотеке. (перенаправлено с «Google NDK Getting Started»)\n\nПротивники могут также использовать нативные функции для выполнения вредоносного кода, поскольку нативные действия, как правило, гораздо сложнее анализировать, чем стандартное поведение. (перенаправлено с «MITRE App Vetting Effectiveness»)"
    },
    "T1577": {
      "name": "Компромиссное приложение Excutable",
      "description": "Противники могут изменять приложения, установленные на устройстве, чтобы установить постоянный доступ к жертве. Эти вредоносные модификации могут использоваться для того, чтобы законные приложения выполняли задачи противника, когда эти приложения используются.\n\nСуществует несколько способов, которыми противник может вводить вредоносный код в приложения. Одним из методов является использование уязвимостей устройства, наиболее известной из которых является Janus, уязвимость Android, которая позволяет противникам добавлять дополнительные байты в файлы APK (приложение) и DEX (исполняемый) без ущерба для подписи файла. Имея возможность добавлять произвольные байты в действительные приложения, злоумышленники могут легко вводить код в подлинные исполняемые файлы без ведома пользователя. (перенаправлено с «Hardsquare Janus»)\n\nПротивники могут также перестраивать приложения, чтобы включить вредоносные модификации. Это может быть достигнуто путем декомпилирования подлинного приложения, объединения его с вредоносным кодом и его повторной компиляции. (перенаправлено с «CheckPoint Agent Smith»)\n\nПротивники могут также принимать меры для сокрытия изменений в исполняемых файлах приложений и обхода согласия пользователя. Эти действия включают в себя изменение модификаций для появления в качестве обновления или использования уязвимостей, которые позволяют действиям вредоносного приложения работать внутри системного приложения."
    },
    "T1582": {
      "name": "SMS контроль",
      "description": "Противники могут удалять, изменять или отправлять SMS-сообщения без разрешения пользователя. Это может быть использовано для сокрытия SMS-сообщений C2, распространения вредоносных программ или различных внешних эффектов.\n\nЭто может быть достигнуто путем запроса разрешений «RECEIVE SMS» или «SEND SMS» в зависимости от того, что пытается сделать вредоносное ПО. Если приложение установлено в качестве обработчика SMS по умолчанию на устройстве, можно зарегистрировать намерение трансляции «SMS DELIVER», что позволяет приложению писать поставщику контента SMS. Поставщик контента непосредственно модифицирует базу данных сообщений на устройстве, что может позволить вредоносным приложениям с этой возможностью вставлять, изменять или удалять произвольные сообщения на устройстве."
    },
    "T1603": {
      "name": "Запланированная работа/задача",
      "description": "Противники могут злоупотреблять функциональностью планирования задач для облегчения первоначального или повторяющегося выполнения вредоносного кода. На Android и iOS существуют API и библиотеки для облегчения выполнения задач планирования в определенную дату, время или интервал.\n\nНа Android API WorkManager позволяет планировать асинхронные задачи с системой. «WorkManager» был введен для унификации планирования задач на Android, используя «JobScheduler», «GcmNetworkManager» и «AlarmManager» внутри. WorkManager предлагает большую гибкость для планирования, в том числе периодически, один раз или на основе ограничений (например, только когда устройство заряжается).\n\nВ iOS API «NSBackgroundActivityScheduler» позволяет планировать асинхронные задачи с системой. Задачи могут быть запланированы на повторение или неповторение, однако система выбирает, когда задачи будут выполнены. Приложение может выбрать интервал для повторения задач или задержку между планированием и выполнением разовых задач. (перенаправлено с «Apple NSBackgroundActivityScheduler»)"
    },
    "T1604": {
      "name": "Прокси через жертву",
      "description": "Противники могут использовать скомпрометированное устройство в качестве прокси-сервера в Интернете. Используя прокси-сервер, противники скрывают истинный IP-адрес своего сервера C2 и связанную с ним инфраструктуру от назначения сетевого трафика. Это маскирует трафик противника как законный трафик, исходящий от скомпрометированного устройства, которое может уклоняться от ограничений на основе IP и предупреждений о некоторых услугах, таких как банковские счета и веб-сайты социальных сетей. (перенаправлено с « Threat Fabric Exobot»)\n\nНаиболее распространенным типом прокси является прокси SOCKS. Обычно он может быть реализован с использованием стандартных API на уровне ОС и 3-х сторонних библиотек без указания пользователю. На Android противники могут использовать API «Proxy» для программного установления прокси-соединения SOCKS или API более низкого уровня для непосредственного взаимодействия с исходными розетками."
    },
    "T1616": {
      "name": "Контроль звонков",
      "description": "Противники могут совершать, передавать или блокировать телефонные звонки без разрешения пользователя. Это может быть использовано для целей противника, таких как аудионаблюдение, блокировка или переадресация вызовов от владельца устройства или связь C2.\n\nДля программного управления телефонными звонками могут использоваться несколько разрешений, в том числе:\n\n* «ANSWER PHONE CALLS» - позволяет приложению отвечать на входящие телефонные звонки (цитата: Разрешения Android)\n«CALL PHONE» - позволяет приложению инициировать телефонный звонок без использования интерфейса Dialer (Citation: Android Permissions)\n* «PROCESS OUTGOING CALLS» - позволяет приложению видеть номер, набранный во время исходящего вызова, с возможностью перенаправить вызов на другой номер или вообще прервать вызов (Citation: Android Permissions)\n* «MANAGE OWN CALLS» - Позволяет вызывающему приложению управлять своими собственными вызовами через самоуправляемые API-интерфейсы «ConnectionService»\n* \"BIND TELECOM CONNECTION SERVICE\" - Требуемое разрешение при использовании \"ConnectionService\" (Citation: Android Permissions)\n* «WRITE CALL LOG» - позволяет приложению записывать в журнал вызовов устройства, потенциально скрывая вредоносные телефонные звонки (Citation: Android Permissions)\n\nПри предоставлении некоторых из этих разрешений приложение может сделать телефонный звонок, не открывая номер телефона. Однако, если приложение хочет просто перенаправить пользователя на телефонный номер с заполненным номером телефона, оно может запустить намерение, используя намерение. ACTION DIAL, не требующий специального разрешения. Затем пользователь должен явно инициировать вызов или использовать некоторую форму [Input Injection] (https://attack.mitre.org/techniques/T1516), чтобы программно инициировать его."
    },
    "T1617": {
      "name": "крюк",
      "description": "Противники могут использовать крючок, чтобы скрыть наличие артефактов, связанных с их поведением, чтобы избежать обнаружения. Хукинг может использоваться для изменения значений возврата или структур данных системных API и вызовов функций. Этот процесс обычно включает в себя использование корневых фреймворков 3-й стороны, таких как Xposed или Magisk, с эксплойтом системы или ранее существовавшим корневым доступом. Включая пользовательские модули для корневых фреймворков, противники могут подключать системные API и изменять возвращаемое значение и/или структуры системных данных для изменения функциональности/видимости различных аспектов системы."
    },
    "T1623": {
      "name": "Командный и письменный переводчик",
      "description": "Противники могут злоупотреблять командами и интерпретаторами сценариев для выполнения команд, сценариев или двоичных файлов. Эти интерфейсы и языки обеспечивают способы взаимодействия с компьютерными системами и являются общей особенностью на многих различных платформах. Большинство систем поставляются со встроенным интерфейсом командной строки и возможностями сценариев, например, Android является UNIX-подобной ОС и включает в себя базовую [Unix Shell] (https://attack.mitre.org/techniques/T1623/001), доступ к которой можно получить через Android Debug Bridge (ADB) или пакет Java 'Runtime'.\n\nПротивники могут использовать эти технологии различными способами для выполнения произвольных команд. Команды и скрипты могут быть встроены в полезные нагрузки [Initial Access] (https://attack.mitre.org/tactics/TA0027), доставляемые жертвам в качестве заманивающих документов или в качестве вторичных полезных нагрузок, загруженных с существующего C2. Противники могут также выполнять команды через интерактивные терминалы/оболочки."
    },
    "T1623.001": {
      "name": "Unix Shell",
      "description": "Противники могут злоупотреблять командами оболочки Unix и скриптами для выполнения. Оболочки Unix являются основными командными подсказками на устройствах Android и iOS. Оболочки Unix могут управлять каждым аспектом системы с определенными командами, требующими повышенных привилегий, которые доступны только в том случае, если устройство укоренено или взломано.\n\nОболочки Unix также поддерживают скрипты, которые позволяют последовательно выполнять команды, а также другие типичные операции программирования, такие как условия и циклы. Обычное использование сценариев оболочки включает в себя длинные или повторяющиеся задачи или необходимость запуска одного и того же набора команд на нескольких системах.\n\nПротивники могут использовать оболочки Unix для выполнения различных команд или полезной нагрузки. Интерактивные оболочки могут быть доступны через каналы управления или во время бокового движения, например, с помощью SSH. Противники могут также использовать сценарии оболочки для доставки и выполнения нескольких команд на жертвах или в составе полезных нагрузок, используемых для сохранения.\n\nЕсли устройство было укоренено или взломано, противники могут найти и вызвать двоичный код суперпользователя, чтобы повысить свои привилегии и взаимодействовать с системой в качестве пользователя корня. Этот опасный уровень разрешений позволяет противнику запускать специальные команды и изменять защищенные системные файлы."
    },
    "T1624": {
      "name": "Событие, спровоцировавшее казнь",
      "description": "Противники могут установить устойчивость, используя системные механизмы, которые запускают выполнение на основе конкретных событий. Мобильные операционные системы имеют средства для подписки на такие события, как получение SMS-сообщения, завершение загрузки устройства или другие действия устройства.\n\nПротивники могут злоупотреблять этими механизмами как средством поддержания постоянного доступа к жертве посредством автоматического и многократного выполнения вредоносного кода. После получения доступа к системе жертвы противники могут создавать или изменять триггеры событий, чтобы указать на вредоносный контент, который будет выполняться всякий раз, когда вызывается триггер события."
    },
    "T1624.001": {
      "name": "Трансляционные приемники",
      "description": "Противники могут установить устойчивость, используя системные механизмы, которые запускают выполнение на основе конкретных событий. Мобильные операционные системы имеют средства для подписки на такие события, как получение SMS-сообщения, завершение загрузки устройства или другие действия устройства.\n\nНамерение — это сообщение, передаваемое между приложениями Android или компонентами системы. Приложения могут зарегистрироваться для приема намерений трансляции во время выполнения, которые являются общесистемными намерениями, доставляемыми в каждое приложение, когда на устройстве происходят определенные события, такие как изменения в сети или разблокировка экрана пользователем. Вредоносные приложения могут затем инициировать определенные действия в приложении, на основе которых было получено намерение трансляции.\n\nВ дополнение к намерениям системы Android, вредоносные приложения могут регистрироваться для намерений, транслируемых другими приложениями. Это позволяет вредоносному ПО реагировать на основе действий в других приложениях. Такое поведение обычно указывает на более глубокие знания или потенциально нацеливание на конкретные устройства, пользователей или приложения.\n\nВ Android 8 (уровень API 26) поведение намерения трансляции было изменено, что ограничило скрытые намерения, которые приложения могут зарегистрировать в манифесте. В большинстве случаев приложения, которые регистрируются через манифест, больше не будут получать трансляции. Теперь приложения должны регистрировать контекстно-специфические приемники вещания, пока пользователь активно использует приложение."
    },
    "T1625": {
      "name": "Поток исполнения Hijack",
      "description": "Противники могут выполнять свои собственные вредоносные полезные нагрузки, захватывая способ, которым операционные системы запускают приложения. Поток выполнения угона может быть для целей сохранения, поскольку это угнанное исполнение может повторяться с течением времени.\n\nЕсть много способов, которыми противник может захватить поток казни. Основной способ заключается в манипулировании тем, как операционная система находит программы для выполнения. Также может быть перехвачено то, как операционная система находит библиотеки, используемые программой. Места, где операционная система ищет программы или ресурсы, такие как каталоги файлов, также могут быть отравлены вредоносными полезными нагрузками."
    },
    "T1625.001": {
      "name": "Системный Runtime API Hijacking",
      "description": "Противники могут выполнять свои собственные вредоносные полезные нагрузки, захватывая способ запуска приложений операционной системой. Поток выполнения угона может быть для целей сохранения, поскольку это угнанное исполнение может повториться в более поздние моменты времени.\n\n\nНа Android противники могут перезаписать стандартную библиотеку API ОС с помощью вредоносной альтернативы для подключения к основным функциям для достижения устойчивости. При этом код противника будет выполняться каждый раз, когда перезаписанная функция API вызывается приложением на зараженном устройстве."
    },
    "T1626": {
      "name": "Механизм контроля за превышением",
      "description": "Противники могут обойти механизмы, предназначенные для контроля над повышенными привилегиями, чтобы получить разрешения более высокого уровня. Большинство современных систем содержат собственные механизмы контроля высоты, которые предназначены для ограничения привилегий, которые пользователь может получить на машине. Разрешение должно быть предоставлено конкретным пользователям для выполнения задач, которые считаются более рискованными. Противник может использовать несколько методов, чтобы воспользоваться встроенными механизмами управления, чтобы увеличить привилегии в системе."
    },
    "T1626.001": {
      "name": "Разрешения администратора устройства",
      "description": "Противники могут злоупотреблять API администрирования устройств Android, чтобы получить более высокий уровень контроля над устройством. Злоупотребляя API, противники могут выполнить несколько гнусных действий, таких как сброс пароля устройства для [Endpoint Denial of Service] (https://attack.mitre.org/techniques/T1642), заводской сброс устройства для [File Deletion] (https://attack.mitre.org/techniques/T1630/002) и удалить любые следы вредоносного ПО, отключить все камеры устройства или затруднить удаление приложения.\n\nАдминистраторы устройств должны быть одобрены пользователем во время выполнения, при этом всплывающее окно системы показывает, какие действия были запрошены приложением. В сочетании с другими методами, такими как [Input Injection] (https://attack.mitre.org/techniques/T1516), приложение может программно предоставлять себе права администратора без какого-либо пользовательского ввода."
    },
    "T1627": {
      "name": "Охранные рельсы",
      "description": "Противники могут использовать ограждения исполнения для ограничения выполнения или действий, основанных на поставляемых противником и конкретных условиях окружающей среды, которые, как ожидается, будут присутствовать на цели. Охранные рельсы гарантируют, что полезная нагрузка выполняется только против намеченной цели и уменьшает побочный ущерб от кампании противника. Значения, которые противник может предоставить о целевой системе или среде для использования в качестве ограждений, могут включать в себя информацию об окружающей среде, такую как местоположение.\n\nОграждения могут использоваться для предотвращения воздействия возможностей в средах, которые не предназначены для компрометации или эксплуатации внутри. Это использование ограждений отличается от типичных [системных проверок] (https://attack.mitre.org/techniques/T1633/001). Хотя использование [System Checks] (https://attack.mitre.org/techniques/T1633/001) может включать проверку известных значений песочницы и продолжение выполнения только в случае отсутствия соответствия, использование ограждений будет включать проверку ожидаемого целевого значения и продолжение выполнения только при наличии такого соответствия."
    },
    "T1627.001": {
      "name": "ограждение",
      "description": "Противники могут использовать географическое положение устройства для ограничения определенных вредоносных действий. Например, операторы вредоносных программ могут ограничивать распространение полезной нагрузки второго этапа в определенных географических регионах. (перенаправлено с «Lookout eSurv»)\n\n[Geofencing] (https://attack.mitre.org/techniques/T1627/001) достигается путем убеждения пользователя предоставить разрешение приложения на доступ к службам определения местоположения. Затем приложение может собирать, обрабатывать и эксфильтрировать местоположение устройства для выполнения действий, основанных на местоположении, таких как прекращение вредоносного поведения или показ рекламных объявлений для конкретных регионов.\n\nОдним из способов выполнения [Geofencing] (https://attack.mitre.org/techniques/T1627/001) на Android является использование встроенного API Geofencing для автоматического запуска определенных действий, когда устройство входит или выходит из заданного радиуса вокруг географического местоположения. Подобно другим методам [Geofencing] (https://attack.mitre.org/techniques/T1627/001), это требует, чтобы пользователь предоставил разрешения «ACCESS FINE LOCATION» и «ACCESS BACKGROUND LOCATION». Последнее требуется только в том случае, если приложение нацелено на Android 10 (уровень API 29) или выше. Тем не менее, Android 11 ввел дополнительные элементы управления разрешениями, которые могут ограничивать сбор фонового местоположения на основе выбора разрешения пользователя во время выполнения. Эти дополнительные элементы управления включают «Разрешить только при использовании приложения», что фактически запрещает сбор фонового местоположения.\n\nАналогично, на iOS разработчики могут использовать встроенные API для настройки и выполнения геозоны. В зависимости от случая использования, приложение будет либо вызывать «requestWhenInUseAuthorization()», либо «requestAlwaysAuthorization()», в зависимости от того, когда требуется доступ к службам определения местоположения. Подобно Android, пользователи также имеют возможность ограничить, когда приложение может получить доступ к местоположению устройства, включая одноразовое использование и только когда приложение работает на переднем плане.\n\n[Geofencing] (https://attack.mitre.org/techniques/T1627/001) может использоваться для предотвращения воздействия возможностей в средах, которые не предназначены для компрометации или эксплуатации внутри. Например, данные о местоположении могут использоваться для ограничения распространения и/или возможностей вредоносных программ, что также может потенциально уклоняться от среды анализа приложений (например, анализ вредоносных программ за пределами целевой географической области). Другие злонамеренные использования могут включать в себя отображение языковых подсказок ввода и / или рекламы."
    },
    "T1628": {
      "name": "Скрыть артефакты",
      "description": "Противники могут попытаться скрыть артефакты, связанные с их поведением, чтобы избежать обнаружения. Мобильные операционные системы имеют функции и API для разработчиков, чтобы скрыть различные артефакты, такие как значок запуска приложения. Эти API имеют законные применения, такие как скрытие значка, чтобы избежать беспорядка в ящике приложения, когда приложение не имеет полезного интерфейса. Противники могут злоупотреблять этими функциями и API, чтобы скрыть артефакты от пользователя, чтобы избежать обнаружения."
    },
    "T1628.001": {
      "name": "Подавить Application Icon",
      "description": "Вредоносное приложение может подавлять отображение своего значка пользователю в пусковой установке приложения. Это скрывает тот факт, что он установлен, и может затруднить пользователю удаление приложения. Скрытие значка приложения программно не требует каких-либо специальных разрешений.\n\nТакое поведение было замечено в семействе вредоносных программ BankBot/Spy Banker.(Citation: android-trojan-steals-paypal-2fa)(Citation: sunny-stolen-credentials)(Citation: bankbot-spybanker)\n\nНачиная с Android 10, были внесены изменения, чтобы препятствовать способности вредоносных приложений скрывать свой значок. Если приложение является системным приложением, не запрашивает никаких разрешений или не имеет активности запуска, значок приложения будет полностью скрыт. Кроме того, если устройство полностью управляется или приложение находится в рабочем профиле, значок будет полностью скрыт. В противном случае показана синтезированная активность, которая представляет собой значок пусковой установки, который представляет страницу деталей приложения в настройках системы. Если пользователь нажимает на синтезированную активность в пусковой установке, они попадают на страницу деталей приложения в настройках системы. (перенаправлено с «Android 10 Limitations to Hiding App Icons») (Citation: LauncherApps getActivity) Список"
    },
    "T1628.002": {
      "name": "Уклонение пользователя",
      "description": "Противники могут попытаться избежать обнаружения, скрывая вредоносное поведение от пользователя. Делая это, модификации противника, скорее всего, будут оставаться на устройстве дольше, позволяя противнику продолжать работать на этом устройстве.\n\nНесмотря на то, что существует множество способов достижения этой цели, одним из способов является использование датчиков устройства. Используя различные датчики движения на устройстве, такие как акселерометр или гироскоп, приложение может обнаружить, что устройство взаимодействует. Таким образом, приложение может продолжать работать, пока устройство не используется, но перестать работать, пока пользователь использует устройство, скрывая все, что указывает на вредоносную активность. Доступ к датчикам таким образом не требует каких-либо разрешений от пользователя, поэтому он будет полностью прозрачным."
    },
    "T1628.003": {
      "name": "Скрывать мультимедийные файлы",
      "description": "Противники могут попытаться скрыть мультимедийные файлы от пользователя. Таким образом, противники могут скрыть захваченные файлы, такие как фотографии, видео и / или скриншоты, а затем отфильтровать эти файлы.\n\nДля устройств Android, если файл «.nomedia» присутствует в папке, мультимедийные файлы в этой папке не будут видны пользователю в приложении Gallery. Кроме того, другие приложения просят не сканировать папку с помощью файла «.nomedia», что делает папку невидимой для пользователя.\n\nЭтот метод часто используется в приложениях stalkerware и spyware."
    },
    "T1629": {
      "name": "Нарушение обороны",
      "description": "Противники могут злонамеренно модифицировать компоненты среды жертвы, чтобы препятствовать или отключать защитные механизмы. Это связано не только с нарушением профилактической защиты, такой как антивирус, но и с возможностями обнаружения, которые защитники могут использовать для аудита деятельности и выявления вредоносного поведения. Это может охватывать как встроенные средства защиты, так и дополнительные возможности, установленные пользователями или администраторами мобильных конечных точек."
    },
    "T1629.001": {
      "name": "Предотвратить удаление приложения",
      "description": "Противники могут злоупотреблять API администрирования устройства Android, чтобы пользователь не мог удалить целевое приложение. В более ранних версиях Android приложениям администратора устройств требовалось, чтобы их возможности администрирования были явно деактивированы пользователем до того, как приложение может быть удалено. Позже он был обновлен, чтобы пользователь мог деактивировать и удалить приложение администратора за один шаг.\n\nПротивники могут также злоупотреблять API-интерфейсами доступности устройства для предотвращения удаления. Этот набор API позволяет приложению выполнять определенные действия от имени пользователя и программно определять, что отображается на экране. Вредоносное приложение может контролировать экран устройства для определенных модалей (например, модаль подтверждения для удаления приложения) и вводить ввод экрана или нажатие обратной кнопки, чтобы закрыть модаль. Например, «performGlobalAction(int)» Android. API может использоваться для предотвращения удаления вредоносного приложения с устройства после установки. Если пользователь хочет удалить вредоносное приложение, могут произойти два случая, которые не позволяют пользователю удалить приложение.\n\n* Случай 1: Если аргумент целого числа, переданный вызову API, является «2» или «GLOBAL ACTION HOME», вредоносное приложение может направить пользователя на домашний экран из экрана настроек\n\nСлучай 2: Если аргумент целого числа, переданный вызову API, является «1» или «GLOBAL ACTION BACK», вредоносное приложение может эмулировать событие обратной печати."
    },
    "T1629.002": {
      "name": "Закрытие устройства",
      "description": "Противник может попытаться препятствовать взаимодействию пользователя, блокируя законного пользователя из устройства. Обычно это достигается путем запроса разрешений администратора устройства, а затем блокировки экрана с помощью «DevicePolicyManager.lockNow()». Были замечены другие новые методы блокировки пользователя из устройства, такие как отображение постоянного наложения, использование тщательно продуманных экранов уведомлений «вызова» и блокировка HTML-страниц на переднем плане. Эти методы могут быть очень трудно обойти, и, как правило, требуют загрузки устройства в безопасный режим, чтобы удалить вредоносное ПО. (Ситуация: Microsoft MalLockerB) (Ситуация: Talos GPlayed) (Ситуация: Securelist rotexy 2018)\n\nДо Android 7 администраторы устройств могли сбросить пароль блокировки устройства, чтобы пользователь не разблокировал устройство. В выпуске Android 7 появились обновления, которые позволяют владельцам устройств или профилей (например, MDM) сбрасывать пароль устройства. (перенаправлено с «Android resetPassword»)"
    },
    "T1629.003": {
      "name": "Отключить или изменить инструменты",
      "description": "Противники могут отключить инструменты безопасности, чтобы избежать потенциального обнаружения их инструментов и действий. Это может принимать форму отключения программного обеспечения безопасности, изменения конфигурации SELinux или других методов вмешательства в инструменты безопасности, сканирующие или сообщающие информацию. Обычно это делается путем злоупотребления разрешениями администратора устройства или использования системных эксплойтов для получения корневого доступа к устройству для изменения защищенных системных файлов."
    },
    "T1630": {
      "name": "Удаление индикатора на хосте",
      "description": "Противники могут удалять, изменять или скрывать созданные артефакты на устройстве, включая файлы, статус джейлбрейка или само вредоносное приложение. Эти действия могут мешать сбору событий, отчетности или другим уведомлениям, используемым для обнаружения активности вторжения. Это может поставить под угрозу целостность мобильных решений безопасности, вызывая несообщение о заметных событиях или информации."
    },
    "T1630.001": {
      "name": "Удалить вредоносное приложение",
      "description": "Противники могут включать функциональность в вредоносное ПО, которое удаляет вредоносное приложение с устройства. Этого можно достичь путем:\n\n* Злоупотребление разрешениями владельца устройства на бесшумную деинсталляцию с использованием вызовов API владельца устройства.\n* Злоупотребление правами root для удаления файлов из файловой системы.\n* Злоупотребление доступом. Для этого требуется отправить в систему намерение запросить удаление, а затем злоупотребить службой доступности, чтобы щелкнуть нужные места на экране, чтобы подтвердить удаление."
    },
    "T1630.002": {
      "name": "Удаление файлов",
      "description": "Противники могут стереть устройство или удалить отдельные файлы, чтобы манипулировать внешними результатами или скрывать активность. Приложение должно иметь доступ администратора, чтобы полностью стереть устройство, в то время как отдельные файлы могут не требовать специальных разрешений на удаление в зависимости от их местоположения хранения.\n\nХранимые данные могут включать в себя различные форматы файлов, такие как файлы Office, базы данных, сохраненные электронные письма и пользовательские форматы файлов. Удаление файла удара будет зависеть от типа данных, а также целей и задач противника, но может включать удаление файлов обновления, чтобы избежать обнаружения или удаления файлов, определенных злоумышленником, для удара."
    },
    "T1630.003": {
      "name": "Замаскировать индикаторы Root/Jailbreak",
      "description": "Противник может использовать знания методов, используемых программным обеспечением безопасности, чтобы уклониться от обнаружения. Например, некоторые продукты мобильной безопасности выполняют скомпрометированное обнаружение устройства путем поиска определенных артефактов, таких как установленный двоичный файл «su», но эту проверку можно избежать, назвав двоичный файл чем-то другим. Аналогичным образом, методы полиморфного кода могут быть использованы для уклонения от обнаружения на основе подписи."
    },
    "T1631": {
      "name": "Инъекция процесса",
      "description": "Противники могут вводить код в процессы, чтобы избежать защиты на основе процессов или даже повысить привилегии. Инъекция процесса представляет собой способ выполнения произвольного кода в адресном пространстве отдельного живого процесса. Запуск кода в контексте другого процесса может обеспечить доступ к памяти процесса, системным/сетевым ресурсам и, возможно, повышенным привилегиям. Выполнение с помощью впрыска процесса может также уклоняться от обнаружения продуктов безопасности, поскольку выполнение маскируется под законный процесс.\n\nИ у Android, и у iOS нет законного способа добиться внедрения процесса. Единственный способ сделать это — злоупотребить существующим корневым доступом или использовать уязвимость."
    },
    "T1631.001": {
      "name": "Системные вызовы Ptrace",
      "description": "Противники могут вводить вредоносный код в процессы с помощью системных вызовов ptrace, чтобы избежать защиты на основе процессов, а также, возможно, повысить привилегии. Система Ptrace call injection представляет собой метод выполнения произвольного кода в адресном пространстве отдельного живого процесса.\n\nВпрыск системного вызова Ptrace включает в себя присоединение и изменение запущенного процесса. Системный вызов ptrace позволяет процессу отладки наблюдать и управлять другим процессом (и каждым отдельным потоком), включая изменение памяти и значений регистра. (перенаправлено с «PTRACE Man») Инъекция системного вызова Ptrace обычно выполняется путем записи произвольного кода в запущенный процесс (например, с помощью «malloc»), а затем вызывает эту память с помощью «PTRACE SETREGS», чтобы установить регистр, содержащий следующую команду для выполнения. Инъекция системного вызова Ptrace также может быть выполнена с помощью «PTRACE POKETEXT» / «PTRACE POKEDATA», которые копируют данные на конкретный адрес в памяти целевого процесса (например, текущий адрес следующей инструкции).\n\nВпрыск системных вызовов Ptrace может быть невозможен при нацеливании на процессы с высокими привилегиями, а на некоторые системы — на те, которые не являются детскими процессами. (перенаправлено с «BH Linux Inject»)\n\nЗапуск кода в контексте другого процесса может обеспечить доступ к памяти процесса, системным/сетевым ресурсам и, возможно, повышенным привилегиям. Выполнение с помощью впрыска вызова системы Ptrace также может уклоняться от обнаружения из продуктов безопасности, поскольку выполнение маскируется под законный процесс."
    },
    "T1632": {
      "name": "Свернуть контроль доверия",
      "description": "Противники могут подорвать контроль безопасности, который либо предупредит пользователей о ненадежной деятельности, либо предотвратит выполнение ненадежных приложений. Операционные системы и продукты безопасности могут содержать механизмы для идентификации программ или веб-сайтов как обладающих определенным уровнем доверия. Примеры таких функций включают в себя: приложение, которому разрешено работать, потому что оно подписано действительным сертификатом подписи кода; ОС, предупреждающая пользователя о том, что приложение пришло из ненадежного источника; или получение указания о том, что вы собираетесь подключиться к ненадежному сайту. Метод, который используют противники, будет зависеть от конкретного механизма, который они стремятся подорвать."
    },
    "T1632.001": {
      "name": "Код, подписывающий изменение политики",
      "description": "Противники могут изменять политику подписи кода, чтобы обеспечить выполнение приложений, подписанных неофициальными или неизвестными ключами. Подписание кода обеспечивает уровень подлинности приложения от разработчика, гарантируя, что программа не была подделана и исходит из официального источника. Контроль безопасности может включать в себя механизмы обеспечения того, чтобы на устройстве мог работать только действительный, подписанный код.\n\nМобильные устройства, как правило, включают эти средства управления безопасностью по умолчанию, например, предотвращая установку неизвестных приложений на Android. Противники могут изменять эти политики несколькими способами, включая [Input Injection] (https://attack.mitre.org/techniques/T1516) или вредоносные профили конфигурации."
    },
    "T1633": {
      "name": "Виртуализация/Sandbox Evasion",
      "description": "Противники могут использовать различные средства для обнаружения и предотвращения виртуализации и анализа сред. Это может включать изменение поведения после проверки наличия артефактов, указывающих на среду виртуальной машины (VME) или песочницу. Если противник обнаруживает VME, он может изменить поведение своего вредоносного ПО, чтобы отключиться от жертвы или скрыть основные функции полезной нагрузки. Они также могут искать артефакты VME, прежде чем сбрасывать дополнительные полезные нагрузки. Противники могут использовать информацию, полученную от [Virtualization/Sandbox Evasion] (https://attack.mitre.org/techniques/T1633) во время автоматизированного обнаружения, для формирования последующего поведения.\n\nПротивники могут использовать несколько методов для выполнения [Virtualization/Sandbox Evasion] (https://attack.mitre.org/techniques/T1633), таких как проверка системных артефактов, связанных с анализом или виртуализацией. Противники могут также проверить законную активность пользователя, чтобы определить, находится ли он в аналитической среде."
    },
    "T1633.001": {
      "name": "Системные проверки",
      "description": "Противники могут использовать различные системные проверки для обнаружения и предотвращения виртуализации и анализа сред. Это может включать изменение поведения после проверки наличия артефактов, указывающих на виртуальную среду или песочницу. Если противник обнаруживает виртуальную среду, он может изменить поведение своего вредоносного ПО, чтобы отключиться от жертвы или скрыть основные функции имплантата. Они также могут искать артефакты виртуализации перед сбросом вторичной или дополнительной полезной нагрузки.\n\nПроверки могут включать общие свойства системы, такие как имя хоста / домена и образцы сетевого трафика. Противники также могут проверять адреса сетевых адаптеров, количество ядер процессора и доступный размер памяти / диска.\n\nАппаратные проверки, такие как наличие датчиков движения, также могут быть использованы для сбора доказательств, которые могут указывать на виртуальную среду. Противники могут также запрашивать определенные показания с этих устройств."
    },
    "T1634": {
      "name": "Сертификаты из Password Store",
      "description": "Противники могут искать общие места хранения паролей для получения учетных данных пользователей. Пароли могут храниться в нескольких местах на устройстве, в зависимости от операционной системы или приложения, имеющего учетные данные. Существуют также специальные приложения, которые хранят пароли, чтобы облегчить управление и обслуживание пользователей. После получения учетных данных они могут быть использованы для выполнения бокового движения и доступа к информации с ограниченным доступом."
    },
    "T1634.001": {
      "name": "цепочка ключей",
      "description": "Противники могут собирать данные ключей с устройства iOS для получения учетных данных. Keychains - это встроенный способ для iOS отслеживать пароли и учетные данные пользователей для многих сервисов и функций, таких как пароли Wi-Fi, веб-сайты, безопасные заметки, сертификаты, закрытые ключи и учетные данные VPN.\n\nНа устройстве база данных ключей хранится за пределами песочницы приложений для предотвращения несанкционированного доступа к исходным данным. Стандартные API iOS позволяют приложениям получить доступ к своей собственной цепочке ключей, содержащейся в базе данных. Используя эксплойт эскалации привилегий или существующий root-доступ, противники могут получить доступ ко всей зашифрованной базе данных. (Ситуация: Apple Keychain Services)"
    },
    "T1635": {
      "name": "Украсть приложение Access Token",
      "description": "Противники могут украсть токены доступа к пользовательским приложениям в качестве средства получения учетных данных для доступа к удаленным системам и ресурсам. Это может произойти с помощью социальной инженерии или угона URI и обычно требует действий пользователя для предоставления доступа, например, через диалог «Открыть с».\n\nТокены доступа к приложениям используются для выполнения авторизованных запросов API от имени пользователя и обычно используются в качестве способа доступа к ресурсам в облачных приложениях и программном обеспечении как услуге (SaaS). (Ситуация: Auth0 - Почему вы всегда должны использовать токены доступа для безопасных API с сентября 2019 года) OAuth является одной из широко реализуемых рамок, используемых для выдачи токенов пользователям для доступа к системам. Приложение, желающее получить доступ к облачным сервисам или защищенным API, может получить доступ через OAuth 2.0 с использованием различных протоколов авторизации. Примером обычно используемой последовательности является поток грантов кода авторизации Microsoft. (Ситуация: протоколы платформы Microsoft Identity Platform, май 2019 года) (Ситуация: Microsoft - поток авторизации кода OAuth - июнь 2019 года) Токен доступа OAuth позволяет стороннему приложению взаимодействовать с ресурсами, содержащими пользовательские данные, запрашиваемыми способами, не требуя учетных данных пользователя."
    },
    "T1635.001": {
      "name": "Угон URI",
      "description": "Противники могут регистрировать унифицированные идентификаторы ресурсов (URI) для перехвата конфиденциальных данных.\n\nПриложения регулярно регистрируют URI в операционной системе, чтобы выступать в качестве обработчика ответов на различные действия, такие как вход в приложение с помощью внешней учетной записи через один вход. Это позволяет переадресации на этот конкретный URI быть перехваченным приложением. Если противник должен был зарегистрироваться для URI, который уже использовался подлинным приложением, противник может быть в состоянии перехватить данные, предназначенные для подлинного приложения, или выполнить фишинговую атаку против подлинного приложения. Перехваченные данные могут включать коды авторизации OAuth или токены, которые могут быть использованы противником для получения доступа к защищенным ресурсам. (Citation: Trend Micro iOS URL Hijacking) (Citation: IETF-PKCE)"
    },
    "T1636": {
      "name": "Защищенные пользовательские данные",
      "description": "Противники могут использовать стандартные API-интерфейсы операционной системы для сбора данных из хранилищ данных, поддерживаемых разрешениями, на устройстве, таких как календарь или список контактов. Эти разрешения должны быть объявлены заранее. На Android они должны быть включены в манифест приложения. На iOS они должны быть включены в файл «Info.plist» приложения.\n\n\n\nПочти во всех случаях пользователь должен предоставить доступ к хранилище данных, к которому пытается получить доступ приложение. В последних версиях ОС поставщики ввели дополнительные средства контроля конфиденциальности для пользователей, такие как возможность предоставлять разрешение на приложение только в то время, когда приложение активно используется пользователем.\n\n\n\nЕсли устройство было взломано или укоренено, противник может получить доступ к [Защищенным данным пользователя] (https://attack.mitre.org/techniques/T1636) без ведома или одобрения пользователя."
    },
    "T1636.001": {
      "name": "Календарь Entries",
      "description": "Противники могут использовать стандартные API операционной системы для сбора данных о вводе календаря. На Android это можно сделать с помощью поставщика календарного контента. В iOS это можно сделать с помощью фреймворка «EventKit».\n\n\n\nЕсли устройство было взломано или укоренено, противник может получить доступ к [Calendar Entries] (https://attack.mitre.org/techniques/T1636/001) без ведома или одобрения пользователя."
    },
    "T1636.002": {
      "name": "Звоните.",
      "description": "Противники могут использовать стандартные API операционной системы для сбора данных журнала вызовов. На Android это можно сделать с помощью поставщика контента Call Log. iOS не предоставляет стандартного API для доступа к журналу вызовов.\n\n\n\nЕсли устройство было взломано или укоренено, противник может получить доступ к [Call Log] (https://attack.mitre.org/techniques/T1636/002) без ведома или одобрения пользователя."
    },
    "T1636.003": {
      "name": "Контактный список",
      "description": "Противники могут использовать стандартные API операционной системы для сбора данных списка контактов. На Android это можно сделать с помощью поставщика контактного контента. В iOS это можно сделать с помощью фреймворка «Контакты».\n\n\n\nЕсли устройство было взломано или укоренено, противник может получить доступ к [Списку контактов] (https://attack.mitre.org/techniques/T1636/003) без ведома или одобрения пользователя."
    },
    "T1636.004": {
      "name": "SMS сообщения",
      "description": "Противники могут использовать стандартные API операционной системы для сбора SMS-сообщений. На Android это можно сделать с помощью поставщика контента SMS. iOS не предоставляет стандартный API для доступа к SMS-сообщениям.\n\nЕсли устройство было взломано или укоренено, противник может получить доступ к сообщениям SMS (https://attack.mitre.org/techniques/T1636/004) без ведома или одобрения пользователя."
    },
    "T1636.005": {
      "name": "Счета",
      "description": "Противники могут использовать стандартные API операционной системы для сбора данных учетной записи. На Android это можно сделать с помощью API AccountManager. Например, противники могут использовать метод «getAccounts()» для перечисления всех учетных записей.(Цитирование: Android AccountManager Feb2025) В iOS это можно сделать с помощью сервисов Keychain.\n\nЕсли устройство было взломано или укоренено, противники могут иметь доступ к [Учетным записям] (https://attack.mitre.org/techniques/T1636/005) без ведома или одобрения пользователей."
    },
    "T1637": {
      "name": "Динамическое решение",
      "description": "Противники могут динамически устанавливать соединения с инфраструктурой командования и управления, чтобы избежать общих обнаружений и исправлений. Это может быть достигнуто с помощью вредоносных программ, которые имеют общий алгоритм с инфраструктурой, которую противник использует для получения сообщений вредоносного ПО. Этот алгоритм может использоваться для динамической настройки параметров, таких как доменное имя, IP-адрес или номер порта, который вредоносное ПО использует для командования и управления."
    },
    "T1637.001": {
      "name": "Алгоритмы генерации доменов",
      "description": "Противники могут использовать [Алгоритмы генерации доменов] (https://attack.mitre.org/techniques/T1637/001) (DGA) для процедурного генерирования доменных имен для таких целей, как передача команд и управления или распространение вредоносных приложений. (Citation: securelist rotexy 2018)\n\nDGA увеличивают сложность блокировки, отслеживания или захвата канала управления, поскольку потенциально могут быть тысячи доменов, которые вредоносное ПО может проверить на наличие инструкций."
    },
    "T1638": {
      "name": "Противник в центре",
      "description": "Противники могут попытаться позиционировать себя между двумя или более сетевыми устройствами для поддержки последующих действий, таких как [Переданные манипуляции данными] (https://attack.mitre.org/techniques/T1565/002) или [Отказ в обслуживании конечных точек] (https://attack.mitre.org/techniques/T1642).\n\n\n\n[Средний противник] (https://attack.mitre.org/techniques/T1638) может быть достигнут с помощью нескольких механизмов. Например, вредоносное приложение может регистрироваться в качестве VPN-клиента, эффективно перенаправляя трафик устройств на ресурсы, принадлежащие противнику. Регистрация в качестве VPN-клиента требует согласия пользователя как на Android, так и на iOS; кроме того, для устройств iOS требуется специальное право, предоставленное Apple. В качестве альтернативы, вредоносное приложение с привилегиями эскалации может использовать эти привилегии для получения доступа к сетевому трафику.\n\n\nКонкретно для Android-устройств, adversary-in-the-disk - это тип атаки AiTM, где противники отслеживают и манипулируют данными, которые обмениваются между приложениями и внешним хранилищем. (Citation: mitd kaspersky) (Citation: mitd checkpoint) (Citation: mitd checkpoint research) Для этого вредоносное приложение сначала запрашивает доступ к мультимедийным файлам на устройстве («READ EXTERNAL STORAGE» и «WRITE EXTERNAL STORAGE»), затем приложение считывает данные на устройстве и/или записывает вредоносное ПО на устройство. Хотя запрос на доступ является распространенным, при злонамеренном использовании противники могут получить доступ к файлам и другим конфиденциальным данным из-за злоупотребления разрешением. Было показано, что несколько приложений уязвимы для этой атаки; однако проверка разрешений и валидации ввода может смягчить эту атаку.\n\nЗа пределами мобильного устройства противники могут захватывать трафик, используя базовую станцию или точку доступа Wi-Fi. Эти устройства позволят противникам захватывать сетевой трафик после того, как он покинет устройство. В локальной сети могут использоваться корпоративные методы, такие как [ARP Cache Poisoning] (https://attack.mitre.org/techniques/T1557/002) или [DHCP Spoofing] (https://attack.mitre.org/techniques/T1557/003).\n\n\n\nЕсли приложения правильно шифруют свой сетевой трафик, конфиденциальные данные могут быть недоступны для противников, в зависимости от точки захвата. Например, надлежащая реализация прикладной транспортной безопасности Apple (ATS) и конфигурации сетевой безопасности Android (NSC) может предотвратить утечки конфиденциальных данных. (перенаправлено с «NSC Android»)"
    },
    "T1639": {
      "name": "Профилактика по альтернативному протоколу",
      "description": "Злоумышленники могут украсть данные, удалив их по протоколу, отличному от существующего канала управления. Данные также могут быть отправлены в альтернативное местоположение сети с главного сервера управления.\n\nАльтернативные протоколы включают FTP, SMTP, HTTP/S, DNS, SMB или любой другой сетевой протокол, не используемый в качестве основного канала управления. Различные протокольные каналы могут также включать веб-сервисы, такие как облачное хранилище. Противники могут также шифровать и/или запутывать эти альтернативные каналы."
    },
    "T1639.001": {
      "name": "Незашифрованный протокол Non-C2",
      "description": "Злоумышленники могут украсть данные, выбрав их по незашифрованному сетевому протоколу, отличному от существующего канала управления. Данные также могут быть отправлены в альтернативное местоположение сети с главного сервера управления.\n\nПротивники могут принять решение запутать эти данные без использования шифрования в сетевых протоколах, которые изначально не зашифрованы (таких как HTTP, FTP или DNS). Противники могут использовать пользовательские или общедоступные алгоритмы кодирования/сжатия (такие как base64) или встраивать данные в заголовки и поля протокола."
    },
    "T1640": {
      "name": "Удаление доступа к аккаунту",
      "description": "Противники могут прервать доступность системных и сетевых ресурсов, препятствуя доступу к учетным записям, используемым законными пользователями. Учетные записи могут быть удалены, заблокированы или изменены (например, изменены учетные данные) для удаления доступа к учетным записям."
    },
    "T1641": {
      "name": "Манипулирование данными",
      "description": "Противники могут вставлять, удалять или изменять данные, чтобы манипулировать внешними результатами или скрывать активность. Манипулируя данными, противники могут попытаться повлиять на бизнес-процесс, организационное понимание или принятие решений.\n\nТип модификации и ее влияние зависят от целевого применения, процесса и целей и задач противника. Для сложных систем противнику, вероятно, потребуется специальная экспертиза и, возможно, доступ к специализированному программному обеспечению, связанному с системой, обычно получаемому в результате длительной кампании по сбору информации, чтобы оказать желаемое воздействие."
    },
    "T1641.001": {
      "name": "Передаваемые манипуляции данными",
      "description": "Противники могут изменять данные на пути к хранению или другим системам, чтобы манипулировать внешними результатами или скрывать активность. Манипулируя передаваемыми данными, противники могут попытаться повлиять на бизнес-процесс, организационное понимание или принятие решений.\n\nМанипуляция может быть возможна через сетевое соединение или между системными процессами, где есть возможность развернуть инструмент, который будет перехватывать и изменять информацию. Тип модификации и влияние, которое она окажет, зависит от целевого механизма передачи, а также от целей и задач противника. Для сложных систем противнику, вероятно, потребуется специальная экспертиза и, возможно, доступ к специализированному программному обеспечению, связанному с системой, обычно получаемому в результате длительной кампании по сбору информации, чтобы оказать желаемое воздействие.\n\nОдним из способов достижения [Переданные данные манипулирования] (https://attack.mitre.org/techniques/T1641/001) является изменение содержимого буфера обмена устройства. Вредоносные приложения могут отслеживать активность буфера обмена через «ClipboardManager». Интерфейс OnPrimaryClipChangedListener на Android, чтобы определить, когда содержимое буфера обмена изменилось. Прослушивание активности буфера обмена, чтение содержимого буфера обмена и изменение содержимого буфера обмена не требует явного разрешения приложения и может быть выполнено приложениями, работающими в фоновом режиме. Однако это поведение изменилось с выходом Android 10.\n\nПротивники могут использовать [Transmitted Data Manipulation] (https://attack.mitre.org/techniques/T1641/001) для замены текста перед вставкой. Например, замена скопированного адреса биткойн-кошелька на адрес кошелька, который находится под контролем противника.\n\n[Переданные манипуляции данными] (https://attack.mitre.org/techniques/T1641/001) были замечены в Android/Clipper. Троян. Этот образец был обнаружен ESET в приложении, распространяемом через Google Play Store, ориентированном на номера криптовалютных кошельков. (перенаправлено с «ESET Clipboard Modification February 2019»)"
    },
    "T1642": {
      "name": "Отказ конечной точки в обслуживании",
      "description": "Злоумышленники могут совершать атаки типа Endpoint Denial of Service (DoS), чтобы ухудшить или заблокировать доступность услуг для пользователей.\n\nВ версиях Android до 7 приложения могут злоупотреблять доступом администратора устройства для сброса пароля блокировки устройства, не позволяя пользователю разблокировать устройство. После Android 7 только владельцы устройств или профилей (например, MDM) могут сбросить пароль устройства.\n\nНа устройствах iOS этот метод не работает, потому что серверы управления мобильными устройствами могут удалять только пароль блокировки экрана; они не могут установить новый пароль. Однако на взломанных устройствах было обнаружено вредоносное ПО, которое может заблокировать пользователя из устройства. (цитата: Xiao-KeyRaider)"
    },
    "T1643": {
      "name": "Возникновение трафика от жертвы",
      "description": "Противники могут генерировать исходящий трафик с устройств. Обычно это выполняется для манипулирования внешними результатами, такими как мошенничество с выставлением счетов оператором или манипулирование рейтингами или рейтингами магазина приложений. Исходящий трафик обычно генерируется в виде SMS-сообщений или общего веб-трафика, но может принимать и другие формы.\n\nЕсли это делается с помощью SMS-сообщений, приложения Android должны иметь разрешение «SEND SMS». Кроме того, отправка SMS-сообщения требует согласия пользователя, если получатель является премиальным номером. Приложения не могут отправлять SMS-сообщения на iOS"
    },
    "T1644": {
      "name": "Из данных группы",
      "description": "Противники могут общаться с скомпрометированными устройствами, используя потоки данных из полосы. Это может быть сделано по различным причинам, включая уклонение от мониторинга сетевого трафика, в качестве метода резервного копирования команд и управления, или для удаления данных, если устройство не подключено к каким-либо сетям, предоставляющим Интернет (например, сотовой связи или Wi-Fi). Существует несколько потоков данных из диапазона, таких как SMS-сообщения, NFC и Bluetooth.\n\n\n\nНа Android приложения могут читать push-уведомления для захвата контента из SMS-сообщений или других потоков данных из полосы. Это требует, чтобы пользователь вручную предоставил доступ к уведомлению приложения через меню настроек. Тем не менее, приложение может запустить намерение принять пользователя непосредственно там.\n\n\n\nНа iOS нет возможности программно читать push-уведомления."
    },
    "T1645": {
      "name": "Компромисс клиентского программного обеспечения Binary",
      "description": "Противники могут изменять системные программные двоичные файлы, чтобы установить постоянный доступ к устройствам. Системные программные двоичные файлы используются базовой операционной системой и пользователями через эмуляторы adb или terminal.\n\nПротивники могут вносить изменения в двоичные файлы клиентского программного обеспечения для выполнения вредоносных задач при выполнении этих двоичных файлов. Например, вредоносное ПО может поставляться с предварительно скомпилированным вредоносным двоичным кодом, предназначенным для перезаписи подлинного на устройстве. Поскольку эти двоичные файлы могут выполняться системой или пользователем, противник может использовать их для постоянного доступа к устройству."
    },
    "T1646": {
      "name": "Фильтрация через канал C2",
      "description": "Злоумышленники могут украсть данные, удалив их по существующему каналу управления. Украденные данные закодированы в обычном канале связи с использованием того же протокола, что и сообщения команд и управления."
    },
    "T1655": {
      "name": "маскировка",
      "description": "Противники могут пытаться манипулировать особенностями своих артефактов, чтобы сделать их законными или доброкачественными для пользователей и / или инструментов безопасности. Маскировка происходит, когда имя, местоположение или внешний вид объекта, законного или злонамеренного, манипулируют или злоупотребляют ради уклонения от защиты и наблюдения. Это может включать в себя манипулирование метаданными файлов, обман пользователей с целью неправильной идентификации типа файла и предоставление законных имен задач или услуг.\n\nПереименование вредоносных системных утилит для уклонения от мониторинга безопасности также является формой маскировки (https://attack.mitre.org/techniques/T1655)."
    },
    "T1655.001": {
      "name": "Совпадение законного имени или местоположения",
      "description": "Противники могут совпадать или приблизиться к имени или местоположению законных файлов или ресурсов при их наименовании / размещении. Это делается ради уклонения от защиты и наблюдения. Это может быть сделано путем предоставления артефактам имени и значка законного, доверенного приложения (т.е. Настройки) или использования имени пакета, которое соответствует законным, доверенным приложениям (т.е. «com.google.android.gm»).\n\nПротивники могут также использовать тот же значок файла или приложения, который они пытаются имитировать."
    },
    "T1658": {
      "name": "Эксплуатация для исполнения клиентом",
      "description": "Противники могут использовать уязвимости программного обеспечения в клиентских приложениях для выполнения кода. Уязвимости могут существовать в программном обеспечении из-за небезопасных методов кодирования, которые могут привести к непредвиденному поведению. Противники могут воспользоваться определенными уязвимостями путем целенаправленной эксплуатации с целью произвольного выполнения кода. Часто наиболее ценными эксплойтами для наступательного набора инструментов являются те, которые могут быть использованы для выполнения кода в удаленной системе, потому что они могут быть использованы для получения доступа к этой системе. Пользователи ожидают увидеть файлы, связанные с приложениями, которые они обычно используют для работы, поэтому они являются полезной мишенью для исследования и разработки эксплойтов из-за их высокой полезности.\n\nПротивники могут использовать эксплойты нулевого клика на основе устройства для выполнения кода. Эти эксплойты являются мощными, потому что для выполнения кода не требуется взаимодействие с пользователем.\n\n###Доставка SMS/iMessage\n\nSMS и iMessage в iOS являются общими целями через [Drive-By Compromise] (https://attack.mitre.org/techniques/T1456), [Phishing] (https://attack.mitre.org/techniques/T1660) и т.д. Противники могут использовать встраивание вредоносных ссылок, файлов и т. д. в SMS-сообщения или iMessages. Мобильные устройства могут быть скомпрометированы с помощью эксплойтов с одним щелчком мыши, где жертва должна взаимодействовать с текстовым сообщением, или эксплойтов с нулевым щелчком мыши, где взаимодействие с пользователем не требуется.\n\n###Воздушная капля\n\nУникальный для iOS, AirDrop - это сетевой протокол, который позволяет пользователям iOS передавать файлы между устройствами iOS. До того, как были выпущены патчи от Apple, на iOS 13.4 и ранее, противники могут заставить интерфейс Apple Wireless Direct Link (AWDL) активироваться, а затем использовать переполнение буфера, чтобы получить доступ к устройству и работать как root без взаимодействия с пользователем."
    },
    "T1660": {
      "name": "фишинг",
      "description": "Противники могут отправлять вредоносный контент пользователям, чтобы получить доступ к своим мобильным устройствам. Все формы фишинга поставляются в электронном виде социальной инженерией. Противники могут проводить как нецелевой фишинг, например, в массовых спам-кампаниях вредоносных программ, так и более целенаправленный фишинг, адаптированный для конкретного человека, компании или отрасли, известный как «копилка». Фишинг часто включает в себя методы социальной инженерии, такие как представление в качестве надежного источника, а также методы уклонения, такие как удаление или манипулирование электронной почтой или метаданными / заголовками из скомпрометированных учетных записей, которыми злоупотребляют для отправки сообщений.\n\nМобильный фишинг может принимать различные формы. Например, противники могут отправлять электронные письма, содержащие вредоносные вложения или ссылки, как правило, для доставки и последующего выполнения вредоносного кода на устройствах жертвы. Фишинг также может проводиться через сторонние сервисы, такие как платформы социальных сетей. Противники могут также выдавать себя за руководителей организаций, чтобы убедить жертв в совершении каких-либо действий от их имени. Например, противники часто используют методы социальной инженерии в текстовых сообщениях, чтобы заставить жертв действовать быстро, что приводит к тому, что противники получают учетные данные и другую информацию.\n\nМобильные устройства являются особенно привлекательной мишенью для противников, выполняющих фишинговые кампании. Из-за их меньшего форм-фактора, чем традиционные конечные точки рабочего стола, пользователи могут не заметить незначительных различий между подлинными и фишинговыми веб-сайтами. Кроме того, мобильные устройства имеют дополнительные датчики и радиоприемники, которые позволяют противникам выполнять попытки фишинга по нескольким различным векторам, таким как:\n\n- SMS-сообщения: противники могут отправлять SMS-сообщения (известные как «удар») с скомпрометированных устройств потенциальным целям, чтобы убедить цель, например, установить вредоносное ПО, перейти на конкретный веб-сайт или включить определенные небезопасные конфигурации на своем устройстве.\nКоды быстрого реагирования (QR): противники могут использовать QR-коды (известные как «победа») для перенаправления пользователей на фишинговый веб-сайт. Например, противник может заменить законный публичный QR-код на другой, например, фишинговый сайт. Вредоносный QR-код также может быть доставлен с помощью других средств, таких как SMS или электронная почта. В последнем случае противник может использовать вредоносный QR-код в электронном письме для перехода с настольного компьютера пользователя на мобильное устройство.\nЗвонки по телефону: противники могут вызывать жертв (известных как «пожелание»), чтобы убедить их выполнить действие, например, предоставить учетные данные для входа в систему или перейти на вредоносный веб-сайт. Это также может быть использовано в качестве метода для выполнения первоначального доступа на мобильном устройстве, но затем поворачиваться к компьютеру / другой сети, заставляя жертву выполнять действие на настольном компьютере."
    },
    "T1661": {
      "name": "Версия приложения",
      "description": "Противник может подтолкнуть обновление к ранее доброкачественному приложению для добавления вредоносного кода. Это может быть достигнуто путем продвижения изначально доброкачественного функционального приложения в доверенный магазин приложений, такой как Google Play Store или Apple App Store. Это позволяет противнику создать доверенную базу пользователей, которая может предоставлять разрешения приложению до введения вредоносного кода. Затем обновление приложения можно было бы подтолкнуть к введению вредоносного кода. (Ситуация: android app breaking bad)\n\nЭтот метод также может быть достигнут путем компрометации учетной записи разработчика. Это позволит противнику воспользоваться существующей базой пользователей, не устанавливая саму базу пользователей."
    },
    "T1662": {
      "name": "Уничтожение данных",
      "description": "Противники могут уничтожать данные и файлы на определенных устройствах или в больших количествах, чтобы прервать доступность систем, служб и сетевых ресурсов. Уничтожение данных может сделать сохраненные данные невосполнимыми с помощью судебно-медицинских методов путем перезаписи файлов или данных на локальных и удаленных дисках.\n\nДля уничтожения данных противники могут использовать команду «pm uninstall» для удаления пакетов или команду «rm» для удаления определенных файлов. Например, противники могут сначала использовать «pm uninstall» для удаления несистемных приложений, а затем использовать «rm (-f) <file(s)>» для удаления определенных файлов, дополнительно скрывая вредоносную активность."
    },
    "T1663": {
      "name": "Программное обеспечение удаленного доступа",
      "description": "Противники могут использовать законное программное обеспечение удаленного доступа, такое как «VNC», «TeamViewer», «AirDroid», «AirMirror» и т.д., для создания интерактивного канала управления и управления для нацеливания на мобильные устройства.\n\nПриложения удаленного доступа могут быть установлены и использованы после компрометации в качестве альтернативного канала связи для избыточного доступа или в качестве способа установления интерактивного удаленного сеанса с целевым устройством. Они также могут использоваться в качестве компонента вредоносного ПО для установления обратного соединения с системой или службой, контролируемой противником. Установка инструментов удаленного доступа также может включать в себя сохранение."
    },
    "T1664": {
      "name": "Эксплуатация для первоначального доступа",
      "description": "Противники могут использовать уязвимости программного обеспечения для получения первоначального доступа к мобильному устройству.\n\nЭто может быть достигнуто различными способами. Уязвимости могут присутствовать в приложениях, службах, базовой операционной системе или самом ядре. Существует несколько известных эксплойтов мобильных устройств, включая FORCEDENTRY, StageFright и BlueBorne. Кроме того, некоторые эксплойты могут быть использованы без какого-либо взаимодействия с пользователем (например, эксплойты с нулевым щелчком мыши, см. [Exploitation for Client Execution] (https://attack.mitre.org/techniques/T1658)), что делает их особенно опасными. Вендоры мобильных операционных систем, как правило, очень быстро исправляют такие критические ошибки, обеспечивая только небольшое окно, где они могут быть использованы."
    },
    "T1670": {
      "name": "Решение для виртуализации",
      "description": "Противники могут выполнять вредоносные операции, используя решения виртуализации, чтобы избежать обнаружения и выйти из песочницы Android. Android использует песочницы для разделения ресурсов и выполнения кода между приложениями и операционной системой. На Android доступно несколько решений для виртуализации, таких как Android Virtualization Framework (AVF). (перенаправлено с «Android AVF Overview»)\n\n\n\nС помощью решений виртуализации противники могут выполнять вредоносные операции без ведома пользователя. Например, противники могут имитировать функции законного банковского приложения в виртуальной среде благодаря решению виртуализации, в то время как вредоносный код захватывает учетные данные."
    },
    "T1676": {
      "name": "Связанные устройства",
      "description": "Противники могут злоупотреблять функцией «связанных устройств» в приложениях обмена сообщениями, таких как Signal и WhatsApp, для регистрации учетной записи пользователя на устройстве, контролируемом противником. Злоупотребляя функцией «связанные устройства», противники могут достигать и сохранять настойчивость через учетную запись пользователя, могут собирать информацию, такую как сообщения пользователя и список контактов, и могут отправлять будущие сообщения с связанного устройства.\n\nSignal - это приложение для обмена сообщениями, которое использует протокол Signal с открытым исходным кодом для шифрования сообщений и звонков; аналогично, WhatsApp - это приложение для обмена сообщениями, которое имеет сквозное шифрование и другие меры безопасности для защиты сообщений и звонков. Оба приложения имеют функцию «связанных устройств», которая позволяет пользователям получать доступ к своим учетным записям Signal и / или WhatsApp с разных устройств, таких как рабочий стол Windows или Mac, iPad или планшет Android. (Ссылка: WhatsApp LinkDevice NoDate) (Ссылка: Signal LinkedDevices NoDate)\n\nПротивники могут использовать методы [Phishing] (https://attack.mitre.org/techniques/T1660), чтобы обмануть пользователя и заставить его сканировать код быстрого ответа (QR), который используется для соединения сигнала пользователя и/или учетной записи WhatsApp с устройством, контролируемым противником. Например, противники могут маскировать QR-коды в качестве групповых приглашений, предупреждений о безопасности или в качестве законных инструкций для сопряжения связанных устройств.\nПри сканировании QR-кода в Signal пользователи могут нажать на опцию «История передачи сообщений», чтобы синхронизировать связанные устройства, что может позволить противникам собирать больше информации о пользователе. При сканировании QR-кода в WhatsApp устройство пользователя автоматически отправит сквозную зашифрованную копию недавней истории сообщений на устройство, контролируемое противником."
    }
  },
  "meta": {
    "language": "ru",
    "domain": "mobile",
    "generated_at": "2025-12-18T12:44:19+00:00",
    "generator": "argostranslate en->ru",
    "note": "Это неофициальный машинный перевод. Возможны неточности."
  },
  "groups": {
    "G0007": {
      "name": "APT28",
      "description": "[APT28] (https://attack.mitre.org/groups/G0007) является группой угроз, которая была приписана Главному разведывательному управлению Генерального штаба России (GRU) 85-й основной центр специальной службы (GTsSS) воинская часть 26165. (цитата: NSA/FBI Drovorub August 2020) (цитата: Консультативная кампания по кибербезопасности GRU Brute Force Campaign July 2021) Эта группа была активна, по крайней мере, с 2004 года. (Citation: DOJ GRU Indictment Jul 2018) (Citation: Ars Technica GRU indictment Jul 2018) (Citation: Crowdstrike DNC June 2016) (Citation: FireEye APT28) (Citation: SecureWorks TG-4127) (Citation: FireEye APT28 January 2017) (Citation: GRIZZLY STEPPE JAR) (Citation: Sofacy DealersChoice) (Citation: Palo Alto Sofacy 06-2018) (Citation: Symantec APT28 Oct 2018) (Citation: ESET Zebrocy May 2019)\n\n[APT28] (https://attack.mitre.org/groups/G0007), как сообщается, скомпрометировал кампанию Хиллари Клинтон, Национальный комитет Демократической партии и Комитет кампании Демократического конгресса в 2016 году в попытке помешать президентским выборам в США. В 2018 году США предъявили обвинение пяти офицерам подразделения 26165 ГРУ, связанным с [APT28] (https://attack.mitre.org/groups/G0007) в кибероперациях (включая операции с близким доступом), проведенных в период с 2014 по 2018 год против Всемирного антидопингового агентства (WADA), Антидопингового агентства США, ядерного объекта США, Организации по запрещению химического оружия (ОЗХО), Швейцарской химической лаборатории Шпица и других организаций. (Citation: U.S. District Court Indictment GRU Oct 2018) Некоторые из них были проведены при содействии подразделения 74455 ГРУ, которое также называется [Sandworm Team] (https://attack.mitre.org/groups/G0034)."
    },
    "G0034": {
      "name": "Группа Sandworm",
      "description": "[Sandworm Team] (https://attack.mitre.org/groups/G0034) является группой деструктивной угрозы, которая была приписана главному разведывательному управлению Генерального штаба России (GRU) Главному центру специальных технологий (GTsST) воинской части 74455. (Ситуация: Обвинение окружного суда США подразделение GRU 74455 октябрь 2020) (Ситуация: Олимпийские атаки NCSC Великобритании октябрь 2020) Эта группа активна, по крайней мере, с 2009 года. (Citation: iSIGHT Sandworm 2014) (Citation: CrowdStrike VOODOO BEAR) (Citation: USDOJ Sandworm Feb 2020) (Citation: NCSC Sandworm Feb 2020)\n\nВ октябре 2020 года США предъявили обвинение шести офицерам подразделения 74455 ГРУ, связанным с [Sandworm Team] (https://attack.mitre.org/groups/G0034) в следующих кибер-операциях: атаки 2015 и 2016 годов против украинских электрических компаний и правительственных организаций, атака 2017 года во всем мире [NotPetya] (https://attack.mitre.org/software/S0368), нацеленная на президентскую кампанию 2017 года во Франции, атака 2018 года [https://attack.mitre.org/software/S0365] против Зимних Олимпийских игр, операция 2018 года против Организации по запрещению химического оружия и атаки против страны Грузия в 2018 и 2019 годах. (Ситуация: Обвинение Окружного суда США Подразделение ГРУ 74455 Октябрь 2020) (Ситуация: Великобритания NCSC Олимпийские атаки Октябрь 2020) Некоторые из них были проведены при содействии подразделения 26165 ГРУ, которое также упоминается как [APT28] (ht"
    },
    "G0056": {
      "name": "ПРОМЕТИУМ",
      "description": "[PROMETHIUM] (https://attack.mitre.org/groups/G0056) — это группа, специализирующаяся на шпионаже, которая работает как минимум с 2012 года. Группа проводила операции по всему миру, уделяя особое внимание турецким целям. [PROMETHIUM] (https://attack.mitre.org/groups/G0056) продемонстрировал сходство с другой группой деятельности под названием [NEODYMIUM] (https://attack.mitre.org/groups/G0055) из-за перекрывающихся характеристик жертвы и кампании. (Citation: Microsoft NEODYMIUM Dec 2016) (Citation: Microsoft SIR Vol 21) (Citation: Talos Promethium June 2020)"
    },
    "G0069": {
      "name": "МаддиВотер",
      "description": "[MuddyWater] (https://attack.mitre.org/groups/G0069) является группой кибершпионажа, которая оценивается как подчиненный элемент в Министерстве разведки и безопасности Ирана (MOIS). (Citation: CYBERCOM Iranian Intel Cyber January 2022) С 2017 года [MuddyWater] (https://attack.mitre.org/groups/G0069) нацелена на ряд правительственных и частных организаций в различных секторах, включая телекоммуникации, местное самоуправление, оборону и нефтегазовые организации, на Ближнем Востоке, в Азии, Африке, Европе и Северной Америке. (Citation: Unit 42 MuddyWater Dec 2018) (Citation: ClearSky MuddyWater June 2019) (Citation: ClearSky MuddyWater November 2017) (Citation: DHS CISA AA22-055A MuddyWater February 2022) (Citation: Talos MuddyWater Jan 2022)"
    },
    "G0070": {
      "name": "Темный Каракал",
      "description": "[Dark Caracal] (https://attack.mitre.org/groups/G0070) — группа угроз, которая была приписана Генеральному управлению общей безопасности Ливана (GDGS) и действовала как минимум с 2012 года. (перенаправлено с «Lookout Dark Caracal Jan 2018»)"
    },
    "G0096": {
      "name": "APT41",
      "description": "[APT41] (https://attack.mitre.org/groups/G0096) — группа угроз, которую исследователи оценили как китайскую спонсируемую государством шпионскую группу, которая также проводит финансово мотивированные операции. Активный, по крайней мере, с 2012 года, [APT41] (https://attack.mitre.org/groups/G0096) был замечен в различных отраслях, включая, но не ограничиваясь, здравоохранение, телекоммуникации, технологии, финансы, образование, розничную торговлю и игровую индустрию в 14 странах. Заметное поведение включает использование широкого спектра вредоносных программ и инструментов для достижения целей миссии. [APT41] (https://attack.mitre.org/groups/G0096) частично совпадает с публичной отчетностью по группам, включая BARIUM и [Winnti Group] (https://attack.mitre.org/groups/G0044). (Citation: FireEye APT41 Aug 2019) (Citation: Group IB APT 41 June 2021)"
    },
    "G0097": {
      "name": "прыгающий гольф",
      "description": "[Bouncing Golf] (https://attack.mitre.org/groups/G0097) - это кампания кибершпионажа, нацеленная на страны Ближнего Востока. (Citation: Trend Micro Bouncing Golf 2019)"
    },
    "G0112": {
      "name": "Ветровое смещение",
      "description": "[Windshift] (https://attack.mitre.org/groups/G0112) является группой угроз, которая была активна, по крайней мере, с 2017 года, нацеливаясь на конкретных лиц для наблюдения в правительственных департаментах и критической инфраструктуре на Ближнем Востоке. (Citation: SANS Windshift August 2018) (Citation: Objective-see Windtail1 dec 2018) (Citation: Objective-see Windtail2 jan 2019)"
    },
    "G0142": {
      "name": "Конфуций",
      "description": "[Конфуций] (https://attack.mitre.org/groups/G0142) — группа кибершпионажа, которая с 2013 года в основном нацелена на военнослужащих, высокопоставленных лиц, бизнесменов и правительственные организации в Южной Азии. Исследователи безопасности отметили сходство между [Confucius] (https://attack.mitre.org/groups/G0142) и [Patchwork] (https://attack.mitre.org/groups/G0040), особенно в их соответствующем пользовательском вредоносном коде и целях. (Citation: TrendMicro Confucius APT Feb 2018) (Citation: TrendMicro Confucius APT Aug 2021) (Citation: Uptycs Confucius APT Jan 2021)"
    },
    "G1002": {
      "name": "Жуткий",
      "description": "[BITTER] (https://attack.mitre.org/groups/G1002) — подозреваемая южноазиатская группа угроз кибершпионажа, активная как минимум с 2013 года. [BITTER] (https://attack.mitre.org/groups/G1002) нацелен на правительственные, энергетические и инженерные организации в Пакистане, Китае, Бангладеш и Саудовской Аравии. (Citation: Cisco Talos Bitter Bangladesh May 2022) (Citation: Forcepoint BITTER Pakistan Oct 2016)"
    },
    "G1004": {
      "name": "LAPSUS$",
      "description": "[LAPSUS$] (https://attack.mitre.org/groups/G1004) — это группа киберпреступных угроз, которая активна, по крайней мере, с середины 2021 года. [LAPSUS$] (https://attack.mitre.org/groups/G1004) специализируется на крупномасштабных операциях социальной инженерии и вымогательства, включая разрушительные атаки без использования вымогателей. Группа нацелилась на организации во всем мире, в том числе в правительстве, производстве, высшем образовании, энергетике, здравоохранении, технологиях, телекоммуникациях и средствах массовой информации. (цитата: BBC LAPSUS Apr 2022) (цитата: MSTIC DEV-0537 Mar 2022) (цитата: UNIT 42 LAPSUS Mar 2022)"
    },
    "G1006": {
      "name": "Земля Луска",
      "description": "[Earth Lusca] (https://attack.mitre.org/groups/G1006) - подозреваемая китайская кибершпионская группа, которая была активна, по крайней мере, с апреля 2019 года. [Earth Lusca] (https://attack.mitre.org/groups/G1006) нацелилась на организации в Австралии, Китае, Гонконге, Монголии, Непале, Филиппинах, Тайване, Таиланде, Вьетнаме, Объединенных Арабских Эмиратах, Нигерии, Германии, Франции и Соединенных Штатах. Цели включали правительственные учреждения, средства массовой информации, игорные компании, образовательные учреждения, исследовательские организации COVID-19, телекоммуникационные компании, религиозные движения, запрещенные в Китае, и платформы для торговли криптовалютами; исследователи безопасности оценивают некоторые операции [Earth Lusca] (https://attack.mitre.org/groups/G1006).\n\n[Earth Lusca] (https://attack.mitre.org/groups/G1006) использовала вредоносное ПО, обычно используемое другими китайскими группами угроз, включая [APT41] (https://attack.mitre.org/groups/G0096) и кластер [Winnti Group] (https://attack.mitre.org/groups/G0044), однако исследователи безопасности оценивают [Earth Lusca] (https://attack.mitre.org/groups/G1006) методы и инфраструктуру отдельно. (Citation: TrendMicro EarthLusca 2022)"
    },
    "G1015": {
      "name": "Рассеянный паук",
      "description": "[Scattered Spider] (https://attack.mitre.org/groups/G1015) — англоязычная киберпреступная группа, активная как минимум с 2022 года. (Citation: CrowdStrike Scattered Spider Profile) (Citation: MSTIC Octo Tempest Operations October 2023) Первоначально группа ориентировалась на поставщиков услуг по управлению взаимоотношениями с клиентами (CRM), фирмы по аутсорсингу бизнес-процессов (BPO) и телекоммуникационные и технологические компании, а в 2023 году расширилась до игровых, гостиничных, розничных, управляемых поставщиков услуг (MSP), производственного и финансового секторов. (перенаправлено с «MSTIC Octo Tempest Operations October 2023»)\n[Scattered Spider] (https://attack.mitre.org/groups/G1015) в значительной степени полагается на социальную инженерию, включая выдачу себя за ИТ-специалистов и сотрудников службы поддержки, для получения первоначального доступа, обхода многофакторной аутентификации (MFA) и компрометации корпоративных сетей. Группа адаптировала свои инструменты для уклонения от защиты обнаружения конечных точек и ответа (EDR) и использовала вымогателей для финансовой выгоды. (Citation: CISA Scattered Spider Advisory November 2023) (Citation: CrowdStrike Scattered Spider BYOVD January 2023) (Citation: Crowdstrike TELCO BPO Campaign December 2022)\n[Scattered Spider] (https://attack.mitre.org/groups/G1015) расширилась до гибридных облачных сред и сред идентификации, используя имитацию справочного стола и обход MFA для получения доступа администратора в Okta, AWS и Office 365. (перенаправлено с «Mandiant UNC3944 May 2025»)"
    },
    "G1019": {
      "name": "Исполнитель: MoustachedBouncer",
      "description": "[MoustachedBouncer] (https://attack.mitre.org/groups/G1019) — группа кибершпионажа, которая ведет активную деятельность по крайней мере с 2014 года в отношении иностранных посольств в Беларуси. (цитата: MoustachedBouncer ESET August 2023)"
    },
    "G1028": {
      "name": "APT-C-23",
      "description": "[APT-C-23] (https://attack.mitre.org/groups/G1028) является группой угроз, которая была активна, по крайней мере, с 2014 года. (цитата: symantec mantis) [APT-C-23] (https://attack.mitre.org/groups/G1028) в основном сосредоточила свои операции на Ближнем Востоке, включая израильские военные активы. [APT-C-23] (https://attack.mitre.org/groups/G1028) с 2017 года разрабатывает мобильные шпионские программы, нацеленные на устройства Android и iOS."
    },
    "G1029": {
      "name": "UNC 788",
      "description": "[UNC788] (https://attack.mitre.org/groups/G1029) - группа хакеров из Ирана, которые нацелились на людей на Ближнем Востоке."
    },
    "G1033": {
      "name": "Звезда Blizzard",
      "description": "[Star Blizzard] (https://attack.mitre.org/groups/G1033) — группа кибершпионажа и влияния, происходящая из России, которая активна как минимум с 2019 года. Кампании [Star Blizzard] (https://attack.mitre.org/groups/G1033) тесно связаны с российскими государственными интересами и включают постоянные фишинговые и кражу учетных данных против академических, оборонных, правительственных, неправительственных и аналитических организаций в странах НАТО, особенно в США и Великобритании. (Citation: Microsoft Star Blizzard August 2022) (Citation: CISA Star Blizzard Advisory December 2023) (Citation: StarBlizzard) (Citation: Google TAG COLDRIVER January 2024)"
    }
  },
  "software": {
    "S0182": {
      "name": "Финфишер",
      "description": "[FinFisher] (https://attack.mitre.org/software/S0182) - это шпионское ПО коммерческого наблюдения государственного уровня, которое, как сообщается, продается исключительно государственным учреждениям для использования в целенаправленных и законных уголовных расследованиях. Он сильно запутан и использует несколько методов антианализа. Он имеет другие варианты, включая [Wingbird] (https://attack.mitre.org/software/S0176). (Citation: FinFisher Citation) (Citation: Microsoft SIR Vol 21) (Citation: FireEye FinSpy Sept 2017) (Citation: Securelist BlackOasis Oct 2017) (Citation: Microsoft FinFisher March 2018)"
    },
    "S0285": {
      "name": "Old Boot",
      "description": "[OldBoot] (https://attack.mitre.org/software/S0285) — семейство вредоносных программ для Android. (перенаправлено с «HackerNews-OldBoot»)"
    },
    "S0286": {
      "name": "БАД",
      "description": "OBAD - это семейство вредоносных программ для Android. (перенаправлено с «TrendMicro-Obad»)"
    },
    "S0287": {
      "name": "Зергхельпер",
      "description": "[ZergHelper] (https://attack.mitre.org/software/S0287) - это рисковое ПО для iOS, которое было уникальным из-за его явного уклонения от процесса обзора Apple App Store. В приложении не было обнаружено вредоносных функций, но оно представляет угрозу безопасности. (перенаправлено с «Xiao-ZergHelper»)"
    },
    "S0288": {
      "name": "KeyRaider",
      "description": "[KeyRaider] (https://attack.mitre.org/software/S0288) — вредоносное ПО, которое крадет учетные данные Apple и другие данные с взломанных устройств iOS. Он также имеет функциональность ransomware. (перенаправлено с «Xiao-KeyRaider»)"
    },
    "S0289": {
      "name": "Pegasus для iOS",
      "description": "[Pegasus для iOS] (https://attack.mitre.org/software/S0289) — версия вредоносного ПО для iOS, которая, как сообщается, была связана с NSO Group. Он рекламировался и продавался для нацеливания на жертв с высокой стоимостью. (цитата: Lookout-Pegasus) (цитата: PegasusCitizenLab) Версия для Android отслеживается отдельно в разделе [Pegasus для Android] (https://attack.mitre.org/software/S0316)."
    },
    "S0290": {
      "name": "Гулиган",
      "description": "[Gooligan] (https://attack.mitre.org/software/S0290) - это семейство вредоносных программ, которое запускает эксплойты эскалации привилегий на устройствах Android, а затем использует свои расширенные привилегии для кражи токенов аутентификации, которые могут использоваться для доступа к данным из многих приложений Google. [Gooligan] (https://attack.mitre.org/software/S0290) был описан как часть семейства вредоносных программ для Android Ghost Push. (Citation: Gooligan Citation) (Citation: Ludwig-GhostPush) (Citation: Lookout-Gooligan)"
    },
    "S0291": {
      "name": "PJApps",
      "description": "[PJApps] (https://attack.mitre.org/software/S0291) — семейство вредоносных программ для Android. (перенаправлено с «Lookout-EnterpriseApps»)"
    },
    "S0292": {
      "name": "Андрората",
      "description": "[AndroRAT] (https://attack.mitre.org/software/S0292) - это инструмент удаленного доступа с открытым исходным кодом для устройств Android. [AndroRAT](https://attack.mitre.org/software/S0292) способен собирать данные, такие как местоположение устройства, журналы вызовов и т.д., и способен выполнять действия, такие как отправка SMS-сообщений и фотографирование.(Citation: Lookout-EnterpriseApps)(Citation: github androrat)(Citation: Forcepoint BITTER Pakistan Oct 2016) Первоначально он доступен через репозиторий The404Hacking Github. (перенаправлено с «github androrat»)"
    },
    "S0293": {
      "name": "Тест на мозг",
      "description": "[BrainTest] (https://attack.mitre.org/software/S0293) — семейство вредоносных программ для Android. (перенаправлено с «CheckPoint-BrainTest»)"
    },
    "S0294": {
      "name": "Сдвиг Бага",
      "description": "[ShiftyBug] (https://attack.mitre.org/software/S0294) - это семейство автоматических рекламных программ для Android. Семья очень похожа на другие семейства Android, известные как Shedun, Shuanet, Kemoge, хотя не все семьи были созданы одной группой. (перенаправлено с «Lookout-Adware»)"
    },
    "S0295": {
      "name": "RCSAndroid",
      "description": "[RCSAndroid] (https://attack.mitre.org/software/S0295) — вредоносное ПО для Android. (перенаправлено с «TrendMicro-RCSAndroid»)"
    },
    "S0297": {
      "name": "Xcode Ghost",
      "description": "[XcodeGhost] (https://attack.mitre.org/software/S0297) — вредоносное ПО для iOS, которое заразило по меньшей мере 39 приложений iOS в 2015 году и потенциально затронуло миллионы пользователей. (перенаправлено с «PaloAlto-XcodeGhost1)»"
    },
    "S0298": {
      "name": "Xbot",
      "description": "[Xbot] (https://attack.mitre.org/software/S0298) — семейство вредоносных программ для Android, которое наблюдалось в 2016 году и в первую очередь ориентировано на пользователей Android в России и Австралии. (перенаправлено с «PaloAlto-Xbot»)"
    },
    "S0299": {
      "name": "Несовместимый",
      "description": "[NotCompatible] (https://attack.mitre.org/software/S0299) — семейство вредоносных программ для Android, которое использовалось как минимум с 2014 по 2016 год. Он имеет несколько вариантов, которые со временем стали более сложными. (перенаправлено с «Lookout-NotCompatible»)"
    },
    "S0300": {
      "name": "Дресскод",
      "description": "[DressCode] (https://attack.mitre.org/software/S0300) — семейство вредоносных программ для Android. (перенаправлено с «TrendMicro-DressCode»)"
    },
    "S0301": {
      "name": "Дендроид",
      "description": "[Dendroid] (https://attack.mitre.org/software/S0301) - это инструмент удаленного доступа Android (RAT), предназначенный в первую очередь для западных стран. RAT был доступен для покупки за 300 долларов и поставляется в комплекте с утилитой для внедрения RAT в законные приложения. (перенаправлено с «Lookout-Dendroid»)"
    },
    "S0302": {
      "name": "Твитор",
      "description": "[Twitoor] (https://attack.mitre.org/software/S0302) - это приложение, способное принимать команды из социальных сетей."
    },
    "S0303": {
      "name": "Мазарбот",
      "description": "[MazarBOT] (https://attack.mitre.org/software/S0303) — вредоносное ПО для Android, которое было распространено через SMS в Дании в 2016 году. (перенаправлено с «Tripwire-MazarBOT»)"
    },
    "S0304": {
      "name": "Android/Chuli.A",
      "description": "[Android/Chuli.A] (https://attack.mitre.org/software/S0304) - это вредоносное ПО для Android, которое было доставлено группам активистов по электронной почте с вложением. (перенаправлено с « Kaspersky-WUC»)"
    },
    "S0305": {
      "name": "SpyNote RAT",
      "description": "[SpyNote RAT] (https://attack.mitre.org/software/S0305) (троян удаленного доступа) — семейство вредоносных приложений для Android. Инструмент [SpyNote RAT] (https://attack.mitre.org/software/S0305) можно использовать для разработки вредоносных приложений с функциональностью вредоносного ПО. (перенаправлено с «Zscaler-SpyNote»)"
    },
    "S0306": {
      "name": "Trojan-SMS.AndroidOS.FakeInst.a",
      "description": "[Trojan-SMS.AndroidOS.FakeInst.a] (https://attack.mitre.org/software/S0306) является вредоносным ПО для Android. (перенаправлено с « Kaspersky-MobileMalware»)"
    },
    "S0307": {
      "name": "Trojan-SMS.AndroidOS.Agent.ao",
      "description": "[Trojan-SMS.AndroidOS.Agent.ao] (https://attack.mitre.org/software/S0307) является вредоносным ПО для Android. (перенаправлено с « Kaspersky-MobileMalware»)"
    },
    "S0308": {
      "name": "Trojan-SMS.AndroidOS.OpFake.a",
      "description": "[Trojan-SMS.AndroidOS.OpFake.a] (https://attack.mitre.org/software/S0308) является вредоносным ПО для Android. (перенаправлено с « Kaspersky-MobileMalware»)"
    },
    "S0309": {
      "name": "Объятия",
      "description": "[Adups] (https://attack.mitre.org/software/S0309) - это программное обеспечение, которое было предварительно установлено на устройства Android, включая те, которые сделаны BLU Products. Программное обеспечение было разработано, чтобы помочь китайскому производителю телефонов контролировать поведение пользователей, передавая конфиденциальные данные на китайский сервер. (перенаправлено с «BankInfoSecurity-BackDoor»)"
    },
    "S0310": {
      "name": "Androidos ANSERVER.A",
      "description": "[ANDROIDOS ANSERVER.A] (https://attack.mitre.org/software/S0310) - это вредоносное ПО для Android, которое является уникальным, поскольку оно использует зашифрованный контент на сайте блога для командования и управления. (перенаправлено с «TrendMicro-Anserver»)"
    },
    "S0311": {
      "name": "Yispecter",
      "description": "[YiSpecter] (https://attack.mitre.org/software/S0311) — семейство вредоносных программ для iOS и Android, впервые обнаруженных в ноябре 2014 года, нацеленных на пользователей в материковом Китае и Тайване. [YiSpecter] (https://attack.mitre.org/software/S0311) злоупотребляет частными API-интерфейсами в iOS, чтобы заразить как взломанные, так и не взломанные устройства. (цитата: paloalto yispecter 1015)"
    },
    "S0312": {
      "name": "WireLurker",
      "description": "[WireLurker] (https://attack.mitre.org/software/S0312) представляет собой семейство вредоносных программ для macOS, которые нацелены на устройства iOS, подключенные через USB. (перенаправлено с «PaloAlto-WireLurker»)"
    },
    "S0313": {
      "name": "Руммс",
      "description": "[RuMMS] (https://attack.mitre.org/software/S0313) — семейство вредоносных программ для Android. (перенаправлено с «FireEye-RuMMS»)"
    },
    "S0314": {
      "name": "X-Agent для Android",
      "description": "[X-Agent for Android] (https://attack.mitre.org/software/S0314) - это вредоносное ПО для Android, которое было помещено в переупакованную версию приложения украинской артиллерии. Вредоносная программа, как сообщается, получила общие данные о местоположении, где было использовано устройство жертвы, и, следовательно, может указывать на потенциальное местоположение украинской артиллерии. (перенаправлено с «CrowdStrike-Android») Отслеживается ли он отдельно от [CHOPSTICK] (https://attack.mitre.org/software/S0023)."
    },
    "S0315": {
      "name": "DualToy",
      "description": "[DualToy] (https://attack.mitre.org/software/S0315) - это вредоносное ПО для Windows, которое устанавливает вредоносные приложения на устройства Android и iOS, подключенные через USB. (перенаправлено с «PaloAlto-DualToy»)"
    },
    "S0316": {
      "name": "Pegasus для Android",
      "description": "[Pegasus для Android] (https://attack.mitre.org/software/S0316) — версия вредоносного ПО для Android, которая, как сообщается, была связана с NSO Group. (перенаправлено с «Lookout-PegasusAndroid») (перенаправлено с «Google-Chrysaor») Версия iOS отслеживается отдельно в разделе [Pegasus для iOS] (https://attack.mitre.org/software/S0289)."
    },
    "S0318": {
      "name": "XLoader для Android",
      "description": "[XLoader для Android] (https://attack.mitre.org/software/S0318) — вредоносное приложение для Android, впервые обнаруженное в Японии, Корее, Китае, Тайване и Гонконге в 2018 году. Совсем недавно было замечено, что он нацелен на южнокорейских пользователей в качестве приложения для порнографии. Он отслеживается отдельно от [XLoader для iOS] (https://attack.mitre.org/software/S0490)."
    },
    "S0319": {
      "name": "победитель",
      "description": "[Allwinner] (https://attack.mitre.org/software/S0319) — компания, поставляющая процессоры, используемые в планшетах Android и других устройствах. Ядро Linux, распространяемое Allwinner (https://attack.mitre.org/software/S0319) для использования на этих устройствах, как сообщается, содержало бэкдор. (перенаправлено с «HackerNews-Allwinner»)"
    },
    "S0320": {
      "name": "Дроид Джек",
      "description": "[DroidJack] (https://attack.mitre.org/software/S0320) - это инструмент удаленного доступа к Android, который считается законным приложением, включая Super Mario Run и игры Pokemon GO. (Цитирование: Zscaler-SuperMarioRun) (Цитирование: Proofpoint-Droidjack)"
    },
    "S0321": {
      "name": "Колибри",
      "description": "[HummingWhale] (https://attack.mitre.org/software/S0321) - семейство вредоносных программ для Android, которое выполняет рекламное мошенничество. (перенаправлено с «ArsTechnica-HummingWhale»)"
    },
    "S0322": {
      "name": "Неудобный",
      "description": "[HummingBad] (https://attack.mitre.org/software/S0322) - это семейство вредоносных программ для Android, которое генерирует мошеннический рекламный доход и имеет возможность получать корневой доступ к более старым, уязвимым версиям Android. (перенаправлено с «ArsTechnica-HummingBad»)"
    },
    "S0323": {
      "name": "Зарядка",
      "description": "[Charger] (https://attack.mitre.org/software/S0323) — вредоносное ПО для Android, которое крадет контакты и SMS-сообщения с устройства пользователя. Он также может заблокировать устройство и потребовать выкупа, если он получает разрешения администратора. (перенаправлено с «CheckPoint-Charger»)"
    },
    "S0324": {
      "name": "SpyDealer",
      "description": "[SpyDealer] (https://attack.mitre.org/software/S0324) - это вредоносное ПО для Android, которое извлекает конфиденциальные данные с устройств Android. (перенаправлено с «PaloAlto-SpyDealer»)"
    },
    "S0325": {
      "name": "Джуди",
      "description": "[Judy] (https://attack.mitre.org/software/S0325) - это рекламное ПО с автоматическим щелчком мыши, которое распространялось через несколько приложений в Google Play Store. (перенаправлено с «CheckPoint-Judy»)"
    },
    "S0326": {
      "name": "RedDrop",
      "description": "[RedDrop] (https://attack.mitre.org/software/S0326) - семейство вредоносных программ для Android, которое извлекает конфиденциальные данные с устройств. (перенаправлено с «Wandera-RedDrop»)"
    },
    "S0327": {
      "name": "Skygofree",
      "description": "[Skygofree] (https://attack.mitre.org/software/S0327) — шпионское ПО для Android, которое, как полагают, было разработано в 2014 году и использовалось по крайней мере до 2017 года. (перенаправлено с « Kaspersky-Skygofree»)"
    },
    "S0328": {
      "name": "Стелс Манго",
      "description": "[Stealth Mango] (https://attack.mitre.org/software/S0328) — вредоносное ПО для Android, которое, как сообщается, использовалось для успешной компрометации мобильных устройств правительственных чиновников, военнослужащих, медицинских работников и гражданских лиц. Вредоносное ПО iOS, известное как [Tangelo] (https://attack.mitre.org/software/S0329), как полагают, принадлежит тому же разработчику. (перенаправлено с «Lookout-StealthMango»)"
    },
    "S0329": {
      "name": "Тангело",
      "description": "[Tangelo] (https://attack.mitre.org/software/S0329) - это вредоносное ПО для iOS, которое, как полагают, принадлежит тем же разработчикам, что и вредоносное ПО для Android [Stealth Mango] (https://attack.mitre.org/software/S0328). Это не мобильное приложение, а пакет Debian, который может работать только на взломанных устройствах iOS. (перенаправлено с «Lookout-StealthMango»)"
    },
    "S0399": {
      "name": "Паллас",
      "description": "[Pallas] (https://attack.mitre.org/software/S0399) - это программное обеспечение для мобильного наблюдения, разработанное по заказу [Dark Caracal] (https://attack.mitre.org/groups/G0070). (Citation: Lookout Dark Caracal Jan 2018)"
    },
    "S0403": {
      "name": "Рильто",
      "description": "[Riltok] (https://attack.mitre.org/software/S0403) - это банковское вредоносное ПО, которое использует фишинговые всплывающие окна для сбора учетных данных пользователей. (Изображение: Kaspersky Riltok, июнь 2019)"
    },
    "S0405": {
      "name": "исход",
      "description": "[Exodus] (https://attack.mitre.org/software/S0405) - это шпионское ПО для Android, развернутое в два отдельных этапа под названием Exodus One (ударник) и Exodus Two (полезная нагрузка)."
    },
    "S0406": {
      "name": "начинка",
      "description": "[Gustuff] (https://attack.mitre.org/software/S0406) - это мобильное вредоносное ПО, предназначенное для кражи банковских и виртуальных учетных данных пользователей. (перенаправлено с «Talos Gustuff Apr 2019»)"
    },
    "S0407": {
      "name": "Монокль",
      "description": "[Monokle] (https://attack.mitre.org/software/S0407) является целевым, сложным мобильным программным обеспечением для наблюдения. Он разработан для Android, но есть некоторые артефакты кода, которые предполагают, что версия iOS может быть в разработке."
    },
    "S0408": {
      "name": "FlexiSpy",
      "description": "[FlexiSpy] (https://attack.mitre.org/software/S0408) является сложным программным обеспечением для наблюдения за iOS и Android. Публично доступный комплексный анализ был найден только для версии Android. (Citation: FortiGuard-FlexiSpy)\n\n[FlexiSpy] (https://attack.mitre.org/software/S0408) позиционирует себя как приложение для родительского контроля и мониторинга сотрудников."
    },
    "S0411": {
      "name": "Ротекс",
      "description": "[Rotexy] (https://attack.mitre.org/software/S0411) - это банковское вредоносное ПО для Android, которое развивалось в течение нескольких лет. Первоначально это был шпионский троянец SMS, впервые обнаруженный в октябре 2014 года, и с тех пор он стал содержать больше функций, включая функциональность вымогателей. (перенаправлено с «Securedlist rotexy 2018»)"
    },
    "S0418": {
      "name": "Вице-ликер",
      "description": "[ViceLeaker] (https://attack.mitre.org/software/S0418) - это шпионская платформа, способная проводить обширные операции по наблюдению и удалению данных, в первую очередь нацеленная на устройства, принадлежащие гражданам Израиля. (Citation: SecureList - ViceLeaker 2019) (Citation: Bitdefender - Triout 2018)"
    },
    "S0419": {
      "name": "Симбад",
      "description": "[SimBad] (https://attack.mitre.org/software/S0419) был штаммом рекламного ПО в Google Play Store, распространяемого через RXDroider Software Development Kit. Название «SimBad» произошло от того, что большинство зараженных приложений были играми-симуляторами. Рекламное ПО управлялось с помощью экземпляра фреймворка с открытым исходным кодом Parse Server.(Citation: CheckPoint SimBad 2019)"
    },
    "S0420": {
      "name": "Dvmap",
      "description": "[Dvmap] (https://attack.mitre.org/software/S0420) - это корневая вредоносная программа, которая вводит вредоносный код в библиотеки времени выполнения системы. Считается, что это первая вредоносная программа, которая выполняет этот тип инъекции кода. (цитата: SecureList DVMap, июнь 2017 года)"
    },
    "S0421": {
      "name": "GolfSpy",
      "description": "[GolfSpy] (https://attack.mitre.org/software/S0421) - это шпионское ПО для Android, развернутое группой [Bouncing Golf] (https://attack.mitre.org/groups/G0097)."
    },
    "S0422": {
      "name": "Анубис",
      "description": "[Anubis] (https://attack.mitre.org/software/S0422) - это вредоносное ПО для Android, которое первоначально использовалось для кибершпионажа и было переоборудовано в банковский троян. (перенаправлено с «Cofense Anubis»)"
    },
    "S0423": {
      "name": "гинп",
      "description": "[Ginp] (https://attack.mitre.org/software/S0423) - это банковский троян Android, который используется для таргетинга на испанские банки. Часть кода была взята непосредственно из [Anubis] (https://attack.mitre.org/software/S0422)."
    },
    "S0424": {
      "name": "Триада",
      "description": "[Triada] (https://attack.mitre.org/software/S0424) была впервые зарегистрирована в 2016 году как вредоносная программа второго этапа. Более поздние версии в 2019 году появились с новыми технологиями и в качестве первоначального загрузчика других троянских приложений. (цитата: Kaspersky Triada March 2016)"
    },
    "S0425": {
      "name": "Обновления Corona",
      "description": "[Corona Updates] (https://attack.mitre.org/software/S0425) — шпионское ПО для Android, которое воспользовалось пандемией коронавируса. Кампания по распространению этого шпионского ПО отслеживается как Project Spy. Было обнаружено, что несколько вариантов этого шпионского ПО размещались в Google Play Store. (цитата: TrendMicro Coronavirus Updates)"
    },
    "S0426": {
      "name": "Консипит1248",
      "description": "[Concipit1248] (https://attack.mitre.org/software/S0426) - это шпионское ПО для iOS, которое было обнаружено с использованием того же имени, что и разработчик шпионского ПО для Android [Corona Updates] (https://attack.mitre.org/software/S0425). Дальнейшее исследование показало, что два компонента программного обеспечения содержали один и тот же URL-адрес C2 и аналогичную функциональность. (перенаправлено с «TrendMicro Coronavirus Updates»)"
    },
    "S0427": {
      "name": "Трикмо",
      "description": "[TrickMo] (https://attack.mitre.org/software/S0427) троян для мобильного банкинга в обход 2FA, скорее всего, распространяемый [TrickBot] (https://attack.mitre.org/software/S0266). [TrickMo] (https://attack.mitre.org/software/S0427) в основном ориентирован на пользователей, находящихся в Германии. (Citation: SecurityIntelligence TrickMo)\n\n[TrickMo] (https://attack.mitre.org/software/S0427) предназначен для кражи номеров авторизации транзакций (TAN), которые обычно используются в качестве одноразовых паролей. (перенаправлено с «SecurityIntelligence TrickMo»)"
    },
    "S0432": {
      "name": "Хлеб",
      "description": "[Хлеб] (https://attack.mitre.org/software/S0432) был крупномасштабным семейством вредоносных программ для мошенничества с выставлением счетов, известным использованием множества различных методов маскировки и запутывания в попытке постоянно уклоняться от обнаружения вредоносных программ Google Play Store. 1700 уникальных приложений Bread были обнаружены и удалены из Google Play Store до загрузки пользователями."
    },
    "S0440": {
      "name": "Агент Смит",
      "description": "[Агент Смит] (https://attack.mitre.org/software/S0440) - это мобильное вредоносное ПО, которое генерирует финансовую выгоду, заменяя законные приложения на устройствах вредоносными версиями, которые включают мошенническую рекламу. По состоянию на июль 2019 года [агент Смит] (https://attack.mitre.org/software/S0440) заразил около 25 миллионов устройств, в основном нацеленных на Индию, хотя эффекты наблюдались в других азиатских странах, а также в Саудовской Аравии, Великобритании и США."
    },
    "S0463": {
      "name": "Инсомния",
      "description": "[INSOMNIA] (https://attack.mitre.org/software/S0463) — шпионское ПО, используемое группой Evil Eye."
    },
    "S0478": {
      "name": "СобытиеBot",
      "description": "[EventBot] (https://attack.mitre.org/software/S0478) — банковский троян Android и угонщик информации, злоупотребляющий службой доступности Android для кражи данных из различных приложений. (Citation: Cybereason EventBot) [EventBot] (https://attack.mitre.org/software/S0478) был разработан для более чем 200 различных банковских и финансовых приложений, большинство из которых являются европейскими банковскими и криптовалютными приложениями. (перенаправлено с «Cybereason EventBot»)"
    },
    "S0479": {
      "name": "Идентификатор защиты",
      "description": "[DEFENSOR ID] (https://attack.mitre.org/software/S0479) - банковский троян, способный очистить банковский счет жертвы или криптовалютный кошелек и взять на себя учетные записи электронной почты или социальных сетей. [DEFENSOR ID] (https://attack.mitre.org/software/S0479) выполняет большую часть своей вредоносной функциональности, злоупотребляя службой доступности Android. (перенаправлено с «ESET DEFENSOR ID»)"
    },
    "S0480": {
      "name": "Цербер",
      "description": "[Cerberus] (https://attack.mitre.org/software/S0480) — банковский троян, использование которого можно арендовать на подпольных форумах и маркетплейсах. До того, как стать доступными для аренды, авторы заявления [Cerberus] (https://attack.mitre.org/software/S0480) использовались в частных операциях в течение двух лет. (перенаправлено с « Threat Fabric Cerberus»)"
    },
    "S0485": {
      "name": "Мандраж",
      "description": "[Mandrake] (https://attack.mitre.org/software/S0485) - это сложная шпионская платформа для Android, которая работает в дикой природе, по крайней мере, с 2016 года. [Mandrake] (https://attack.mitre.org/software/S0485) очень активно поддерживается, со сложными функциями и атаками, которые выполняются с хирургической точностью.\n\n[Mandrake] (https://attack.mitre.org/software/S0485) остается незамеченным в течение нескольких лет, предоставляя законные, без рекламы приложения с социальными сетями и реальными отзывами для поддержки приложений. Вредоносная программа активируется только тогда, когда операторы выдают конкретную команду."
    },
    "S0489": {
      "name": "Вольфрейт",
      "description": "[WolfRAT] (https://attack.mitre.org/software/S0489) - вредоносное ПО, основанное на утечке версии [Dendroid] (https://attack.mitre.org/software/S0301), которое в основном нацелено на тайских пользователей. [WolfRAT] (https://attack.mitre.org/software/S0489), скорее всего, управлялась ныне несуществующей организацией Wolf Research."
    },
    "S0490": {
      "name": "XLoader для iOS",
      "description": "[XLoader для iOS] (https://attack.mitre.org/software/S0490) — вредоносное приложение для iOS, способное собирать системную информацию. Отслеживается отдельно от XLoader для Android (https://attack.mitre.org/software/S0318)."
    },
    "S0494": {
      "name": "Дзен",
      "description": "[Zen] (https://attack.mitre.org/software/S0494) - это вредоносное ПО для Android, которое впервые было замечено в 2013 году."
    },
    "S0505": {
      "name": "Пустынный скорпион",
      "description": "[Desert Scorpion] (https://attack.mitre.org/software/S0505) — это программа наблюдения, нацеленная на Ближний Восток, особенно на лиц, находящихся в Палестине. [Desert Scorpion] (https://attack.mitre.org/software/S0505) предположительно управлялся субъектом угрозы [APT-C-23] (https://attack.mitre.org/groups/G1028).\n\nСуществует несколько близких вариантов [Desert Scorpion] (https://attack.mitre.org/software/S0505), таких как VAMP (Citation: Unit42 VAMP 2017), GnatSpy (Citation: Trendmicro GnatSpy 2017), [FrozenCell] (https://attack.mitre.org/software/S0577) и [SpyC23] (https://attack.mitre.org/software/S1195), которые добавляют некоторые дополнительные функции, но не существенно отличаются от исходного вредоносного ПО."
    },
    "S0506": {
      "name": "Виперрат",
      "description": "[ViperRAT] (https://attack.mitre.org/software/S0506) - это сложное программное обеспечение для наблюдения, которое работает, по крайней мере, с 2015 года и использовалось для нацеливания на Силы обороны Израиля."
    },
    "S0507": {
      "name": "eSurv",
      "description": "[eSurv] (https://attack.mitre.org/software/S0507) - это мобильное ПО для наблюдения, предназначенное для законного рынка перехвата, которое было разработано в течение многих лет. (перенаправлено с «Lookout eSurv»)"
    },
    "S0509": {
      "name": "Фальшивый шпион",
      "description": "[FakeSpy] (https://attack.mitre.org/software/S0509) - это шпионское ПО для Android, которое управляется китайским субъектом угроз, стоящим за кампаниями Roaming Mantis."
    },
    "S0522": {
      "name": "Экзобот",
      "description": "[Exobot] (https://attack.mitre.org/software/S0522) - это банковское вредоносное ПО для Android, в первую очередь предназначенное для финансовых учреждений в Германии, Австрии и Франции."
    },
    "S0524": {
      "name": "AndroidOS/MalLocker.B",
      "description": "[AndroidOS/MalLocker.B] (https://attack.mitre.org/software/S0524) является вариантом семейства вымогателей, нацеленных на устройства Android. Он предотвращает взаимодействие пользователя с пользовательским интерфейсом, отображая экран, содержащий заметку о выкупе, по всем другим окнам. (перенаправлено с «Microsoft MalLockerB»)"
    },
    "S0525": {
      "name": "Android / AdDisplay. Аша",
      "description": "[Android/AdDisplay.Ashas] (https://attack.mitre.org/software/S0525) является вариантом рекламного ПО, которое было распространено через несколько приложений в Google Play Store. (перенаправлено с «WeLiveSecurity AdDisplayAshas»)"
    },
    "S0529": {
      "name": "Уголь углерода",
      "description": "[CarbonSteal] (https://attack.mitre.org/software/S0529) является одним из семейства четырех средств видеонаблюдения, которые имеют общую инфраструктуру C2. [CarbonSteal] (https://attack.mitre.org/software/S0529) в основном занимается аудионаблюдением. (перенаправлено с «Lookout Uyghur Campaign»)"
    },
    "S0535": {
      "name": "Золотой кубок",
      "description": "[Golden Cup] (https://attack.mitre.org/software/S0535) - это шпионское ПО для Android, которое использовалось для нацеливания на фанатов чемпионата мира."
    },
    "S0536": {
      "name": "GPlayed",
      "description": "[GPlayed] (https://attack.mitre.org/software/S0536) - троян Android с широким спектром возможностей."
    },
    "S0539": {
      "name": "Красная тревога 2.0",
      "description": "[Red Alert 2.0] (https://attack.mitre.org/software/S0539) — банковский троян, маскирующийся под VPN-клиента."
    },
    "S0540": {
      "name": "Асакуб",
      "description": "[Asacub] (https://attack.mitre.org/software/S0540) — банковский троян, который пытается украсть деньги с банковских счетов жертв. Он пытается сделать это, инициируя банковский перевод через SMS-сообщение с скомпрометированных устройств. (перенаправлено с «Securelist Asacub»)"
    },
    "S0544": {
      "name": "Хенбокс",
      "description": "[HenBox] (https://attack.mitre.org/software/S0544) - это вредоносное ПО для Android, которое пытается выполняться только на устройствах Xiaomi, работающих под управлением операционной системы MIUI. [HenBox] (https://attack.mitre.org/software/S0544) в основном используется для нацеливания на уйгуров, тюркскую этническую группу меньшинства."
    },
    "S0545": {
      "name": "Терракотта",
      "description": "[TERRACOTTA] (https://attack.mitre.org/software/S0545) - это ботнет для мошенничества с рекламой, который способен генерировать более 2 миллиардов мошеннических запросов в неделю. (перенаправлено с «WhiteOps TERRACOTTA»)"
    },
    "S0549": {
      "name": "Шелковый",
      "description": "[SilkBean] (https://attack.mitre.org/software/S0549) - это часть программного обеспечения для наблюдения за Android, содержащая полный инструмент удаленного доступа (RAT), который использовался для таргетинга на уйгурскую этническую группу."
    },
    "S0550": {
      "name": "Двойной агент",
      "description": "[DoubleAgent] (https://attack.mitre.org/software/S0550) - семейство вредоносных программ RAT, датируемое 2013 годом, известное целевым группам с спорными отношениями с китайским правительством. (перенаправлено с «Lookout Uyghur Campaign»)"
    },
    "S0551": {
      "name": "Золотой Орел",
      "description": "[GoldenEagle] (https://attack.mitre.org/software/S0551) — это часть вредоносного ПО для Android, которое используется для атак на уйгуров, мусульман, тибетцев, людей в Турции и людей в Китае. Образцы были найдены еще в 2012 году. (цитата: Lookout Uyghur Campaign)"
    },
    "S0555": {
      "name": "Химистические игры",
      "description": "[CHEMISTGAMES] (https://attack.mitre.org/software/S0555) - модульный бэкдор, развернутый [Sandworm Team] (https://attack.mitre.org/groups/G0034)."
    },
    "S0558": {
      "name": "Tiktok Pro",
      "description": "[Tiktok Pro] (https://attack.mitre.org/software/S0558) - это шпионское ПО, которое маскируется под приложение TikTok."
    },
    "S0577": {
      "name": "Замороженная клетка",
      "description": "[FrozenCell] (https://attack.mitre.org/software/S0577) является мобильным компонентом семейства программ наблюдения, с соответствующим настольным компонентом, известным как KasperAgent и [Micropsia] (https://attack.mitre.org/software/S0339).\n\nСуществует несколько близких вариантов [FrozenCell] (https://attack.mitre.org/software/S0577), таких как VAMP (Citation: Unit42 VAMP 2017), GnatSpy (Citation: Trendmicro GnatSpy 2017), [Desert Scorpion] (https://attack.mitre.org/software/S0505) и [SpyC23] (https://attack.mitre.org/software/S1195), которые добавляют некоторые дополнительные функции, но не существенно отличаются от исходного вредоносного ПО."
    },
    "S0602": {
      "name": "Круги",
      "description": "[Circles] (https://attack.mitre.org/software/S0602), как сообщается, использует недостатки системы 7 (SS7) сигнализации, набор протоколов, используемых для маршрутизации телефонных звонков, для отслеживания местоположения мобильных устройств и перехвата голосовых вызовов и SMS-сообщений. Он может быть подключен к инфраструктуре телекоммуникационной компании или приобретен в качестве облачного сервиса. Сообщалось, что Circles были связаны с NSO Group."
    },
    "S0655": {
      "name": "BusyGasper",
      "description": "[BusyGasper] (https://attack.mitre.org/software/S0655) — шпионское ПО для Android, используемое с мая 2016 года. Было менее 10 жертв, все из которых, по-видимому, находятся в России, которые были инфицированы через физический доступ к устройству."
    },
    "S1054": {
      "name": "Дриник",
      "description": "[Drinik] (https://attack.mitre.org/software/S1054) - это развивающийся банковский троян Android, который был замечен в отношении клиентов около 27 банков в Индии в августе 2021 года. Первоначально рассматриваемый как угонщик SMS в 2016 году, [Drinik] (https://attack.mitre.org/software/S1054) появился в качестве банковского трояна с более продвинутыми возможностями, включенными в последующие версии в период с сентября 2021 года по август 2022 года."
    },
    "S1055": {
      "name": "Шаркбот",
      "description": "[SharkBot] (https://attack.mitre.org/software/S1055) — банковская вредоносная программа, впервые обнаруженная в октябре 2021 года, которая пытается инициировать денежные переводы непосредственно с скомпрометированных устройств, злоупотребляя Услугами Доступности."
    },
    "S1056": {
      "name": "TianySpy",
      "description": "[TianySpy] (https://attack.mitre.org/software/S1056) - это мобильное вредоносное ПО, распространяемое преимущественно посредством SMS-фишинга в период с 30 сентября по 12 октября 2021 года. [TianySpy] (https://attack.mitre.org/software/S1056), как полагают, имеет целевые учетные данные, связанные с веб-сайтами членства основных японских телекоммуникационных служб. (цитата: trendmicro tianyspy 0122)"
    },
    "S1061": {
      "name": "АбстрактЭму",
      "description": "[AbstractEmu] (https://attack.mitre.org/software/S1061) — это мобильное вредоносное ПО, которое впервые было замечено в Google Play и других сторонних магазинах в октябре 2021 года. Он был обнаружен в 19 приложениях Android, из которых по меньшей мере 7 злоупотребляли известными эксплойтами Android для получения корневых разрешений. [AbstractEmu] (https://attack.mitre.org/software/S1061) наблюдалось в первую очередь воздействие на пользователей в Соединенных Штатах, однако жертвы, как полагают, находятся в общей сложности в 17 странах."
    },
    "S1062": {
      "name": "С.О.В.А.",
      "description": "[S.O.V.A.] (https://attack.mitre.org/software/S1062) - это банковский троян Android, который был впервые идентифицирован в августе 2021 года и впоследствии был обнаружен в различных приложениях, включая банковские, криптовалютные кошельки/биржи и приложения для покупок. [S.O.V.A.] (https://attack.mitre.org/software/S1062), который является российским для «сов», содержит функции, обычно не встречающиеся в вредоносных программах Android, такие как кража файлов cookie сессии. (Citation: threatfabric sova 0921) (Citation: cleafy sova 1122)"
    },
    "S1067": {
      "name": "FluBot",
      "description": "[FluBot] (https://attack.mitre.org/software/S1067) — многоцелевое мобильное банковское вредоносное ПО, которое впервые было замечено в Испании в конце 2020 года. Он в основном распространяется по европейским странам с использованием различных SMS-фишинговых сообщений на нескольких языках.(Ссылка: proofpoint flubot 0421)(Ссылка: bitdefender flubot 0524) Международная правоохранительная операция 11 стран в конечном итоге нарушила распространение [FluBot] (https://attack.mitre.org/software/S1067)."
    },
    "S1069": {
      "name": "Интервал",
      "description": "[TangleBot] (https://attack.mitre.org/software/S1069) — это SMS-вредоносное ПО, которое первоначально наблюдалось в сентябре 2021 года, в первую очередь нацеленное на мобильных пользователей в США и Канаде. [TangleBot] (https://attack.mitre.org/software/S1069) использовал SMS-сообщения о правилах COVID-19 и вакцинах, чтобы обмануть мобильных пользователей в загрузке вредоносного ПО, похожего на [FluBot] (https://attack.mitre.org/software/S1067) вредоносные кампании Android."
    },
    "S1077": {
      "name": "Горнбилл",
      "description": "[Hornbill] (https://attack.mitre.org/software/S1077) является одним из двух семейств мобильных вредоносных программ, которые, как известно, используются APT [Confucius] (https://attack.mitre.org/groups/G0142). Анализ показывает, что Hornbill (https://attack.mitre.org/software/S1077) был впервые активен в начале 2018 года. Хотя [Hornbill] (https://attack.mitre.org/software/S1077) и [Sunbird] (https://attack.mitre.org/software/S1082) пересекаются в основных возможностях, [Hornbill] (https://attack.mitre.org/software/S1077) имеет инструменты и поведение, предполагающие более пассивную разведку. (Citation: lookout hornbill sunbird 0221)"
    },
    "S1079": {
      "name": "Бульдспи",
      "description": "[BOULDSPY] (https://attack.mitre.org/software/S1079) — вредоносное ПО для Android, обнаруженное в начале 2023 года, с возможностями наблюдения и дистанционного управления. Анализ эксфильтрованных данных C2 показывает, что [BOULDSPY] (https://attack.mitre.org/software/S1079) в первую очередь нацелены на группы меньшинств в Иране. (цитата: lookout bouldspy 0423)"
    },
    "S1080": {
      "name": "Фейковые звонки",
      "description": "[Fakecalls] (https://attack.mitre.org/software/S1080) — троян Android, впервые обнаруженный в январе 2021 года, который маскируется под южнокорейские банковские приложения. Он имеет возможность перехватывать звонки в банковские учреждения и даже поддерживать реалистичные диалоги с жертвой, используя предварительно записанные аудио фрагменты."
    },
    "S1082": {
      "name": "Солнечная птица",
      "description": "[Sunbird] (https://attack.mitre.org/software/S1082) является одним из двух семейств мобильных вредоносных программ, которые, как известно, используются APT [Confucius] (https://attack.mitre.org/groups/G0142). Анализ показывает, что Sunbird (https://attack.mitre.org/software/S1082) был впервые активен в начале 2017 года. В то время как [Sunbird] (https://attack.mitre.org/software/S1082) и [Hornbill] (https://attack.mitre.org/software/S1077) пересекаются в основных возможностях, [Sunbird] (https://attack.mitre.org/software/S1082) имеет более обширный набор вредоносных функций."
    },
    "S1083": {
      "name": "Хамелеон",
      "description": "[Chameleon] (https://attack.mitre.org/software/S1083) - это банковский троян Android, который может использовать службы доступности Android для выполнения вредоносных действий. Считалось, что он был впервые активен в январе 2023 года, [Chameleon] (https://attack.mitre.org/software/S1083) был замечен в качестве официального приложения. Новый вариант [Chameleon](https://attack.mitre.org/software/S1083) расширил свои цели, включив пользователей Android в Соединенное Королевство и Италию.(Citation: cyble chameleon 0423)(Citation: ThreatFabric Chameleon Dec2023)"
    },
    "S1092": {
      "name": "Эскобар",
      "description": "[Escobar] (https://attack.mitre.org/software/S1092) - банковский троян Android, впервые обнаруженный в марте 2021 года, который, как полагают, является новым вариантом AbereBot."
    },
    "S1093": {
      "name": "Летучая ловушка",
      "description": "[FlyTrap] (https://attack.mitre.org/software/S1093) — троян Android, впервые обнаруженный в марте 2021 года, который использует тактику социальной инженерии для компрометации учетных записей Facebook. FlyTrap (https://attack.mitre.org/software/S1093) был первоначально обнаружен через зараженные приложения в магазине Google Play и, как полагают, затронул более 10 000 жертв по крайней мере в 140 странах. (перенаправлено с «Trend Micro FlyTrap»)"
    },
    "S1094": {
      "name": "БРАТА",
      "description": "[BRATA] (https://attack.mitre.org/software/S1094) (Brazilian Remote Access Tool, Android), представляет собой развивающийся штамм вредоносного ПО для Android, обнаруженный в конце 2018 года и снова в конце 2021 года. Зародившись в Бразилии, [BRATA] (https://attack.mitre.org/software/S1094) позже также была обнаружена в Великобритании, Польше, Италии, Испании и США, где, как полагают, она предназначалась для финансовых учреждений, таких как банки. В настоящее время известно три варианта [BRATA](https://attack.mitre.org/software/S1094).(Citation: securelist brata 0819)(Citation: cleafy brata 0122)(Citation: mcafee brata 0421)"
    },
    "S1095": {
      "name": "Ахрат",
      "description": "[AhRat] (https://attack.mitre.org/software/S1095) - это инструмент удаленного доступа Android на основе инструмента удаленного доступа AhMyth с открытым исходным кодом. [AhRat] (https://attack.mitre.org/software/S1095) первоначально распространился в августе 2022 года в Google Play Store через обновление, содержащее вредоносный код для ранее доброкачественного приложения «iRecorder — Screen Recorder», которое само было выпущено в сентябре 2021 года."
    },
    "S1103": {
      "name": "FlixOnline",
      "description": "[FlixOnline] (https://attack.mitre.org/software/S1103) - это вредоносное ПО для Android, впервые обнаруженное в начале 2021 года, которое, как полагают, нацелено на пользователей WhatsApp. [FlixOnline] (https://attack.mitre.org/software/S1103) в основном распространяется через автоматические ответы на входящие сообщения WhatsApp на устройстве."
    },
    "S1126": {
      "name": "Фенакит",
      "description": "[Phenakite] (https://attack.mitre.org/software/S1126) - это мобильное вредоносное ПО, которое используется [APT-C-23] (https://attack.mitre.org/groups/G1028) для таргетирования устройств iOS. Согласно нескольким сообщениям, [Phenakite](https://attack.mitre.org/software/S1126) был разработан для заполнения пробела в инструментах и для нацеливания на тех, кто владел iPhone вместо настольных компьютеров Windows или телефонов Android.(Citation: sentinelone israel hamas war)(Citation: fb arid viper)"
    },
    "S1128": {
      "name": "Хилалрат",
      "description": "[HilalRAT] (https://attack.mitre.org/software/S1128) - это вредоносное ПО для Android с возможностью удаленного доступа, разработанное и используемое [UNC788] (https://attack.mitre.org/groups/G1029). (Citation: Meta Adversarial Threat Report 2022) [HilalRAT] (https://attack.mitre.org/software/S1128) способно собирать данные, такие как местоположение устройства, журналы вызовов и т.д., и способно выполнять действия, такие как активация камеры и микрофона устройства. (Citation: Meta Adversarial Threat Report 2022)"
    },
    "S1185": {
      "name": "LightSpy",
      "description": "LightSpy, впервые замеченный в 2018 году, представляет собой модульное семейство вредоносных программ, которое первоначально предназначалось для устройств iOS в Южной Азии, прежде чем перейти на платформы Android и macOS. Он состоит из загрузчика, основного исполняемого файла, который управляет сетевыми коммуникациями, и функциональных модулей, обычно реализуемых как файлы «.dylib» (iOS, macOS) или «.apk» (Android). LightSpy может собирать записи VoIP-вызовов, SMS-сообщения и учетные данные, которые затем выводятся на сервер команд и управления (C2). (цитата: Melikov BlackBerry LightSpy 2024)"
    },
    "S1195": {
      "name": "SpyC23",
      "description": "[SpyC23] (https://attack.mitre.org/software/S1195) - это мобильное вредоносное ПО, которое использовалось [APT-C-23] (https://attack.mitre.org/groups/G1028) по крайней мере с 2017 года. [SpyC23] (https://attack.mitre.org/software/S1195) в основном ориентировано на устройства Android на Ближнем Востоке.\n\nСуществует несколько близких вариантов [SpyC23] (https://attack.mitre.org/software/S1195), таких как VAMP (Citation: Unit42 VAMP 2017), GnatSpy (Citation: Trendmicro GnatSpy 2017), [Desert Scorpion] (https://attack.mitre.org/software/S0505) и [FrozenCell] (https://attack.mitre.org/software/S0577), которые добавляют некоторые дополнительные функции, но не существенно отличаются от исходного вредоносного ПО."
    },
    "S1208": {
      "name": "ФьордФантом",
      "description": "[FjordPhantom] (https://attack.mitre.org/software/S1208) — вредоносное Android-приложение, впервые обнаруженное в сентябре 2024 года с целями в Юго-Восточной Азии, в частности в Индонезии, Таиланде и Вьетнаме. [FjordPhantom] (https://attack.mitre.org/software/S1208) распространялся через приложения электронной почты и обмена сообщениями. После установки приложение запускает решение виртуализации для кражи важной информации, такой как банковские счета, и манипулирования пользовательским интерфейсом. Вредоносная активность от решения виртуализации работает вместе с законными банковскими приложениями. (цитата: Promon FjordPhantom Oct2024)"
    },
    "S1214": {
      "name": "Android/SpyAgent",
      "description": "[Android/SpyAgent] (https://attack.mitre.org/software/S1214) является вариантом шпионского ПО в фишинговой кампании MoqHao, ориентированной в первую очередь на корейских и японских пользователей. (цитата: McAfee MoqHao 2019) Поддельные приложения безопасности были использованы для нападения на японских пользователей, в то время как поддельные полицейские приложения были использованы для нападения на корейских пользователей. Оба поддельных приложения имеют общие команды C2 и имеют один и тот же ключ отчета о сбоях в облачном сервисе. (цитата: McAfee MoqHao 2019)"
    },
    "S1215": {
      "name": "Бинарный валидатор",
      "description": "[Binary Validator] (https://attack.mitre.org/software/S1215) представляет собой двоичный файл Mach-O, используемый во время [Operation Triangulation] (https://attack.mitre.org/campaigns/C0054). (Citation: SecureList OpTriangulation 23Oct2023) [Binary Validator] (https://attack.mitre.org/software/S1215) сначала собирает информацию об устройстве, такую как номер телефона устройства и список установленных приложений, перед развертыванием имплантата [TriangleDB] (https://attack.mitre.org/software/S1216). После завершения действий и сбора данных [Binary Validator] (https://attack.mitre.org/software/S1215) шифрует и отправляет данные на сервер C2, а сервер C2, в свою очередь, отправляет имплантат [TriangleDB] (https://attack.mitre.org/software/S1216)."
    },
    "S1216": {
      "name": "Треугольник",
      "description": "[TriangleDB] (https://attack.mitre.org/software/S1216) представляет собой объектно-списочный имплантат, развернутый после [Binary Validator] (https://attack.mitre.org/software/S1215) и после получения корневых привилегий во время [Operation Triangulation] (https://attack.mitre.org/campaigns/C0054) инфекционной цепи. После выполнения [TriangleDB](https://attack.mitre.org/software/S1216) связывается с сервером C2, передавая информацию об устройстве жертвы.(Citation: SecureList OpTriangulation 21Jun2023)"
    },
    "S1225": {
      "name": "CherryBloss",
      "description": "[CherryBlos] (https://attack.mitre.org/software/S1225) - это вредоносное ПО для Android, которое крадет учетные данные и перенаправляет криптовалюту на кошельки, контролируемые противником. [CherryBlos] (https://attack.mitre.org/software/S1225) был назван Robot 999 в его первом появлении в апреле 2023 года; с тех пор использовались различные псевдонимы, включая GPTalk, Happy Miner и SynthNet. Актеры угрозы, стоящие за [CherryBlos] (https://attack.mitre.org/software/S1225), загрузили вредоносное ПО в различные регионы Google Play, такие как Малайзия, Вьетнам, Индонезия, Филиппины, Уганда и Мексика. (цитата: TrendMicro CherryBlos July2023)"
    },
    "S1231": {
      "name": "Бог-Отец",
      "description": "[GodFather] (https://attack.mitre.org/software/S1231) - это банковское вредоносное ПО для Android, которое использует виртуализацию для имитации законных приложений и злоупотребляет услугами доступности и другими разрешениями для обхода обнаружения и удаления конфиденциальных данных. Впервые обнаруженный в 2020 году, [GodFather] (https://attack.mitre.org/software/S1231) нацелен на почти 500 банковских приложений, криптовалютных кошельков и бирж по всему миру; однако его атаки на основе виртуализации в основном сосредоточены на нескольких турецких финансовых учреждениях. Эта возможность позволяет злоумышленникам красть банковские учетные данные и другую конфиденциальную информацию о счете. (Цитирование: ZimperiumOrtegaPratapagiri GodFather Jun2025) (Цитирование: MerkleScience Godfather April2023)"
    },
    "S1241": {
      "name": "Рэт Милад",
      "description": "[RatMilad] (https://attack.mitre.org/software/S1241) - это инструмент удаленного доступа Android (RAT) с функцией шпионского ПО, который используется для таргетинга корпоративных мобильных устройств на Ближнем Востоке, по крайней мере, с 2021 года. Варианты [RatMilad] (https://attack.mitre.org/software/S1241) были замаскированы под приложения VPN и поддельное приложение под названием NumRent. После установки [RatMilad] (https://attack.mitre.org/software/S1241) использует несколько методов [Collection] (https://attack.mitre.org/tactics/TA0035) для сбора конфиденциальной информации перед загрузкой собранных данных на его сервер командования и управления (C2). (перенаправлено с «ZimperiumGupta RatMilad Oct2022»)"
    },
    "S1243": {
      "name": "DCHS",
      "description": "[DCHSpy] (https://attack.mitre.org/software/S1243) - это шпионское ПО для Android, которое, вероятно, используется [MuddyWater] (https://attack.mitre.org/groups/G0069). [DCHSpy] (https://attack.mitre.org/software/S1243) использует политические приманки и маскировки в качестве законных приложений, таких как VPN и банковские приложения, чтобы обмануть жертв в загрузке вредоносного ПО. После загрузки [DCHSpy] (https://attack.mitre.org/software/S1243) собирает информацию с устройства и выводит данные на сервер команд и управления (C2). (Citation: Lookout DCHSpy July2025)"
    }
  },
  "mitigations": {
    "M1001": {
      "name": "Обновления безопасности",
      "description": "Установите обновления безопасности в ответ на обнаруженные уязвимости.\n\nПриобретайте устройства с обязательством поставщика и/или оператора мобильной связи быстро предоставлять обновления безопасности в течение определенного периода времени.\n\nУстройства вывода из эксплуатации, которые больше не будут получать обновления безопасности.\n\nОграничить или заблокировать доступ к корпоративным ресурсам с устройств, которые не установили последние обновления безопасности.\n\nНа устройствах Android доступ можно контролировать на основе уровня безопасности каждого устройства. На устройствах iOS доступ можно контролировать на основе версии iOS."
    },
    "M1002": {
      "name": "аттестация",
      "description": "Включите возможности удаленной аттестации (например, Android SafetyNet или Samsung Knox TIMA Attestation) и запретите устройствам, которые не получают аттестацию, доступ к корпоративным ресурсам."
    },
    "M1003": {
      "name": "Загрузчик блокировки",
      "description": "На устройствах, которые предоставляют возможность разблокировать загрузчик (следовательно, позволяя любому коду операционной системы мигать на устройство), выполняйте периодические проверки, чтобы убедиться, что загрузчик заблокирован."
    },
    "M1004": {
      "name": "Целостность раздела системы",
      "description": "Убедитесь, что используемые устройства Android включают и включают функцию Verified Boot, которая криптографически обеспечивает целостность системного раздела."
    },
    "M1006": {
      "name": "Используйте последнюю версию ОС",
      "description": "Новые версии мобильных операционных систем не только исправляют обнаруженные уязвимости, но и часто улучшают архитектуру безопасности, что обеспечивает устойчивость к потенциальным уязвимостям или слабостям, которые еще не были обнаружены. Они также могут принести улучшения, которые блокируют использование наблюдаемых методов противника."
    },
    "M1009": {
      "name": "Шифровать сетевой трафик",
      "description": "Разработчики приложений должны шифровать весь сетевой трафик приложений с помощью протокола Transport Layer Security (TLS) для обеспечения защиты конфиденциальных данных и предотвращения сетевых атак. При желании разработчики приложений могли выполнять шифрование данных на основе сообщений, прежде чем передавать его для шифрования TLS.\n\nФункция безопасности App Transport Security может быть использована для обеспечения надлежащей защиты всего сетевого трафика приложений. Apple намерена разрешить использование App Transport Security (Citation: TechCrunch-ATS) для всех приложений в Apple App Store, если не будет дано соответствующее обоснование.\n\nФункция сетевой безопасности Android также может быть использована разработчиками приложений, чтобы обеспечить надлежащую защиту всего сетевого трафика приложений (Citation: Android-NetworkSecurityConfig).\n\nИспользование туннелей виртуальной частной сети (VPN), например, с использованием протокола IPsec, может помочь смягчить некоторые типы сетевых атак."
    },
    "M1010": {
      "name": "Развернуть скомпрометированный метод обнаружения устройства",
      "description": "Существует множество методов, которые могут быть использованы для того, чтобы предприятия могли идентифицировать скомпрометированные (например, корневые / взломанные) устройства, будь то использование механизмов безопасности, встроенных непосредственно в устройство, сторонние мобильные приложения безопасности, возможности управления мобильностью предприятия (EMM) / управления мобильными устройствами (MDM) или другие методы. Некоторые методы могут быть тривиальными, чтобы избежать, в то время как другие могут быть более сложными."
    },
    "M1011": {
      "name": "Руководство пользователя",
      "description": "Описывает любое руководство или обучение, данное пользователям, чтобы установить определенные настройки конфигурации или избежать определенных потенциально рискованных действий."
    },
    "M1012": {
      "name": "Корпоративная политика",
      "description": "Система управления мобильностью предприятия (EMM), также известная как управление мобильными устройствами (MDM), может использоваться для предоставления политик мобильным устройствам для управления аспектами их допустимого поведения."
    },
    "M1013": {
      "name": "Руководство для разработчиков приложений",
      "description": "Руководство для разработчиков приложений фокусируется на предоставлении разработчикам знаний, инструментов и лучших практик, необходимых для написания безопасного кода, снижения уязвимостей и реализации принципов безопасного проектирования. Интегрируя безопасность на протяжении всего жизненного цикла разработки программного обеспечения (SDLC), это смягчение направлено на предотвращение появления уязвимостей в приложениях, системах и API. Это смягчение может быть реализовано посредством следующих мер:\n\nПредотвращение инъекций SQL (безопасная практика кодирования):\n\nВнедрение: Обучите разработчиков использовать параметризованные запросы или подготовленные заявления вместо прямого встраивания пользовательского ввода в SQL-запросы.\nСлучай использования: веб-приложение принимает пользовательский ввод для поиска в базе данных. Дезинфицируя и проверяя пользовательские вводы, разработчики могут предотвратить введение злоумышленниками вредоносных команд SQL.\n\nКросс-сайт скриптинг (XSS) смягчение:\n\n- Реализация: Требуйте от разработчиков реализации выходного кодирования для всего пользовательского контента, отображаемого на веб-странице.\nПример использования: сайт электронной коммерции позволяет пользователям оставлять отзывы о продуктах. Правильное кодирование и избегание пользовательских входов предотвращает выполнение вредоносных скриптов в браузерах других пользователей.\n\nSecure API Design:\n\nВнедрение: Обучите разработчиков аутентифицировать все конечные точки API и избегать раскрытия конфиденциальной информации в ответах API.\nПример использования: мобильное банковское приложение использует API для управления счетами. Применяя аутентификацию на основе токенов для каждого вызова API, разработчики снижают риск несанкционированного доступа.\n\nСтатический анализ кода в строительстве трубопровода:\n\nВнедрение: включение инструментов в CI/CD конвейеры для автоматического сканирования уязвимостей во время процесса сборки.\nПример использования: Финтех-компания интегрирует инструменты статического анализа для обнаружения жестко закодированных учетных данных в исходном коде перед развертыванием.\n\nМоделирование угроз на этапе проектирования:\n\nВнедрение: используйте такие фреймворки, как STRIDE (Spoofing, Tampering, Repudiation, Information Disclosure, Denial of Service, Elevation of Privilege) для оценки угроз при разработке приложений.\nПеред запуском клиентского портала компания SaaS идентифицирует потенциальные случаи злоупотребления, такие как захват сеанса, и разрабатывает меры по смягчению последствий, такие как безопасное управление сеансом.\n\n** Инструменты для реализации**:\n\nИнструменты анализа статического кода: используйте инструменты, которые могут сканировать известные уязвимости в исходном коде.\nДинамическое тестирование безопасности приложений (DAST): используйте такие инструменты, как Burp Suite или OWASP ZAP, для моделирования атак во время выполнения и выявления уязвимостей.\nБезопасные фреймворки: Рекомендуйте безопасные по умолчанию фреймворки (например, Django для Python, Spring Security для Java), которые обеспечивают соблюдение лучших практик безопасности."
    },
    "M1014": {
      "name": "Фильтрация соединений",
      "description": "Чтобы смягчить использование системы 7 (SS7), Совет по коммуникациям, безопасности, надежности и совместимости (CSRIC) описывает фильтрацию взаимосвязей между сетевыми операторами для блокирования неуместных запросов (Citation: CSRIC5-WG10-FinalReport)."
    },
    "M1058": {
      "name": "Антивирус/Antimalware",
      "description": "Мобильные продукты безопасности, такие как Mobile Threat Defense (MTD), предлагают различные средства защиты от определенных типов поведения."
    },
    "M1059": {
      "name": "Не останавливайте",
      "description": "Эта категория заключается в том, чтобы связать методы, которые могут увеличить риск компромисса, и поэтому смягчение не рекомендуется."
    }
  }
}
