{
  "tactics": {
    "TA0027": {
      "name": "Первоначальный доступ",
      "description": "Злоумышленник пытается проникнуть в ваше устройство.\n\nТактика первоначального доступа представляет собой векторы, которые злоумышленники используют для первоначального закрепления на мобильном устройстве."
    },
    "TA0028": {
      "name": "Упорство",
      "description": "Противник пытается удержать свои позиции.\n\nПостоянство — это любой доступ, действие или изменение конфигурации мобильного устройства, которое обеспечивает злоумышленнику постоянное присутствие на устройстве. Злоумышленникам часто приходится поддерживать доступ к мобильным устройствам посредством прерываний, таких как перезагрузка устройства и, возможно, даже сброс заводских данных."
    },
    "TA0029": {
      "name": "Повышение привилегий",
      "description": "Злоумышленник пытается получить разрешения более высокого уровня.\n\nПовышение привилегий включает методы, которые позволяют злоумышленнику получить более высокий уровень разрешений на мобильном устройстве. Злоумышленники могут войти в мобильное устройство с очень ограниченными привилегиями, и им может потребоваться воспользоваться слабостью устройства для получения более высоких привилегий, необходимых для успешного выполнения задач миссии."
    },
    "TA0030": {
      "name": "Уклонение от защиты",
      "description": "Противник пытается избежать обнаружения.\n\nУклонение от защиты состоит из методов, которые противник может использовать, чтобы уклониться от обнаружения или избежать других средств защиты. Иногда эти действия аналогичны методам других категорий или являются их вариациями, которые имеют дополнительное преимущество, заключающееся в подрыве конкретной защиты или смягчения последствий. Уклонение от обороны можно рассматривать как набор атрибутов, которые противник применяет ко всем остальным этапам операции."
    },
    "TA0031": {
      "name": "Доступ к учетным данным",
      "description": "Злоумышленник пытается украсть имена учетных записей, пароли или другие секреты, обеспечивающие доступ к ресурсам.\n\nДоступ к учетным данным представляет собой методы, которые могут использоваться злоумышленниками для получения доступа или контроля над паролями, токенами, криптографическими ключами или другими значениями, которые могут быть использованы злоумышленником для получения несанкционированного доступа к ресурсам. Доступ к учетным данным позволяет злоумышленнику выдать себя за учетную запись со всеми разрешениями этой учетной записи в системе и сети, что затрудняет защитникам обнаружение злоумышленника. При наличии достаточного доступа в сети злоумышленник может создавать учетные записи для последующего использования в среде."
    },
    "TA0032": {
      "name": "Открытие",
      "description": "Противник пытается выяснить ваше окружение.\n\nОбнаружение состоит из методов, которые позволяют злоумышленнику получить информацию о характеристиках мобильного устройства и, возможно, других сетевых систем. Когда злоумышленники получают доступ к новой системе, они должны ориентироваться на то, что они теперь контролируют, и какие преимущества использование этой системы дает их текущим целям или общим целям во время вторжения. Операционная система может предоставлять возможности, которые помогают на этапе сбора информации после компрометации."
    },
    "TA0033": {
      "name": "Боковое движение",
      "description": "Противник пытается проникнуть в ваше окружение.\n\nЛатеральное движение состоит из методов, которые позволяют злоумышленнику получить доступ к удаленным системам в сети и управлять ими и могут, но не обязательно, включать в себя выполнение инструментов в удаленных системах. Методы бокового перемещения могут позволить злоумышленнику собирать информацию из системы без необходимости использования дополнительных инструментов, таких как инструмент удаленного доступа."
    },
    "TA0034": {
      "name": "Влияние",
      "description": "Злоумышленник пытается манипулировать, прервать или уничтожить ваши устройства и данные.\n\nТактика воздействия состоит из методов, используемых противником для достижения целей своей миссии, но которые не вписываются в другую категорию, например, в сбор. Цели миссии различаются в зависимости от целей каждого злоумышленника, но примеры включают мошенничество с междугородной связью, уничтожение данных устройства или блокировку пользователя на его или ее устройстве до тех пор, пока не будет выплачен выкуп."
    },
    "TA0035": {
      "name": "Коллекция",
      "description": "Злоумышленник пытается собрать данные, представляющие интерес для его цели.\n\nСбор состоит из методов, используемых для идентификации и сбора информации, например конфиденциальных файлов, из целевой сети перед ее кражей. В эту категорию также входят места в системе или сети, где злоумышленник может искать информацию для проникновения."
    },
    "TA0036": {
      "name": "Эксфильтрация",
      "description": "Злоумышленник пытается украсть данные.\n\nК эксфильтрации относятся методы и атрибуты, которые приводят или помогают злоумышленнику удалить файлы и информацию с целевого мобильного устройства.\n\nВ мобильной среде мобильные устройства часто подключаются к сетям, находящимся вне контроля предприятия, таким как сотовые сети или общедоступные сети Wi-Fi. Злоумышленники могут попытаться избежать обнаружения, общаясь в этих сетях и, возможно, даже используя механизмы, не относящиеся к Интернет-протоколу, такие как служба коротких сообщений (SMS). Однако сотовые сети часто имеют ограничения на передачу данных и/или дополнительную плату за передачу данных, что может увеличить вероятность обнаружения враждебной связи."
    },
    "TA0037": {
      "name": "Командование и контроль",
      "description": "Злоумышленник пытается связаться со скомпрометированными устройствами, чтобы контролировать их.\n\nТактика командования и контроля представляет собой то, как злоумышленники взаимодействуют с системами, находящимися под их контролем, в целевой сети. Существует множество способов, с помощью которых злоумышленник может установить командование и контроль с различными уровнями скрытности, в зависимости от конфигурации системы и топологии сети. Из-за широкого разнообразия, доступного противнику на сетевом уровне, для описания различий в управлении и управлении использовались только наиболее общие факторы. В документированных методах по-прежнему существует множество конкретных приемов, в основном из-за того, насколько легко определять новые протоколы и использовать существующие законные протоколы и сетевые службы для связи.\n\nПолученная в результате разбивка должна помочь понять концепцию, согласно которой обнаружение вторжений с помощью протоколов управления и контроля без предварительного знания является сложной задачей в долгосрочной перспективе. Основными ограничениями злоумышленников в обходе защиты на сетевом уровне являются тестирование и развертывание инструментов для быстрого изменения своих протоколов, осведомленность о существующих защитных технологиях и доступ к законным веб-сервисам, которые при правильном использовании затрудняют различение их инструментов от безопасного трафика.\n\nКроме того, в мобильной среде мобильные устройства часто подключаются к сетям, находящимся вне контроля предприятия, таким как сотовые сети или общедоступные сети Wi-Fi. Злоумышленники могут попытаться избежать обнаружения, общаясь в этих сетях и, возможно, даже используя механизмы, не относящиеся к Интернет-протоколу, такие как служба коротких сообщений (SMS). Однако сотовые сети часто имеют ограничения на передачу данных и/или дополнительную плату за передачу данных, что может увеличить вероятность обнаружения враждебной связи."
    },
    "TA0041": {
      "name": "Исполнение",
      "description": "Злоумышленник пытается запустить вредоносный код.\n\nВыполнение состоит из методов, которые приводят к запуску кода, контролируемого злоумышленником, на мобильном устройстве. Методы запуска вредоносного кода часто сочетаются с методами всех других тактик для достижения более широких целей, таких как исследование сети или кража данных."
    }
  },
  "techniques": {
    "T1398": {
      "name": "Сценарии инициализации загрузки или входа в систему",
      "description": "Злоумышленники могут использовать сценарии, автоматически выполняемые при загрузке или инициализации входа в систему, чтобы обеспечить постоянство. Initialization scripts are part of the underlying operating system and are not accessible to the user unless the device has been rooted or jailbroken."
    },
    "T1404": {
      "name": "Использование для повышения привилегий",
      "description": "Злоумышленники могут использовать уязвимости программного обеспечения для повышения привилегий. Эксплуатация уязвимости программного обеспечения происходит, когда злоумышленник использует программную ошибку в приложении, службе, программном обеспечении операционной системы или самом ядре для выполнения кода, контролируемого злоумышленником. Конструкции безопасности, такие как уровни разрешений, часто препятствуют доступу к информации и использованию определенных методов. Злоумышленникам, скорее всего, придется повысить привилегии, включив использование программного обеспечения для обхода этих ограничений.\n\nПри первоначальном получении доступа к устройству злоумышленник может работать в рамках процесса с более низкими привилегиями, что не позволит ему получить доступ к определенным ресурсам в системе. Могут существовать уязвимости, обычно в компонентах операционной системы и приложениях, работающих с более высокими разрешениями, которые можно использовать для получения более высокого уровня доступа к системе. Это может позволить кому-то перейти от непривилегированных разрешений или разрешений уровня пользователя к разрешениям root в зависимости от уязвимого компонента."
    },
    "T1406": {
      "name": "Запутанные файлы или информация",
      "description": "Злоумышленники могут попытаться затруднить обнаружение или анализ полезной нагрузки или файла путем шифрования, кодирования или иного запутывания их содержимого на устройстве или при передаче. Это распространенное поведение, которое можно использовать на разных платформах и в сети для обхода защиты. \n \nПолезные данные могут быть сжаты, заархивированы или зашифрованы, чтобы избежать обнаружения. Эти полезные данные могут использоваться во время первоначального доступа или позже для предотвращения обнаружения. Части файлов также могут быть закодированы, чтобы скрыть строки открытого текста, которые в противном случае помогли бы защитникам обнаружить их. Полезные данные также могут быть разделены на отдельные, казалось бы, безобидные файлы, которые обнаруживают вредоносную функциональность только при повторной сборке. (Цитата: Microsoft MalLockerB)"
    },
    "T1406.001": {
      "name": "стеганография",
      "description": "Злоумышленники могут использовать методы стеганографии, чтобы предотвратить обнаружение скрытой информации. Стеганографические методы можно использовать для сокрытия данных на цифровых носителях, таких как изображения, звуковые дорожки, видеоклипы или текстовые файлы."
    },
    "T1406.002": {
      "name": "Упаковка программного обеспечения",
      "description": "Злоумышленники могут выполнить упаковку программного обеспечения, чтобы скрыть свой код. Упаковка программного обеспечения — это метод сжатия или шифрования исполняемого файла. Упаковка исполняемого файла изменяет подпись файла, пытаясь избежать обнаружения на основе сигнатур. Большинство методов распаковки распаковывают исполняемый код в памяти.\n\nУтилиты, используемые для выполнения упаковки программного обеспечения, называются упаковщиками. Примером упаковщика является FTT. Доступен более полный список известных упаковщиков, но злоумышленники могут создавать свои собственные методы упаковки, которые не оставляют тех же артефактов, что и известные упаковщики, для обхода защиты."
    },
    "T1407": {
      "name": "Загрузить новый код во время выполнения",
      "description": "Злоумышленники могут загрузить и выполнить динамический код, не включенный в исходный пакет приложения после установки. Этот метод в основном используется для обхода проверок статического анализа и сканирований перед публикацией в официальных магазинах приложений. В некоторых случаях такое поведение можно обнаружить с помощью более продвинутых методов динамического или поведенческого анализа. Однако в сочетании с методами [Execution Guardrails](https://attack.mitre.org/techniques/T1627) обнаружение вредоносного кода, загруженного после установки, может быть затруднено.\n\nВ Android динамический код может включать собственный код, код Dalvik или код JavaScript, который использует возможности JavascriptInterface Android WebView.\n\nВ iOS динамический код можно загрузить и выполнить с помощью сторонних библиотек, таких как JSPatch. (Цитата: FireEye-JSPatch)"
    },
    "T1409": {
      "name": "Сохраненные данные приложения",
      "description": "Злоумышленники могут попытаться получить доступ и собрать данные приложения, находящиеся на устройстве. Злоумышленники часто нацелены на популярные приложения, такие как Facebook, WeChat и Gmail. (Цитата: SWB Exodus, март 2019 г.)\n\n\n\nИз-за изолированной программной среды мобильной ОС этот метод возможен только в трех сценариях:\n\n\n\n* Приложение хранит файлы в незащищенном внешнем хранилище. \n* Приложение хранит файлы в своем внутреннем хранилище с незащищенными разрешениями (например, 777). \n* Злоумышленник получает root-права на устройстве."
    },
    "T1414": {
      "name": "Данные буфера обмена",
      "description": "Злоумышленники могут злоупотреблять API-интерфейсами менеджера буфера обмена для получения конфиденциальной информации, скопированной в буфер обмена устройства. Например, пароли, копируемые и вставляемые из приложения-менеджера паролей, могут быть перехвачены вредоносным приложением, установленным на устройстве. (Цитата: Fahl-Clipboard)\n\n\n\nВ Android приложения могут использовать API ClipboardManager.OnPrimaryClipChangedListener() для регистрации в качестве прослушивателя и отслеживания изменений в буфере обмена. Однако, начиная с Android 10, это можно использовать только в том случае, если приложение находится на переднем плане или установлено в качестве редактора метода ввода устройства по умолчанию (IME). (Цитата: Github Capture Clipboard 2019) (Цитата: Изменения конфиденциальности Android 10)\n\n\n\nВ iOS это можно сделать, обратившись к полю UIPasteboard.general.string. Однако, начиная с iOS 14, при доступе к буферу обмена пользователю будет показано системное уведомление, если текст, к которому осуществляется доступ, возник в другом приложении. Например, если пользователь копирует текст iMessage из приложения «Сообщения», в уведомлении будет написано «имя_приложения вставлено из сообщений», когда текст был вставлен в другое приложение. (Цитата: UIPPasteboard)"
    },
    "T1417": {
      "name": "Захват ввода",
      "description": "Злоумышленники могут использовать методы перехвата вводимых пользователем данных для получения учетных данных или сбора информации. При обычном использовании устройства пользователи часто предоставляют учетные данные в различных местах, например на страницах/порталах входа или в системных диалоговых окнах. Механизмы захвата ввода могут быть прозрачными для пользователя (например, [Keylogging](https://attack.mitre.org/techniques/T1417/001)) или полагаться на обман пользователя, заставляя его ввести то, что он считает подлинным приглашением приложения (например, [Захват ввода GUI](https://attack.mitre.org/techniques/T1417/002))."
    },
    "T1417.001": {
      "name": "Кейлоггинг",
      "description": "Злоумышленники могут регистрировать нажатия клавиш пользователя, чтобы перехватывать учетные данные или другую информацию от пользователя по мере того, как пользователь их вводит.\n\nНекоторые методы кейлогинга включают в себя:\n\n* Маскируется под легальную стороннюю клавиатуру для записи нажатий клавиш пользователем. (Цитата: Zeltser-Keyboard) Как на Android, так и на iOS пользователи должны явно разрешить использование сторонних клавиатурных приложений. Пользователям следует рекомендовать проявлять крайнюю осторожность, прежде чем предоставлять это разрешение, когда оно запрашивается.\n* Злоупотребление специальными возможностями. В Android злоумышленники могут злоупотреблять специальными возможностями для записи нажатий клавиш, регистрируя класс AccessibilityService, переопределяя метод onAccessibilityEvent и прослушивая тип событий AccessibilityEvent.TYPE_VIEW_TEXT_CHANGED. Объект события, переданный в функцию, будет содержать данные, введенные пользователем. \n*Дополнительные методы кейлогинга могут быть возможны, если доступен root-доступ."
    },
    "T1417.002": {
      "name": "Захват ввода графического интерфейса",
      "description": "Злоумышленники могут имитировать общие компоненты графического интерфейса операционной системы, чтобы запрашивать у пользователей конфиденциальную информацию с помощью, казалось бы, законного запроса. Операционная система и установленные приложения часто имеют законную потребность запрашивать у пользователя конфиденциальную информацию, такую ​​как учетные данные учетной записи, информацию о банковском счете или личную информацию (PII). По сравнению с традиционными ПК, ограниченный размер дисплея мобильных устройств может ухудшить способность предоставлять пользователям контекстную информацию, делая пользователей более восприимчивыми к использованию этого метода. (Цитата: Felt-PhishingOnMobileDevices)\n\nЗлоумышленники могут использовать несколько подходов для имитации этой функции. Злоумышленники могут выдавать себя за легитимное приложение (например, использовать то же имя и/или значок приложения) и при установке на устройстве запрашивать у пользователя конфиденциальную информацию. (Цитата: eset-finance) Злоумышленники также могут отправлять пользователю поддельные уведомления об устройстве, которые могут вызвать отображение приглашения для ввода при нажатии. (Цитата: Group IB Gustuff, март 2019 г.)\n\nКроме того, злоумышленники могут отображать подсказку поверх работающего легального приложения, чтобы обманом заставить пользователей ввести конфиденциальную информацию во вредоносное приложение, а не в законное приложение. Как правило, злоумышленникам необходимо знать, когда целевое приложение и отдельные действия внутри целевого приложения выполняются на переднем плане, чтобы отобразить подсказку в нужное время. Злоумышленники могут злоупотреблять специальными возможностями Android, чтобы определить, какое приложение в данный момент находится на переднем плане. (Цитата: ThreatFabric Cerberus) Два известных подхода к отображению подсказки включают в себя:\n\n* Злоумышленники начинают новую деятельность поверх работающего законного приложения. (Цитата: Felt-PhishingOnMobileDevices) (Цитата: Hassell-ExploitingAndroid) Android 10 накладывает новые ограничения на возможность приложения начинать новую деятельность поверх другого приложения, что может затруднить злоумышленникам использование этой техники. (Цитата: Android Background)\n* Злоумышленники создают окно-наложение приложения поверх работающего законного приложения. Приложения должны иметь разрешение `SYSTEM_ALERT_WINDOW` для создания наложенных окон. Это разрешение обрабатывается иначе, чем типичные разрешения Android, и, по крайней мере, при определенных условиях, автоматически предоставляется приложениям, установленным из Google Play Store. API.(Цитата: XDA Bubbles)"
    },
    "T1418": {
      "name": "Открытие программного обеспечения",
      "description": "Adversaries may attempt to get a listing of applications that are installed on a device. Злоумышленники могут использовать информацию из [Обнаружение программного обеспечения](https://attack.mitre.org/techniques/T1418) во время автоматического обнаружения для формирования последующего поведения, включая необходимость полного заражения цели и/или попыток выполнения определенных действий.\n\n\n\nЗлоумышленники могут попытаться перечислить приложения по разным причинам, например, чтобы выяснить, какие меры безопасности присутствуют, или определить наличие целевых приложений."
    },
    "T1418.001": {
      "name": "Обнаружение программного обеспечения безопасности",
      "description": "Злоумышленники могут попытаться получить список приложений и конфигураций безопасности, установленных на устройстве. Сюда могут входить такие вещи, как продукты мобильной безопасности. Злоумышленники могут использовать информацию из [Обнаружение программного обеспечения безопасности] (https://attack.mitre.org/techniques/T1418/001) во время автоматического обнаружения для формирования последующего поведения, включая необходимость полного заражения цели и/или попытки выполнения определенных действий."
    },
    "T1420": {
      "name": "Обнаружение файлов и каталогов",
      "description": "Злоумышленники могут перечислять файлы и каталоги или искать нужную информацию в файловой системе в определенных местах устройства. Злоумышленники могут использовать информацию из [Обнаружение файлов и каталогов] (https://attack.mitre.org/techniques/T1420) во время автоматического обнаружения для формирования последующего поведения, включая принятие решения о том, должен ли злоумышленник полностью заразить цель и/или предпринять определенные действия.\n\nВ Android разрешения файлов Linux и политики SELinux обычно строго ограничивают доступ приложений без использования эксплойта повышения привилегий. Содержимое каталога внешнего хранилища обычно видно, что может вызвать проблемы, если конфиденциальные данные хранятся там ненадлежащим образом. Архитектура безопасности iOS обычно ограничивает возможность выполнения любого типа [обнаружения файлов и каталогов] (https://attack.mitre.org/techniques/T1420) без использования повышенных привилегий."
    },
    "T1421": {
      "name": "Обнаружение системных сетевых подключений",
      "description": "Злоумышленники могут попытаться получить список сетевых подключений к или от взломанного устройства, к которому они в данный момент обращаются, или от удаленных систем, запрашивая информацию по сети.\n\n\n\nОбычно это достигается путем использования API-интерфейсов устройств для сбора информации о близлежащих сетях, таких как Wi-Fi, Bluetooth и соединения с вышками сотовой связи. На Android это можно сделать, запросив соответствующие API:\n\n\n\n* `WifiInfo` для получения информации о текущем соединении Wi-Fi, а также о близлежащих сетях Wi-Fi. Для запроса API WiFiInfo приложение должно иметь разрешение ACCESS_FINE_LOCATION.\n\n* `BluetoothAdapter` для получения информации об устройствах Bluetooth, что также требует, чтобы приложение сохраняло несколько разрешений, предоставленных пользователем во время выполнения.\n\n* Для версий Android до Q приложения могут использовать метод TelephonyManager.getNeighboringCellInfo(). Для Q и более поздних версий приложения могут использовать метод TelephonyManager.getAllCellInfo(). Оба метода требуют, чтобы приложение имело разрешение `ACCESS_FINE_LOCATION`."
    },
    "T1422": {
      "name": "Обнаружение конфигурации сети системы",
      "description": "Злоумышленники могут искать подробную информацию о конфигурации и настройках сети, например IP- и/или MAC-адреса, устройств, к которым они получают доступ, или путем обнаружения информации об удаленных системах.\n\nЗлоумышленники могут использовать информацию из [Обнаружение конфигурации сети системы] (https://attack.mitre.org/techniques/T1422) во время автоматического обнаружения для формирования последующего поведения, включая определение определенного доступа в целевой сети и дальнейших действий.\n\nВ Android сведения о встроенных сетевых интерфейсах доступны приложениям через класс java.net.NetworkInterface. (Цитата: NetworkInterface) Раньше класс Android TelephonyManager можно было использовать для сбора идентификаторов устройств, связанных с телефонией, такой информации, как IMSI, IMEI и номер телефона. Однако, начиная с Android 10, только предварительно загруженные приложения, приложения оператора связи, SMS по умолчанию или приложения владельца устройства и профиля могут получить доступ к идентификаторам устройств, связанных с телефонией. (Цитата: TelephonyManager)\n\n\n\nВ iOS сбор информации о конфигурации сети невозможен без root-доступа.\n\n\n\nЗлоумышленники могут использовать информацию из [Обнаружение конфигурации сети системы] (https://attack.mitre.org/techniques/T1422) во время автоматического обнаружения для формирования последующего поведения, включая определение определенного доступа в целевой сети и дальнейших действий."
    },
    "T1422.001": {
      "name": "Обнаружение подключения к Интернету",
      "description": "Злоумышленники могут проверять подключение к Интернету на скомпрометированных системах. Это может быть выполнено во время автоматического обнаружения и различными способами, например, с помощью `adb Shell netstat` для Android. (Цитата: adb_commands)\n\nЗлоумышленники могут использовать результаты и ответы на эти запросы, чтобы определить, способны ли мобильные устройства взаимодействовать с принадлежащими злоумышленникам серверами C2, прежде чем пытаться подключиться к ним. Результаты также могут использоваться для идентификации маршрутов, перенаправлений и прокси-серверов."
    },
    "T1422.002": {
      "name": "Открытие Wi-Fi",
      "description": "Злоумышленники могут искать информацию о сетях Wi-Fi, например имена сетей и пароли, на взломанных системах. Злоумышленники могут использовать информацию Wi-Fi в рамках деятельности [Обнаружение](https://attack.mitre.org/tactics/TA0032) или [Доступ к учетным данным](https://attack.mitre.org/tactics/TA0031) для поддержки как текущих, так и будущих кампаний."
    },
    "T1423": {
      "name": "Сканирование сетевых служб",
      "description": "Злоумышленники могут попытаться получить список служб, работающих на удаленных хостах, включая те, которые могут быть уязвимы для удаленной эксплуатации программного обеспечения. Методы получения этой информации включают сканирование портов и сканирование уязвимостей с мобильного устройства. Этот метод может использовать преимущества доступа мобильного устройства к внутренней сети предприятия либо через локальное подключение, либо через виртуальную частную сеть (VPN)."
    },
    "T1424": {
      "name": "Обнаружение процессов",
      "description": "Злоумышленники могут попытаться получить информацию о запущенных процессах на устройстве. Полученная информация может быть использована для понимания общего программного обеспечения/приложений, работающих на устройствах в сети. Злоумышленники могут использовать информацию из [Обнаружения процесса](https://attack.mitre.org/techniques/T1424) во время автоматического обнаружения для формирования последующего поведения, включая определение того, полностью ли злоумышленник заражает цель и/или пытается выполнить определенные действия.\n\n\n\nНедавние улучшения безопасности Android усложнили получение списка запущенных процессов. В Android 7 и более поздних версиях приложение не может получить список процессов без злоупотребления повышенными привилегиями. Это связано с тем, что ядро ​​Android использует функцию монтирования «hidepid». До Android 7 приложения могли использовать команду `ps` или проверять каталог `/proc` на устройстве. (Цитата: Android-SELinuxChanges)\n\n\n\nВ iOS приложения ранее могли использовать команду sysctl для получения списка запущенных процессов. Эта функция была удалена в более поздних версиях iOS."
    },
    "T1426": {
      "name": "Обнаружение системной информации",
      "description": "Злоумышленники могут попытаться получить подробную информацию об операционной системе и оборудовании устройства, включая версии, исправления и архитектуру. Злоумышленники могут использовать информацию из [Обнаружения системной информации] (https://attack.mitre.org/techniques/T1426) во время автоматического обнаружения, чтобы формировать последующее поведение, включая необходимость полного заражения цели и/или попыток выполнения определенных действий.\n\n\n\nВ Android большая часть этой информации программно доступна приложениям через класс android.os.Build. (Цитата: Android-Build) iOS гораздо более ограничительна в отношении того, какая информация видна приложениям. Обычно приложения могут запрашивать только модель устройства и версию iOS, на которой оно работает."
    },
    "T1428": {
      "name": "Использование удаленных сервисов",
      "description": "Злоумышленники могут использовать удаленные службы корпоративных серверов, рабочих станций или других ресурсов для получения несанкционированного доступа к внутренним системам, оказавшись внутри сети. Злоумышленники могут использовать удаленные сервисы, воспользовавшись доступом мобильного устройства к внутренней сети предприятия через локальное подключение или через виртуальную частную сеть (VPN). Эксплуатация уязвимости программного обеспечения происходит, когда злоумышленник использует программную ошибку в программе, службе или в программном обеспечении или ядре операционной системы для выполнения кода, контролируемого злоумышленником. Общей целью использования удаленных сервисов после компрометации является горизонтальное перемещение для обеспечения доступа к удаленной системе.\n\nЗлоумышленнику может потребоваться определить, находится ли удаленная система в уязвимом состоянии, что можно сделать с помощью [Сканирования сетевых служб] (https://attack.mitre.org/techniques/T1423) или других методов обнаружения. Они ищут распространенное уязвимое программное обеспечение, которое может быть развернуто в сети, отсутствие определенных исправлений, которые могут указывать на уязвимости, или программное обеспечение безопасности, которое может использоваться для обнаружения или сдерживания удаленной эксплуатации. Серверы, вероятно, являются ценной целью для использования бокового смещения, но конечные системы также могут подвергаться риску, если они предоставляют преимущество или доступ к дополнительным ресурсам.\n\nВ зависимости от уровня разрешений уязвимой удаленной службы злоумышленник может также получить [эксплуатацию для повышения привилегий] (https://attack.mitre.org/techniques/T1404) в результате использования бокового перемещения."
    },
    "T1429": {
      "name": "Захват звука",
      "description": "Злоумышленники могут захватывать аудио для сбора информации, используя стандартные API-интерфейсы операционной системы мобильного устройства. Примеры аудиоинформации, на которую могут ориентироваться злоумышленники, включают разговоры пользователей, окружение, телефонные звонки или другую конфиденциальную информацию.\n\n\n\nAndroid и iOS по умолчанию требуют, чтобы приложения запрашивали у пользователя доступ к микрофону устройства.\n\n\n\nНа устройствах Android приложения должны иметь разрешение «RECORD_AUDIO» для доступа к микрофону или разрешение «CAPTURE_AUDIO_OUTPUT» для доступа к аудиовыходу. Поскольку Android по умолчанию не позволяет сторонним приложениям сохранять разрешение CAPTURE_AUDIO_OUTPUT, только привилегированные приложения, например распространяемые Google или поставщиком устройства, могут получить доступ к аудиовыходу. (Цитата: Разрешения Android). Однако злоумышленники могут получить этот доступ после успешного повышения своих привилегий. Имея разрешение CAPTURE_AUDIO_OUTPUT, злоумышленники могут передавать константу MediaRecorder.AudioSource.VOICE_CALL в MediaRecorder.setAudioOutput, позволяя захватывать как восходящий, так и нисходящий канал голосового вызова. (Цитата: Manifest.permission)\n\n\n\nНа устройствах iOS приложения должны включать ключ NSMicrophoneUsageDescription в свой файл Info.plist для доступа к микрофону. (Цитата: Запрос Auth-Media Capture)"
    },
    "T1430": {
      "name": "Отслеживание местоположения",
      "description": "Злоумышленники могут отслеживать физическое местоположение устройства с помощью стандартных API-интерфейсов операционной системы с помощью вредоносных или эксплуатируемых приложений на скомпрометированном устройстве.\n\n\n\nВ Android приложения, имеющие разрешения «ACCESS_COAURSE_LOCATION» или «ACCESS_FINE_LOCATION», предоставляют доступ к физическому местоположению устройства. В Android 10 и более поздних версиях объявление разрешения `ACCESS_BACKGROUND_LOCATION` в манифесте приложения позволит приложениям запрашивать доступ к местоположению, даже когда приложение работает в фоновом режиме. (Цитата: Android Request Location Permissions) Некоторые злоумышленники использовали интеграцию картографических сервисов Baidu для определения географического местоположения после получения разрешений на доступ к местоположению. (Цитата: PaloAlto-SpyDealer) (Цитата: Palo Alto HenBox)\n\n\n\nВ iOS приложения должны включать ключи NSLocationWhenInUseUsageDescription, NSLocationAlwaysAndWhenInUseUsageDescription и/или NSLocationAlwaysUsageDescription в свой файл Info.plist в зависимости от степени запрошенного доступа к информации о местоположении. доступ к информации о местоположении, когда приложение используется, или `requestAlwaysAuthorization()` для запроса доступа к информации о местоположении независимо от того, используется ли приложение. Имея повышенные привилегии, злоумышленник может получить доступ к данным о местоположении без явного согласия пользователя с помощью ключа доступа com.apple.locationd.preauthorized. (Цитата: Google Project Zero Insomnia)"
    },
    "T1430.001": {
      "name": "Службы удаленного управления устройствами",
      "description": "Злоумышленник может использовать доступ к облачным сервисам (например, Android Device Manager от Google или Find my iPhone от Apple iCloud) или к серверной консоли управления мобильностью предприятия (EMM)/управления мобильными устройствами (MDM) для отслеживания местоположения мобильных устройств, управляемых службой. (Цитата: Krebs-Location)."
    },
    "T1430.002": {
      "name": "Олицетворение узлов SS7",
      "description": "Злоумышленники могут использовать отсутствие аутентификации в узлах сети системы сигнализации для отслеживания местоположения мобильных устройств, выдавая себя за узел.\n\n\n\nПредоставляя MSISDN (номер телефона) жертвы и выдавая себя за внутренние узлы сети для запроса информации об абоненте у других узлов, злоумышленники могут использовать данные, собранные на каждом прыжке, чтобы в конечном итоге определить географическую зону сотовой связи устройства или ближайшую вышку сотовой связи. (Цитата: Engel-SS7)"
    },
    "T1437": {
      "name": "Протокол прикладного уровня",
      "description": "Злоумышленники могут обмениваться данными, используя протоколы прикладного уровня, чтобы избежать обнаружения/сетевой фильтрации путем смешивания с существующим трафиком. Команды мобильному устройству и часто результаты этих команд будут встроены в трафик протокола между мобильным устройством и сервером.\n\nЗлоумышленники могут использовать множество различных протоколов, в том числе используемые для просмотра веб-страниц, передачи файлов, электронной почты или DNS."
    },
    "T1437.001": {
      "name": "Веб-протоколы",
      "description": "Злоумышленники могут обмениваться данными, используя протоколы прикладного уровня, связанные с трафиком веб-протоколов, чтобы избежать обнаружения/сетевой фильтрации путем смешивания с существующим трафиком. Команды удаленным мобильным устройствам и часто результаты этих команд будут встроены в трафик протокола между мобильным клиентом и сервером.\n\nВеб-протоколы, такие как HTTP и HTTPS, используются для веб-трафика, а также службы уведомлений, встроенные в службы мобильных сообщений, такие как Google Cloud Messaging (GCM) и недавно Firebase Cloud Messaging (FCM) (GCM/FCM: двусторонняя связь) и Apple Push Notification Service (APNS; односторонняя связь между сервером и устройством).  Такие службы уведомлений используют HTTP/S через соответствующий API и обычно используются на Android и iOS соответственно, чтобы сливаться с обычным трафиком устройств, что затрудняет проверку предприятиями."
    },
    "T1451": {
      "name": "Замена SIM-карты",
      "description": "Злоумышленники могут получить доступ к мобильным устройствам посредством передачи или обмена телефонных номеров жертв на SIM-карты и мобильные устройства, контролируемые злоумышленниками. (Цитата: Мошенничество с заменой SIM-карт ATT) (Цитата: Замена SIM-карт Verizon)\n\nТипичный процесс выглядит следующим образом:\n\n1. Злоумышленники сначала соберут информацию о жертвах с помощью [фишинга](https://attack.mitre.org/techniques/T1660), социальной инженерии, утечки данных или других способов. \n2. Злоумышленники затем будут выдавать себя за жертв, обращаясь к операторам мобильной связи с просьбой о замене SIM-карты. Например, злоумышленники сообщали имена и адреса жертв операторам мобильной связи; После аутентификации злоумышленники будут запрашивать перенос телефонных номеров жертв на SIM-карты, контролируемые злоумышленниками.  \n3. После завершения жертвы потеряют мобильные данные, такие как текстовые сообщения и телефонные звонки, на своих мобильных устройствах. В свою очередь, злоумышленники получат мобильные данные, предназначенные для жертв.\n\nЗлоумышленники могут использовать перехваченные SMS-сообщения для входа в онлайн-аккаунты, использующие аутентификацию на основе SMS. В частности, злоумышленники могут использовать аутентификацию на основе SMS для входа в банковские счета и/или криптовалютные счета, а затем переводить средства на кошельки, контролируемые злоумышленниками."
    },
    "T1453": {
      "name": "Злоупотребление специальными возможностями",
      "description": "Злоумышленники могут злоупотреблять специальными возможностями на устройствах Android для кражи конфиденциальных данных и распространения вредоносного ПО на другие устройства. Функции специальных возможностей в Android предназначены для помощи пользователям с ограниченными возможностями при выполнении различных задач, таких как использование блоков действий для управления лампочками и изменение пользовательского интерфейса устройства, например изменение размера шрифта и настройка контракта или цветов. (Цитата: Google_AndroidAcsOverview)\n\nОдним из примеров того, как злоумышленники злоупотребляют функциями специальных возможностей, является наложение HTML-объекта, имитирующего законный экран входа в систему. Пользователь вводит свои учетные данные в HTML-объект наложения, который затем отправляется злоумышленникам. (Цитата: SahinSRLabs_FluBot_Dec2021)\n\nДругой пример — вредоносная функция специальных возможностей, действующая как кейлоггер. Кейлоггер отслеживает изменения в полях EditText и отправляет их злоумышленникам. (Цитата: SahinSRLabs_FluBot_Dec2021) Этот метод атаки также описан в [Keylogging] (https://attack.mitre.org/techniques/T1417/001); тогда как [Злоупотребление функциями доступности] (https://attack.mitre.org/techniques/T1453) фиксирует общее злоупотребление функциями доступности."
    },
    "T1456": {
      "name": "Компромисс Drive-By",
      "description": "Злоумышленники могут получить доступ к системе через посещение пользователем веб-сайта в ходе обычного просмотра. При использовании этого метода веб-браузер пользователя обычно становится объектом атаки, но злоумышленники также могут использовать взломанные веб-сайты для действий, не связанных с эксплуатацией, например для получения [токена доступа к приложению] (https://attack.mitre.org/techniques/T1550/001).\n\nСуществует несколько способов доставки кода эксплойта в браузер, в том числе:\n\n* Законный веб-сайт подвергается риску, если злоумышленники внедрили тот или иной вредоносный код, например JavaScript, iFrames или межсайтовый скриптинг.\n* Вредоносная реклама оплачивается и обслуживается законными поставщиками рекламы.\n* Встроенные интерфейсы веб-приложений используются для вставки объектов любого другого типа, которые можно использовать для отображения веб-контента или содержать скрипт, который выполняется на посещающем клиенте (например, сообщения на форуме, комментарии и другой веб-контент, управляемый пользователем).\n\nЗачастую веб-сайт, используемый злоумышленником, посещается конкретным сообществом, например правительством, определенной отраслью или регионом, где целью является скомпрометировать конкретного пользователя или группу пользователей на основе общих интересов. Этот вид целевой атаки называется стратегическим веб-компрометированием или атакой на водопой. Есть несколько известных примеров этого. (Цитата: Lookout-StealthMango)\n\nТипичный процесс компрометации:\n\n1. Пользователь посещает веб-сайт, на котором размещается контент, контролируемый злоумышленником.\n2. Скрипты выполняются автоматически, обычно выполняя поиск потенциально уязвимой версии браузера и плагинов. \n    * Пользователю может потребоваться помощь в этом процессе, включив сценарии или активные компоненты веб-сайта и игнорируя диалоговые окна с предупреждениями.\n3. При обнаружении уязвимой версии код эксплойта доставляется в браузер.\n4. Если эксплуатация окажется успешной, то злоумышленник выполнит код в системе пользователя, если не будут установлены другие средства защиты.\n    * В некоторых случаях перед доставкой кода эксплойта требуется повторное посещение веб-сайта после первоначального сканирования."
    },
    "T1458": {
      "name": "Репликация через съемные носители",
      "description": "Злоумышленники могут проникнуть на устройства, используя или копируя вредоносное ПО на устройства, подключенные через USB. В случае латерального перемещения злоумышленники могут использовать физическое подключение устройства к скомпрометированной или вредоносной зарядной станции или ПК, чтобы обойти требования хранилища приложений и напрямую установить вредоносные приложения. (Цитата: Лау-Мактанс). В случае первоначального доступа злоумышленники могут попытаться использовать устройство через соединение, чтобы получить доступ к данным, хранящимся на устройстве. (Цитата: Krebs-JuiceJacking) Примеры этого включают: \n \n* Использование небезопасных загрузчиков на устройстве Nexus 6 или 6P через USB и получение возможности выполнять действия, включая перехват телефонных звонков, перехват сетевого трафика и получение физического местоположения устройства. (Цитата: IBM-NexusUSB) \n* Использование слабо соблюдаемых границ безопасности в устройствах Android, таких как Google Pixel 2, через USB. (Цитата: GoogleProjectZero-OATmeal) \n* Продукты от Cellebrite и Grayshift предположительно могут использовать некоторые устройства iOS, используя физический доступ к порту данных для разблокировки пароля. (Цитата: Computerworld-iPhoneCracking)"
    },
    "T1461": {
      "name": "Обход блокировки экрана",
      "description": "Злоумышленник, имеющий физический доступ к мобильному устройству, может попытаться обойти экран блокировки устройства. Для этого существует несколько методов, в том числе:\n\n* Биометрическая подмена: если используется биометрическая аутентификация, злоумышленник может попытаться подделать механизм биометрической аутентификации мобильного устройства. И iOS, и Android частично смягчают эту атаку, требуя код доступа устройства, а не биометрические данные, чтобы разблокировать устройство после каждого перезапуска устройства и через заданное или случайное время. (Цитата: SRLabs-Fingerprint) (Цитата: TheSun-FaceID)\n* Обход кода разблокировки. Злоумышленник может попытаться подобрать или иным образом угадать код доступа к экрану блокировки (обычно PIN-код или пароль), в том числе физически наблюдать («серфинг через плечо»), как владелец устройства использует код доступа к экрану блокировки. Поставщики мобильных ОС частично смягчают эту проблему, внедряя дополнительные таймеры задержки после заданного количества неудачных попыток разблокировки, а также настраиваемую полную очистку устройства после нескольких неудачных попыток разблокировки.\n* Использование уязвимости: периодически демонстрировались методы, позволяющие использовать мобильные устройства для обхода экрана блокировки. Уязвимости обычно исправляются производителем устройства или ОС после их обнаружения. (Цитата: Wired-AndroidBypass) (Цитата: Kaspersky-iOSBypass)"
    },
    "T1464": {
      "name": "Сетевой отказ в обслуживании",
      "description": "Злоумышленники могут выполнять атаки типа «отказ в обслуживании» (DoS), чтобы ухудшить или заблокировать доступность целевых ресурсов для пользователей. Сетевой DoS может быть выполнен путем исчерпания пропускной способности сети, от которой зависят службы, или путем подавления сигнала, поступающего на устройства или исходящего от них.\n\nСетевой DoS произойдет, когда злоумышленник сможет глушить радиосигналы (например, Wi-Fi, сотовую связь, GPS) вокруг устройства, чтобы предотвратить его связь. Например, для подавления сигнала сотовой связи злоумышленник может использовать портативный глушитель сигнала, который глушит устройства в радиусе действия глушителя. (Цитата: NIST-SP800187).\n\nИспользование сотовых помех было задокументировано при нескольких арестах, о которых сообщалось в новостях."
    },
    "T1471": {
      "name": "Данные зашифрованы для повышения эффективности",
      "description": "Злоумышленник может зашифровать файлы, хранящиеся на мобильном устройстве, чтобы запретить пользователю доступ к ним. Это может быть сделано для того, чтобы получить от жертвы денежную компенсацию в обмен на дешифрование или ключ дешифрования (программа-вымогатель) или сделать данные навсегда недоступными в случаях, когда ключ не сохраняется или не передается."
    },
    "T1474": {
      "name": "Компромисс в цепочке поставок",
      "description": "Злоумышленники могут манипулировать продуктами или механизмами доставки продуктов до их получения конечным потребителем с целью компрометации данных или системы.\n\nКомпрометация цепочки поставок может произойти на любом этапе цепочки поставок, включая:\n\n* Манипулирование инструментами разработки.\n* Манипулирование средой разработки\n* Манипулирование репозиториями исходного кода (публичными или частными)\n* Манипулирование исходным кодом в зависимостях с открытым исходным кодом.\n* Манипулирование механизмами обновления/распространения программного обеспечения.\n* Скомпрометированные/инфицированные образы системы.\n* Замена легального ПО на модифицированные версии\n* Продажа модифицированной/контрафактной продукции законным дистрибьюторам.\n* Запрет на отправку\n\nХотя компрометация цепочки поставок может повлиять на любой компонент аппаратного или программного обеспечения, злоумышленники, стремящиеся добиться исполнения, часто сосредотачиваются на вредоносных дополнениях к легальному программному обеспечению в каналах распространения или обновления программного обеспечения. Таргетинг может быть специфичным для желаемой группы жертв, или вредоносное программное обеспечение может распространяться среди широкого круга потребителей, но переходить только к дополнительным тактикам в отношении конкретных жертв.  Популярные проекты с открытым исходным кодом, которые используются в качестве зависимостей во многих приложениях, также могут быть использованы как средство добавления вредоносного кода пользователям зависимостей, особенно с широким использованием сторонних рекламных библиотек. (Цитата: Grace-Advertisement) (Цитирование: NowSecure-RemoteCode)"
    },
    "T1474.001": {
      "name": "Компрометация программных зависимостей и инструментов разработки",
      "description": "Злоумышленники могут манипулировать продуктами или механизмами доставки продуктов до их получения конечным потребителем с целью компрометации данных или системы. Правильная работа приложений часто зависит от внешнего программного обеспечения. Популярные проекты с открытым исходным кодом, которые используются в качестве зависимостей во многих приложениях, могут быть использованы как средство добавления вредоносного кода пользователям зависимости. (Цитата: Grace-Advertisement)"
    },
    "T1474.002": {
      "name": "Компрометированная цепочка поставок оборудования",
      "description": "Злоумышленники могут манипулировать аппаратными компонентами продуктов до их получения конечным потребителем с целью компрометации данных или системы. Модифицируя аппаратное или встроенное ПО в цепочке поставок, злоумышленники могут внедрить бэкдор в потребительские сети, который может быть трудно обнаружить, и предоставить злоумышленнику высокую степень контроля над системой."
    },
    "T1474.003": {
      "name": "Цепочка поставок скомпрометированного программного обеспечения",
      "description": "Злоумышленники могут манипулировать прикладным программным обеспечением до его получения конечным потребителем с целью компрометации данных или системы. Компрометация программного обеспечения в цепочке поставок может происходить разными способами, включая манипуляции с исходным кодом приложения, манипуляции с механизмом обновления/распространения этого программного обеспечения или замену скомпилированных выпусков модифицированной версией."
    },
    "T1481": {
      "name": "Веб-сервис",
      "description": "Злоумышленники могут использовать существующую легитимную внешнюю веб-службу в качестве средства передачи данных в скомпрометированную систему или из нее. Популярные веб-сайты и социальные сети, выступающие в качестве механизма C2, могут обеспечить значительное прикрытие. Это связано с вероятностью того, что узлы в сети уже обмениваются данными с ними до компрометации. Использование общих сервисов, таких как Google или Twitter, позволяет злоумышленникам скрыться в ожидаемом шуме. Поставщики веб-сервисов обычно используют шифрование SSL/TLS, предоставляя злоумышленникам дополнительный уровень защиты.\n\n\n\nИспользование веб-сервисов может также защитить внутреннюю инфраструктуру C2 от обнаружения посредством двоичного анализа вредоносных программ или обеспечить эксплуатационную устойчивость (поскольку эта инфраструктура может динамически изменяться)."
    },
    "T1481.001": {
      "name": "Решатель тупиков",
      "description": "Злоумышленники могут использовать существующую легитимную внешнюю веб-службу для размещения информации, указывающей на дополнительную инфраструктуру управления и контроля (C2). Злоумышленники могут публиковать контент, известный как средство разрешения тупиковых ситуаций, на веб-службах со встроенными (и часто запутанными/закодированными) доменами или IP-адресами. После заражения жертвы обратятся к этим преобразователям и будут перенаправлены ими.\n\n\n\nПопулярные веб-сайты и социальные сети, выступающие в качестве механизма C2, могут обеспечить значительное прикрытие. Это связано с вероятностью того, что узлы в сети уже обмениваются данными с ними до компрометации. Использование общих сервисов, таких как Google или Twitter, позволяет злоумышленникам скрыться в ожидаемом шуме. Поставщики веб-сервисов обычно используют шифрование SSL/TLS, предоставляя злоумышленникам дополнительный уровень защиты.\n\n\n\nИспользование преобразователя тупиковых ситуаций может также защитить внутреннюю инфраструктуру C2 от обнаружения посредством двоичного анализа вредоносных программ или обеспечить эксплуатационную устойчивость (поскольку эта инфраструктура может быть динамически изменена)."
    },
    "T1481.002": {
      "name": "Двунаправленная связь",
      "description": "Злоумышленники могут использовать существующий законный внешний канал веб-службы в качестве средства для отправки команд и получения выходных данных из скомпрометированной системы. Скомпрометированные системы могут использовать популярные веб-сайты и социальные сети для размещения инструкций по управлению и контролю (C2). Эти зараженные системы могут затем отправить выходные данные этих команд обратно по этому каналу веб-службы. Обратный трафик может возникать различными способами в зависимости от используемого веб-сервиса. Например, обратный трафик может принимать форму публикации скомпрометированной системой комментария на форуме, отправки запроса на включение в проект разработки, обновления документа, размещенного на веб-службе, или отправки твита.\n\n\n\nПопулярные веб-сайты и социальные сети, выступающие в качестве механизма C2, могут обеспечить значительное прикрытие. Это связано с вероятностью того, что узлы в сети уже обмениваются данными с ними до компрометации. Использование общих сервисов, таких как Google или Twitter, позволяет злоумышленникам скрыться в ожидаемом шуме. Поставщики веб-сервисов обычно используют шифрование SSL/TLS, предоставляя злоумышленникам дополнительный уровень защиты."
    },
    "T1481.003": {
      "name": "Односторонняя связь",
      "description": "Злоумышленники могут использовать существующий легитимный внешний канал веб-службы в качестве средства для отправки команд скомпрометированной системе без получения обратного вывода. Скомпрометированные системы могут использовать популярные веб-сайты и социальные сети для размещения инструкций по управлению и контролю (C2). Зараженные системы могут решить отправить выходные данные этих команд обратно по другому каналу C2, в том числе в другой отдельный веб-сервис. Альтернативно, скомпрометированные системы могут вообще не возвращать никаких данных в тех случаях, когда злоумышленники хотят отправить инструкции системам и не хотят ответа.\n\n\n\nПопулярные веб-сайты и социальные сети, выступающие в качестве механизма C2, могут обеспечить значительное прикрытие. Это связано с вероятностью того, что узлы в сети уже обмениваются данными с ними до компрометации. Использование общих сервисов, таких как Google или Twitter, позволяет злоумышленникам скрыться в ожидаемом шуме. Поставщики веб-сервисов обычно используют шифрование SSL/TLS, предоставляя злоумышленникам дополнительный уровень защиты."
    },
    "T1509": {
      "name": "Нестандартный порт",
      "description": "Злоумышленники могут генерировать сетевой трафик, используя пару протокола и порта, которые обычно не связаны. For example, HTTPS over port 8088 or port 587 as opposed to the traditional port 443. Adversaries may make changes to the standard port used by a protocol to bypass filtering or muddle analysis/parsing of network data."
    },
    "T1512": {
      "name": "Захват видео",
      "description": "Злоумышленник может использовать камеры устройства для сбора информации путем захвата видеозаписей. Изображения также могут быть записаны, возможно, через определенные промежутки времени, вместо видеофайлов.\n\n\n\nВредоносное ПО или скрипты могут взаимодействовать с камерами устройства через доступный API, предоставляемый операционной системой. Видеофайлы или файлы изображений могут быть записаны на диск и удалены позже. Этот метод отличается от [Захвата экрана](https://attack.mitre.org/techniques/T1513) тем, что камеры устройства используются для записи видео, а не для захвата экрана жертвы.\n\n\n\nВ Android приложение должно иметь разрешение android.permission.CAMERA для доступа к камерам. В iOS приложения должны включать ключ NSCameraUsageDescription в файл Info.plist. В обоих случаях пользователь должен предоставить запрашивающему приложению разрешение на использование камеры. Если устройство было рутировано или взломано, злоумышленник может получить доступ к камере без ведома пользователя."
    },
    "T1513": {
      "name": "Снимок экрана",
      "description": "Злоумышленники могут использовать снимок экрана для сбора дополнительной информации о целевом устройстве, такой как приложения, работающие на переднем плане, пользовательские данные, учетные данные или другую конфиденциальную информацию. Приложения, работающие в фоновом режиме, могут захватывать снимки экрана или видео другого приложения, работающего на переднем плане, с помощью Android MediaProjectionManager (обычно требуется, чтобы пользователь устройства дал согласие). Доступ к Android Debug Bridge (adb) может вызывать команды Android `screencap` или `screenrecord`. (Цитата: Android ScreenCap2 2019) (Цитата: Trend Micro ScreenCap, июль 2015 г.)"
    },
    "T1516": {
      "name": "Входная инъекция",
      "description": "Вредоносное приложение может вводить данные в пользовательский интерфейс, чтобы имитировать взаимодействие с пользователем посредством злоупотребления API-интерфейсами специальных возможностей Android.\n\n[Input Injection](https://attack.mitre.org/techniques/T1516) можно осуществить любым из следующих методов:\n\n* Имитация щелчков пользователя по экрану, например, для кражи денег со счета PayPal пользователя. (Цитата: android-trojan-steals-paypal-2fa)\n* Внедрение глобальных действий, таких как `GLOBAL_ACTION_BACK` (программно имитирующее физическое нажатие кнопки «Назад»), для запуска действий от имени пользователя. (Цитата: Talos Gustuff, апрель 2019 г.)\n* Вставка ввода в текстовые поля от имени пользователя. Этот метод законно используется для автоматического заполнения текстовых полей такими приложениями, как менеджеры паролей. (Цитата: логины с автозаполнением bitwarden)"
    },
    "T1517": {
      "name": "Доступ к уведомлениям",
      "description": "Злоумышленники могут собирать данные в уведомлениях, отправленных операционной системой или другими приложениями. Уведомления могут содержать конфиденциальные данные, такие как одноразовые коды аутентификации, отправленные по SMS, электронной почте или другими способами. В случае доступа к учетным данным злоумышленники могут попытаться перехватить одноразовый код, отправленный на устройство. Злоумышленники также могут отклонять уведомления, чтобы пользователь не заметил, что уведомление получено, и могут активировать кнопки действий, содержащиеся в уведомлениях. (Цитата: ESET 2FA Bypass)."
    },
    "T1521": {
      "name": "Зашифрованный канал",
      "description": "Злоумышленники могут явно использовать известный алгоритм шифрования для сокрытия трафика команд и управления, вместо того, чтобы полагаться на какие-либо встроенные средства защиты, обеспечиваемые протоколом связи. Несмотря на использование безопасного алгоритма, эти реализации могут быть уязвимы для обратного проектирования, если необходимые секретные ключи закодированы и/или сгенерированы в образцах/файлах конфигурации вредоносного ПО."
    },
    "T1521.001": {
      "name": "Симметричная криптография",
      "description": "Злоумышленники могут использовать известный алгоритм симметричного шифрования для сокрытия трафика команд и управления, вместо того, чтобы полагаться на какие-либо встроенные средства защиты, обеспечиваемые протоколом связи. Алгоритмы симметричного шифрования используют один и тот же ключ для шифрования открытого текста и дешифрования зашифрованного текста. Распространенные алгоритмы симметричного шифрования включают AES, Blowfish и RC4."
    },
    "T1521.002": {
      "name": "Асимметричная криптография",
      "description": "Злоумышленники могут использовать известный алгоритм асимметричного шифрования для сокрытия трафика команд и управления, вместо того, чтобы полагаться на какие-либо встроенные средства защиты, обеспечиваемые протоколом связи. Асимметричная криптография, также известная как криптография с открытым ключом, использует пару ключей для каждой стороны: один общедоступный, который может распространяться свободно, и один частный, который не должен распространяться. Благодаря принципу работы асимметричных алгоритмов отправитель шифрует данные открытым ключом получателя, а получатель расшифровывает данные своим закрытым ключом. Это гарантирует, что только предполагаемый получатель сможет прочитать зашифрованные данные. Общие алгоритмы шифрования с открытым ключом включают RSA, ElGamal и ECDSA.\n\nВ целях эффективности многие протоколы (включая SSL/TLS) используют симметричную криптографию после установления соединения, но используют асимметричную криптографию для установления или передачи ключа. Таким образом, эти протоколы классифицируются как [Асимметричная криптография] (https://attack.mitre.org/techniques/T1521/002)."
    },
    "T1521.003": {
      "name": "SSL-закрепление",
      "description": "Злоумышленники могут использовать [SSL Pinning](https://attack.mitre.org/techniques/T1521/003) для защиты трафика C2 от перехвата и анализа.\n\n[Закрепление SSL](https://attack.mitre.org/techniques/T1521/003) — это метод, обычно используемый законными веб-сайтами, чтобы гарантировать, что зашифрованные соединения разрешены только с заранее определенным сертификатом. Если представлен другой сертификат, это может указывать на компрометацию устройства, перехват трафика или другую проблему в восходящем направлении. Хотя безобидное использование является обычным явлением, злоумышленники также могут злоупотреблять этой технологией для защиты вредоносного трафика C2.\n\nПри обычной проверке SSL без закрепления, когда клиент подключается к серверу с помощью HTTPS, он обычно проверяет, подписан ли сертификат SSL/TLS сервера доверенным центром сертификации (CA) в хранилище доверенных сертификатов устройства. Если сертификат действителен и подписан доверенным центром сертификации, соединение устанавливается. Однако с помощью [SSL Pinning](https://attack.mitre.org/techniques/T1521/003) клиент настроен на доверие определенному сертификату SSL/TLS или открытому ключу, а не полагается на хранилище доверенных сертификатов устройства. Это означает, что даже если сертификат сервера подписан доверенным центром сертификации, клиент установит соединение только с сертификатом или закрепленным ключом.\n\nСуществует два типа [закрепления SSL](https://attack.mitre.org/techniques/T1521/003):\n\n1. Закрепление сертификата. Клиент сохраняет копию сертификата сервера и сравнивает ее с сертификатом, полученным во время установления связи SSL. Если сертификаты совпадают, клиент продолжает подключение. Этот подход также работает с самозаверяющими сертификатами.\n\n2. Закрепление открытого ключа. Вместо закрепления всего сертификата клиент закрепляет только открытый ключ, извлеченный из сертификата. Зачастую это более гибко, поскольку позволяет серверу обновлять свой сертификат без необходимости обновлять закрепленный сертификат или разрывать SSL-соединение."
    },
    "T1532": {
      "name": "Архивировать собранные данные",
      "description": "Злоумышленники могут сжимать и/или шифровать данные, собранные перед кражей. Сжатие данных может помочь запутать их содержимое и минимизировать использование сетевых ресурсов. Шифрование может использоваться для сокрытия информации, которая украдена, от обнаружения или для того, чтобы сделать утечку менее заметной при проверке защитником.\n\n\n\nИ сжатие, и шифрование выполняются перед эксфильтрацией и могут выполняться с использованием утилиты, библиотеки программирования или специального алгоритма."
    },
    "T1533": {
      "name": "Данные из локальной системы",
      "description": "Злоумышленники могут осуществлять поиск в локальных системных источниках, таких как файловые системы или локальные базы данных, чтобы найти интересующие файлы и конфиденциальные данные перед кражей.\n\n\n\nДоступ к локальным системным данным, включая информацию, хранящуюся в операционной системе, часто требует повышения привилегий. Примеры локальных системных данных включают токены аутентификации, кэш клавиатуры устройства, пароли Wi-Fi и фотографии. На Android злоумышленники также могут попытаться получить доступ к файлам из внешнего хранилища, что может потребовать дополнительных разрешений, связанных с хранилищем."
    },
    "T1541": {
      "name": "Постоянство переднего плана",
      "description": "Злоумышленники могут злоупотреблять API-методом Android startForeground() для обеспечения постоянного доступа к датчикам. Начиная с Android 9, простаивающие приложения, работающие в фоновом режиме, больше не имеют доступа к датчикам устройства, таким как камера, микрофон и гироскоп. (Цитата: Android-SensorsOverview) Приложения могут сохранять доступ к датчикам, работая на переднем плане, используя API-метод Android `startForeground()`. Это сообщает системе, что пользователь активно взаимодействует с приложением, и его не следует убивать. Единственное требование для запуска службы переднего плана — это постоянное уведомление пользователя. (Цитата: Android-ForegroundServices)\n\nВредоносные приложения могут злоупотреблять API-методом startForeground(), чтобы продолжать работу на переднем плане, одновременно отправляя уведомление пользователю, выдающему себя за подлинное приложение. Это обеспечит беспрепятственный доступ к датчикам устройства при условии, что разрешение было ранее предоставлено. (Цитата: BlackHat Sutter Android Foreground 2019)\n\nВредоносные приложения также могут злоупотреблять API startForeground(), чтобы информировать систему Android о том, что пользователь активно взаимодействует с приложением, тем самым предотвращая его уничтожение убийцей нехватки памяти. (Цитата: TrendMicro-Yellow Camera)"
    },
    "T1544": {
      "name": "Входная передача инструмента",
      "description": "Злоумышленники могут переносить инструменты или другие файлы из внешней системы на взломанное устройство, чтобы облегчить последующие действия. Файлы могут быть скопированы из внешней системы, контролируемой противником, через канал управления и контроля или через альтернативные протоколы с помощью другого инструмента, такого как FTP."
    },
    "T1575": {
      "name": "Собственный API",
      "description": "Злоумышленники могут использовать Native Development Kit (NDK) Android для написания собственных функций, которые могут обеспечить выполнение двоичных файлов или функций. Как и системные вызовы в традиционной операционной системе для настольных компьютеров, собственный код выполняется на более низком уровне, чем обычные вызовы Android SDK.\n\nNDK позволяет разработчикам писать собственный код на C или C++, который компилируется непосредственно в машинный код, избегая всех промежуточных языков и этапов компиляции, которые обычно есть в языках более высокого уровня, таких как Java. Собственный интерфейс Java (JNI) — это компонент, который позволяет функциям Java в приложении Android вызывать функции в собственной библиотеке. (Цитата: Начало работы с Google NDK)\n\nЗлоумышленники также могут использовать встроенные функции для выполнения вредоносного кода, поскольку встроенные действия обычно гораздо сложнее анализировать, чем стандартное, неродное поведение. (Цитата: Эффективность проверки приложений MITRE)"
    },
    "T1577": {
      "name": "Исполняемый файл приложения, скомпрометированного",
      "description": "Злоумышленники могут модифицировать приложения, установленные на устройстве, чтобы обеспечить постоянный доступ к жертве. Эти вредоносные модификации могут быть использованы для того, чтобы заставить законные приложения выполнять злоумышленные задачи, когда эти приложения используются.\n\nСуществует несколько способов, которыми злоумышленник может внедрить вредоносный код в приложения. Один из методов — воспользоваться уязвимостями устройств, наиболее известной из которых является Janus, уязвимость Android, которая позволяет злоумышленникам добавлять дополнительные байты в файлы APK (приложение) и DEX (исполняемые файлы), не затрагивая подпись файла. Имея возможность добавлять произвольные байты в действительные приложения, злоумышленники могут легко внедрить код в подлинные исполняемые файлы без ведома пользователя. (Цитата: Guardsquare Janus)\n\nЗлоумышленники также могут пересобрать приложения, включив в них вредоносные модификации. Этого можно добиться, декомпилировав подлинное приложение, объединив его с вредоносным кодом и перекомпилировав его. (Цитата: CheckPoint Agent Smith)\n\nЗлоумышленники также могут предпринимать действия, чтобы скрыть изменения в исполняемых файлах приложения и обойти согласие пользователя. Эти действия включают в себя изменение модификаций, чтобы они выглядели как обновления, или использование уязвимостей, которые позволяют вредоносному приложению выполняться внутри системного приложения. (Цитата: CheckPoint Agent Smith)"
    },
    "T1582": {
      "name": "СМС-контроль",
      "description": "Злоумышленники могут удалять, изменять или отправлять SMS-сообщения без авторизации пользователя. Это может быть использовано для сокрытия SMS-сообщений C2, распространения вредоносного ПО или различных внешних эффектов.\n\nЭто можно сделать, запросив разрешения RECEIVE_SMS или SEND_SMS в зависимости от того, что пытается сделать вредоносная программа. Если приложение установлено на устройстве в качестве обработчика SMS по умолчанию, можно зарегистрировать широковещательное намерение SMS_DELIVER, которое позволяет приложению писать поставщику контента SMS. Поставщик контента напрямую изменяет базу данных сообщений на устройстве, что может позволить вредоносным приложениям с такой возможностью вставлять, изменять или удалять произвольные сообщения на устройстве. (Цитата: SMS KitKat) (Цитата: Android SmsProvider)"
    },
    "T1603": {
      "name": "Запланированная задача/задание",
      "description": "Злоумышленники могут злоупотреблять функцией планирования задач, чтобы облегчить первоначальное или повторное выполнение вредоносного кода. В Android и iOS существуют API и библиотеки, упрощающие планирование задач для выполнения в указанную дату, время или интервал.\n\nВ Android API WorkManager позволяет планировать асинхронные задачи с помощью системы. WorkManager был представлен для унификации планирования задач на Android с внутренним использованием JobScheduler, GcmNetworkManager и AlarmManager. «WorkManager» предлагает большую гибкость для планирования, в том числе периодического, однократного или на основе ограничений (например, только когда устройство заряжается). (Цитата: Android WorkManager)\n\nВ iOS API NSBackgroundActivityScheduler позволяет планировать асинхронные задачи с помощью системы. Задачи могут быть запланированы как повторяющиеся или неповторяющиеся, однако система выбирает, когда задачи будут выполняться. Приложение может выбирать интервал повторения задач или задержку между планированием и выполнением одноразовых задач. (Цитата: Apple NSBackgroundActivityScheduler)"
    },
    "T1604": {
      "name": "Прокси через жертву",
      "description": "Злоумышленники могут использовать взломанное устройство в качестве прокси-сервера для доступа в Интернет. Используя прокси-сервер, злоумышленники скрывают истинный IP-адрес своего сервера C2 и связанной с ним инфраструктуры от места назначения сетевого трафика. Это маскирует трафик злоумышленника под законный трафик, исходящий от скомпрометированного устройства, что позволяет обойти ограничения и оповещения на основе IP в определенных службах, таких как банковские счета и веб-сайты социальных сетей. (Цитата: Threat Fabric Exobot)\n\nСамый распространенный тип прокси — это SOCKS-прокси. Обычно его можно реализовать с использованием стандартных API-интерфейсов уровня ОС и сторонних библиотек без указания пользователю. В Android злоумышленники могут использовать API «Прокси» для программного установления прокси-соединения SOCKS или API более низкого уровня для прямого взаимодействия с необработанными сокетами."
    },
    "T1616": {
      "name": "Управление вызовами",
      "description": "Злоумышленники могут совершать, пересылать или блокировать телефонные звонки без авторизации пользователя. Это может быть использовано для злоумышленных целей, таких как аудионаблюдение, блокировка или переадресация вызовов от владельца устройства или связь C2.\n\nДля программного управления телефонными звонками можно использовать несколько разрешений, в том числе:\n\n* `ANSWER_PHONE_CALLS` - Позволяет приложению отвечать на входящие телефонные звонки (Цитата: Разрешения Android)\n* `CALL_PHONE` — позволяет приложению инициировать телефонный звонок без использования интерфейса Dialer (Цитата: Разрешения Android)\n* `PROCESS_OUTGOING_CALLS` - Позволяет приложению видеть набираемый номер во время исходящего звонка с возможностью перенаправить вызов на другой номер или вообще прервать вызов (Цитата: Разрешения Android)\n* `MANAGE_OWN_CALLS` — разрешает вызывающему приложению, которое управляет собственными вызовами через самоуправляемые API `ConnectionService` (Цитата: Разрешения Android).\n* `BIND_TELECOM_CONNECTION_SERVICE` — необходимое разрешение при использовании `ConnectionService` (Цитата: Разрешения Android)\n* `WRITE_CALL_LOG` — позволяет приложению записывать в журнал вызовов устройства, возможно, для сокрытия вредоносных телефонных звонков (Цитата: Разрешения Android)\n\nПри предоставлении некоторых из этих разрешений приложение может совершать телефонные звонки, не открывая предварительно номеронабиратель. Однако, если приложение хочет просто перенаправить пользователя на номеронабиратель с заполненным номером телефона, оно может запустить намерение с помощью Intent.ACTION_DIAL, для которого не требуются специальные разрешения. Затем пользователю необходимо явно инициировать вызов или использовать какую-либо форму [Input Injection](https://attack.mitre.org/techniques/T1516) для его программной инициации."
    },
    "T1617": {
      "name": "Зацепка",
      "description": "Злоумышленники могут использовать перехват, чтобы скрыть наличие артефактов, связанных с их поведением, и избежать обнаружения. Перехват можно использовать для изменения возвращаемых значений или структур данных системных API и вызовов функций. Этот процесс обычно включает использование сторонних корневых сред, таких как Xposed или Magisk, либо с системным эксплойтом, либо с уже существующим корневым доступом. Включая специальные модули для корневых инфраструктур, злоумышленники могут перехватывать системные API и изменять возвращаемое значение и/или структуры системных данных, чтобы изменить функциональность/видимость различных аспектов системы."
    },
    "T1623": {
      "name": "Интерпретатор команд и сценариев",
      "description": "Злоумышленники могут злоупотреблять интерпретаторами команд и сценариев для выполнения команд, сценариев или двоичных файлов. Эти интерфейсы и языки обеспечивают способы взаимодействия с компьютерными системами и являются общей особенностью многих различных платформ. Большинство систем имеют встроенный интерфейс командной строки и возможности создания сценариев. Например, Android является UNIX-подобной ОС и включает в себя базовую [Unix Shell] (https://attack.mitre.org/techniques/T1623/001), доступ к которой можно получить через Android Debug Bridge (ADB) или Java-пакет Runtime.\n\nЗлоумышленники могут различными способами злоупотреблять этими технологиями как средством выполнения произвольных команд. Команды и сценарии могут быть встроены в полезные нагрузки [Первоначальный доступ](https://attack.mitre.org/tactics/TA0027), доставляемые жертвам в виде документов-приманок или как вторичные полезные нагрузки, загруженные из существующего C2. Злоумышленники также могут выполнять команды через интерактивные терминалы/оболочки."
    },
    "T1623.001": {
      "name": "Unix-оболочка",
      "description": "Злоумышленники могут злоупотреблять командами оболочки Unix и сценариями при выполнении. Оболочки Unix — это базовые командные строки на устройствах Android и iOS. Оболочки Unix могут контролировать каждый аспект системы, при этом некоторые команды требуют повышенных привилегий, которые доступны только в том случае, если устройство было рутировано или взломано.\n\nОболочки Unix также поддерживают сценарии, которые позволяют последовательно выполнять команды, а также другие типичные операции программирования, такие как условные выражения и циклы. Обычное использование сценариев оболочки включает длительные или повторяющиеся задачи или необходимость запуска одного и того же набора команд в нескольких системах.\n\nЗлоумышленники могут злоупотреблять оболочками Unix для выполнения различных команд или полезных данных. Доступ к интерактивным оболочкам можно получить через каналы управления и контроля или во время бокового перемещения, например, с помощью SSH. Злоумышленники также могут использовать сценарии оболочки для доставки и выполнения нескольких команд жертвам или в качестве части полезных данных, используемых для сохранения.\n\nЕсли устройство было рутировано или взломано, злоумышленники могут найти и вызвать двоичный файл суперпользователя, чтобы повысить свои привилегии и взаимодействовать с системой как пользователь root. Этот опасный уровень разрешений позволяет злоумышленнику запускать специальные команды и изменять защищенные системные файлы."
    },
    "T1624": {
      "name": "Выполнение по событию",
      "description": "Злоумышленники могут установить постоянство, используя системные механизмы, которые запускают выполнение на основе определенных событий. Мобильные операционные системы имеют средства подписки на такие события, как получение SMS-сообщения, завершение загрузки устройства или другие действия устройства.\n\nЗлоумышленники могут злоупотреблять этими механизмами как средством поддержания постоянного доступа к жертве посредством автоматического и многократного выполнения вредоносного кода. Получив доступ к системе жертвы, злоумышленники могут создавать или изменять триггеры событий, чтобы указывать на вредоносный контент, который будет выполняться при каждом вызове триггера события."
    },
    "T1624.001": {
      "name": "Вещательные приемники",
      "description": "Злоумышленники могут установить постоянство, используя системные механизмы, которые запускают выполнение на основе определенных событий. Мобильные операционные системы имеют средства подписки на такие события, как получение SMS-сообщения, завершение загрузки устройства или другие действия устройства.\n\nНамерение — это сообщение, передаваемое между приложениями Android или компонентами системы. Приложения могут регистрироваться для получения широковещательных намерений во время выполнения, которые представляют собой общесистемные намерения, доставляемые каждому приложению, когда на устройстве происходят определенные события, такие как изменения в сети или разблокировка экрана пользователем. Вредоносные приложения могут затем инициировать определенные действия внутри приложения в зависимости от того, какое широковещательное намерение было получено.\n\nПомимо намерений системы Android, вредоносные приложения могут регистрироваться для намерений, транслируемых другими приложениями. Это позволяет вредоносному ПО реагировать на действия других приложений. Такое поведение обычно указывает на более глубокие знания или, возможно, нацеливание на конкретные устройства, пользователей или приложения.\n\nВ Android 8 (уровень API 26) поведение широковещательных намерений было изменено, ограничивая неявные намерения, которые приложения могут регистрировать в манифесте. В большинстве случаев приложения, регистрирующиеся через манифест, больше не будут получать широковещательные сообщения. Теперь приложения должны регистрировать приемники вещания с учетом контекста, пока пользователь активно использует приложение. (Цитата: Android Changes to System Broadcasts)"
    },
    "T1625": {
      "name": "Порядок выполнения перехвата",
      "description": "Злоумышленники могут выполнять свои собственные вредоносные программы, перехватывая способ запуска приложений в операционных системах. Перехват потока выполнения может осуществляться в целях сохранения, поскольку такое перехваченное выполнение может повторяться со временем.\n\nСуществует много способов, которыми злоумышленник может перехватить ход выполнения. Основной способ — манипулировать тем, как операционная система находит программы для выполнения. Также можно перехватить то, как операционная система находит библиотеки, которые будут использоваться программой. Места, в которых операционная система ищет программы или ресурсы, например каталоги с файлами, также могут быть заражены вредоносными полезными нагрузками."
    },
    "T1625.001": {
      "name": "Взлом API среды выполнения системы",
      "description": "Злоумышленники могут выполнять свои собственные вредоносные программы, перехватывая способ запуска приложений в операционной системе. Перехват потока выполнения может осуществляться в целях сохранения, поскольку это перехваченное выполнение может повториться в более поздние моменты времени.\n\nВ Android злоумышленники могут перезаписать стандартную библиотеку API ОС вредоносной альтернативой, позволяющей подключиться к основным функциям для обеспечения устойчивости. При этом код злоумышленника будет выполняться каждый раз, когда перезаписанная функция API вызывается приложением на зараженном устройстве."
    },
    "T1626": {
      "name": "Механизм контроля над злоупотреблениями",
      "description": "Злоумышленники могут обходить механизмы, предназначенные для управления повышенными привилегиями, чтобы получить разрешения более высокого уровня. Большинство современных систем содержат встроенные механизмы контроля прав, предназначенные для ограничения привилегий, которые пользователь может получить на машине. Авторизация должна быть предоставлена ​​конкретным пользователям для выполнения задач, отнесенных к группе повышенного риска. Злоумышленник может использовать несколько методов, чтобы воспользоваться встроенными механизмами контроля и повысить привилегии в системе."
    },
    "T1626.001": {
      "name": "Разрешения администратора устройства",
      "description": "Злоумышленники могут злоупотреблять API администрирования устройств Android, чтобы получить более высокий уровень контроля над устройством. Злоупотребляя API, злоумышленники могут выполнить несколько гнусных действий, таких как сброс пароля устройства для [Отказ в обслуживании конечной точки] (https://attack.mitre.org/techniques/T1642), сброс настроек устройства до заводских настроек для [Удаление файлов] (https://attack.mitre.org/techniques/T1630/002), а также удалить любые следы вредоносного ПО, отключив все камеры устройства или затруднить удаление приложения.\n\nАдминистраторы устройств должны быть одобрены пользователем во время выполнения, при этом во всплывающем окне системы будет показано, какие действия были запрошены приложением. В сочетании с другими методами, такими как [Input Injection] (https://attack.mitre.org/techniques/T1516), приложение может программно предоставлять себе права администратора без какого-либо вмешательства пользователя."
    },
    "T1627": {
      "name": "Ограждения исполнения",
      "description": "Злоумышленники могут использовать ограничения выполнения, чтобы ограничить выполнение или действия на основе предоставленных злоумышленником условий и конкретных условий среды, которые, как ожидается, будут присутствовать на цели. Ограждения гарантируют, что полезная нагрузка будет действовать только против намеченной цели, и уменьшат побочный ущерб от кампании противника. Значения, которые злоумышленник может предоставить о целевой системе или среде для использования в качестве ограждений, могут включать информацию об окружающей среде, например местоположение. (Цитата: SWB Exodus, март 2019 г.)\n\nОграждения можно использовать для предотвращения раскрытия возможностей в средах, которые не предназначены для взлома или эксплуатации внутри них. Такое использование ограждений отличается от типичных [Проверок системы] (https://attack.mitre.org/techniques/T1633/001). Хотя использование [Проверки системы] (https://attack.mitre.org/techniques/T1633/001) может включать проверку известных значений песочницы и продолжение выполнения только в случае отсутствия совпадений, использование ограничителей будет включать проверку ожидаемого значения, специфичного для цели, и продолжение выполнения только в том случае, если такое совпадение имеется."
    },
    "T1627.001": {
      "name": "Геофенсинг",
      "description": "Злоумышленники могут использовать географическое местоположение устройства для ограничения определенных вредоносных действий. Например, операторы вредоносных программ могут ограничить распространение полезной нагрузки второго этапа определенными географическими регионами. (Цитата: Lookout eSurv)\n\n[Геофенсинг](https://attack.mitre.org/techniques/T1627/001) достигается путем убеждения пользователя предоставить приложению разрешение на доступ к службам определения местоположения. Затем приложение может собирать, обрабатывать и фильтровать данные о местоположении устройства для выполнения действий на основе местоположения, таких как прекращение вредоносного поведения или показ рекламы для конкретного региона.\n\nОдним из способов выполнения [геофенсинга](https://attack.mitre.org/techniques/T1627/001) на Android является использование встроенного API геозон для автоматического запуска определенных действий, когда устройство входит или выходит в указанный радиус вокруг географического местоположения. Подобно другим методам [Geofencing](https://attack.mitre.org/techniques/T1627/001), для этого требуется, чтобы пользователь предоставил разрешения `ACCESS_FINE_LOCATION` и `ACCESS_BACKGROUND_LOCATION`. Последнее требуется только в том случае, если приложение предназначено для Android 10 (уровень API 29) или выше. Однако в Android 11 появились дополнительные элементы управления разрешениями, которые могут ограничивать сбор фонового местоположения в зависимости от выбора разрешений пользователя во время выполнения. Эти дополнительные элементы управления включают параметр «Разрешить только при использовании приложения», который фактически запрещает сбор данных о местоположении в фоновом режиме.\n\nАналогично, в iOS разработчики могут использовать встроенные API для настройки и выполнения геозон. В зависимости от варианта использования приложению потребуется либо вызвать requestWhenInUseAuthorization(), либо requestAlwaysAuthorization(), в зависимости от того, когда требуется доступ к службам определения местоположения. Как и в случае с Android, пользователи также имеют возможность ограничить доступ приложения к местоположению устройства, включая одноразовое использование и только тогда, когда приложение работает на переднем плане.\n\n[Geofencing](https://attack.mitre.org/techniques/T1627/001) можно использовать для предотвращения раскрытия возможностей в средах, которые не предназначены для взлома или эксплуатации внутри них. Например, данные о местоположении могут использоваться для ограничения распространения и/или возможностей вредоносного ПО, что также потенциально может обойти среды анализа приложений (например, анализ вредоносного ПО за пределами целевой географической области). Другие злонамеренные варианты использования могут включать показ подсказок и/или рекламных объявлений для конкретного языка."
    },
    "T1628": {
      "name": "Скрыть артефакты",
      "description": "Злоумышленники могут попытаться скрыть артефакты, связанные с их поведением, чтобы избежать обнаружения. Мобильные операционные системы имеют функции и API-интерфейсы разработчика, позволяющие скрывать различные артефакты, такие как значок запуска приложения. Эти API имеют законное использование, например, скрытие значка, чтобы избежать беспорядка в панели приложений, когда приложение не имеет удобного интерфейса. Злоумышленники могут злоупотреблять этими функциями и API, чтобы скрыть артефакты от пользователя и избежать обнаружения."
    },
    "T1628.001": {
      "name": "Подавить значок приложения",
      "description": "Вредоносное приложение может запретить отображение своего значка пользователю в средстве запуска приложений. Это скроет тот факт, что оно установлено, и может затруднить удаление приложения пользователем. Программное скрытие значка приложения не требует каких-либо специальных разрешений.\n\nТакое поведение было замечено в семействе вредоносных программ BankBot/Spy Banker.\n\nНачиная с Android 10, были внесены изменения, запрещающие вредоносным приложениям скрывать свой значок. Если приложение является системным, не запрашивает разрешения или не имеет активности запуска, значок приложения будет полностью скрыт. Далее, если устройство полностью управляемое или приложение находится в рабочем профиле, значок будет полностью скрыт. В противном случае отображается синтезированная активность, представляющая собой значок панели запуска, представляющий страницу сведений о приложении в настройках системы. Если пользователь нажимает на синтезированную активность в панели запуска, он попадает на страницу сведений о приложении в настройках системы. (Цитата: Ограничения Android 10 на скрытие значков приложений) (Цитата: LauncherApps getActivityList)"
    },
    "T1628.002": {
      "name": "Уклонение пользователя",
      "description": "Злоумышленники могут попытаться избежать обнаружения, скрывая от пользователя вредоносное поведение. При этом модификации злоумышленника, скорее всего, останутся установленными на устройстве дольше, что позволит злоумышленнику продолжать работать на этом устройстве.\n\nХотя существует множество способов добиться этого, один из них — использование датчиков устройства. Используя различные датчики движения на устройстве, такие как акселерометр или гироскоп, приложение может обнаружить, что с устройством взаимодействуют. Таким образом, приложение может продолжать работать, пока устройство не используется, но прекращать работу, пока пользователь использует устройство, скрывая все, что могло бы указывать на продолжающуюся вредоносную активность. Доступ к датчикам таким способом не требует каких-либо разрешений от пользователя, поэтому он будет полностью прозрачным."
    },
    "T1628.003": {
      "name": "Скрыть мультимедийные файлы",
      "description": "Злоумышленники могут попытаться скрыть от пользователя мультимедийные файлы. Поступая таким образом, злоумышленники могут скрыть захваченные файлы, такие как изображения, видео и/или снимки экрана, а затем впоследствии украсть эти файлы.\n\nСпециально для устройств Android: если в папке присутствует файл `.nomedia`, мультимедийные файлы в этой папке не будут видны пользователю в приложении «Галерея». Кроме того, другим приложениям предлагается не сканировать папку с файлом `.nomedia`, что фактически делает папку невидимой для пользователя.\n\nЭтот метод часто используется сталкерскими и шпионскими приложениями."
    },
    "T1629": {
      "name": "Ослабление защиты",
      "description": "Злоумышленники могут злонамеренно модифицировать компоненты среды жертвы, чтобы помешать или отключить защитные механизмы. Это предполагает не только ослабление превентивной защиты, такой как антивирус, но и возможности обнаружения, которые защитники могут использовать для аудита активности и выявления вредоносного поведения. Это может охватывать как встроенную защиту, так и дополнительные возможности, установленные пользователями или администраторами мобильных конечных точек."
    },
    "T1629.001": {
      "name": "Запретить удаление приложения",
      "description": "Злоумышленники могут злоупотреблять API администрирования устройств Android, чтобы помешать пользователю удалить целевое приложение. В более ранних версиях Android приложениям администратора устройства требовалось, чтобы их возможности администрирования были явно деактивированы пользователем, прежде чем приложение можно было удалить. Позже оно было обновлено, чтобы пользователь мог деактивировать и удалить приложение администратора за один шаг.\n\nЗлоумышленники также могут злоупотреблять API-интерфейсами доступности устройства, чтобы предотвратить удаление. Этот набор API позволяет приложению выполнять определенные действия от имени пользователя и программно определять, что отображается на экране. Вредоносное приложение может отслеживать экран устройства на наличие определенных модальных окон (например, модального окна подтверждения удаления приложения) и вводить вводимые данные с экрана или нажимать кнопку «Назад», чтобы закрыть модальное окно. Например, API-интерфейс «performGlobalAction(int)» Android можно использовать, чтобы запретить пользователю удалять вредоносное приложение с устройства после установки. Если пользователь хочет удалить вредоносное приложение, могут возникнуть два случая, оба из которых не позволяют пользователю удалить приложение.\n\n* Случай 1. Если целочисленный аргумент, переданный в вызов API, равен `2` или `GLOBAL_ACTION_HOME`, вредоносное приложение может перенаправить пользователя на главный экран с экрана настроек.\n\n* Случай 2: Если целочисленный аргумент, переданный в вызов API, равен «1» или «GLOBAL_ACTION_BACK», вредоносное приложение может эмулировать событие обратного нажатия."
    },
    "T1629.002": {
      "name": "Блокировка устройства",
      "description": "Злоумышленник может попытаться воспрепятствовать взаимодействию пользователя, блокируя доступ законного пользователя к устройству. Обычно это достигается путем запроса разрешений администратора устройства и последующей блокировки экрана с помощью DevicePolicyManager.lockNow(). Были замечены и другие новые методы блокировки пользователя на устройстве, такие как постоянное наложение, использование тщательно продуманных экранов уведомлений о вызовах и блокировка HTML-страниц на переднем плане. Эти методы может быть очень сложно обойти, и обычно для удаления вредоносного ПО требуется загрузка устройства в безопасном режиме.\n\nДо Android 7 администраторы устройств могли сбросить пароль блокировки устройства, чтобы пользователь не смог разблокировать устройство. В выпуске Android 7 были представлены обновления, которые позволяют сбрасывать пароль устройства только владельцам устройств или профилей (например, MDM). (Цитата: Android resetPassword)"
    },
    "T1629.003": {
      "name": "Отключить или изменить инструменты",
      "description": "Злоумышленники могут отключить инструменты безопасности, чтобы избежать потенциального обнаружения их инструментов и действий. Это может принимать форму отключения программного обеспечения безопасности, изменения конфигурации SELinux или других методов, препятствующих сканированию или сообщению информации средствами безопасности. Обычно это делается путем злоупотребления разрешениями администратора устройства или использования системных эксплойтов для получения root-доступа к устройству для изменения защищенных системных файлов."
    },
    "T1630": {
      "name": "Удаление индикатора на хосте",
      "description": "Злоумышленники могут удалять, изменять или скрывать созданные артефакты на устройстве, включая файлы, статус джейлбрейка или само вредоносное приложение. Эти действия могут помешать сбору событий, составлению отчетов или другим уведомлениям, используемым для обнаружения вторжений. Это может поставить под угрозу целостность решений мобильной безопасности, поскольку важные события или информация останутся незамеченными."
    },
    "T1630.001": {
      "name": "Удалить вредоносное приложение",
      "description": "Злоумышленники могут включить во вредоносное ПО функцию, которая удаляет вредоносное приложение с устройства. Этого можно достичь путем: \n \n* Злоупотребление разрешениями владельца устройства для выполнения автоматического удаления с помощью вызовов API владельца устройства. \n* Злоупотребление root-правами для удаления файлов из файловой системы. \n* Злоупотребление службой доступности. Для этого необходимо отправить в систему намерение запросить удаление, а затем злоупотребить службой специальных возможностей, чтобы щелкнуть нужные места на экране для подтверждения удаления."
    },
    "T1630.002": {
      "name": "Удаление файла",
      "description": "Злоумышленники могут стереть данные с устройства или удалить отдельные файлы, чтобы манипулировать внешними результатами или скрыть действия. Приложение должно иметь доступ администратора для полной очистки устройства, в то время как отдельные файлы могут не требовать специальных разрешений для удаления в зависимости от места их хранения. (Цитата: Android DevicePolicyManager 2019)\n\nСохраненные данные могут включать файлы различных форматов, например файлы Office, базы данных, сохраненные электронные письма и пользовательские форматы файлов. Последствия удаления файлов зависят от типа данных, а также целей и задач злоумышленника, но могут включать в себя удаление файлов обновлений для уклонения от обнаружения или удаление файлов, указанных злоумышленником для воздействия."
    },
    "T1630.003": {
      "name": "Маскировка индикаторов Root/Jailbreak",
      "description": "Злоумышленник может использовать знания о методах, используемых программным обеспечением безопасности, чтобы избежать обнаружения. (Цитата: Броди) (Цитата: Тан) Например, некоторые продукты мобильной безопасности выполняют обнаружение взломанного устройства путем поиска определенных артефактов, таких как установленный двоичный файл «su», но эту проверку можно обойти, назвав двоичный файл как-нибудь по-другому. Аналогично, методы полиморфного кода могут быть использованы для уклонения от обнаружения на основе сигнатур. (Цитата: Растоги)"
    },
    "T1631": {
      "name": "Внедрение процесса",
      "description": "Злоумышленники могут внедрить код в процессы, чтобы обойти защиту, основанную на процессах, или даже повысить привилегии. Инъекция процесса — это метод выполнения произвольного кода в адресном пространстве отдельного живого процесса. Запуск кода в контексте другого процесса может открыть доступ к памяти процесса, системным/сетевым ресурсам и, возможно, к повышенным привилегиям. Выполнение посредством внедрения процесса также может избежать обнаружения продуктами безопасности, поскольку выполнение маскируется под легитимный процесс.\n\nНи у Android, ни у iOS нет законного способа внедрения процесса. Единственный способ это возможно — злоупотребить существующим корневым доступом или использовать уязвимость."
    },
    "T1631.001": {
      "name": "Системные вызовы Ptrace",
      "description": "Злоумышленники могут внедрить вредоносный код в процессы с помощью системных вызовов ptrace (трассировка процесса), чтобы обойти защиту на основе процессов, а также, возможно, повысить привилегии. Внедрение системных вызовов Ptrace — это метод выполнения произвольного кода в адресном пространстве отдельного живого процесса.\n\nВнедрение системных вызовов Ptrace включает в себя подключение и изменение запущенного процесса. Системный вызов ptrace позволяет процессу отладки наблюдать и контролировать другой процесс (и каждый отдельный поток), включая изменение значений памяти и регистров. (Цитата: PTRACE man) Внедрение системного вызова Ptrace обычно выполняется путем записи произвольного кода в работающий процесс (например, с помощью malloc), а затем вызова этой памяти с помощью PTRACE_SETREGS для установки регистра, содержащего следующую команду для выполнения. Внедрение системного вызова Ptrace также можно выполнить с помощью `PTRACE_POKETEXT`/`PTRACE_POKEDATA`, которые копируют данные по определенному адресу в памяти целевого процесса (например, текущий адрес следующей инструкции). (Цитата: PTRACE man) (Цитата: Medium Ptrace, июль 2018 г.)\n\nВнедрение системных вызовов Ptrace может оказаться невозможным, если нацелены на процессы с высокими привилегиями, а в некоторых системах — на процессы, не являющиеся дочерними. (Цитата: BH Linux Inject)\n\nЗапуск кода в контексте другого процесса может открыть доступ к памяти процесса, системным/сетевым ресурсам и, возможно, к повышенным привилегиям. Выполнение посредством внедрения системного вызова ptrace также может избежать обнаружения продуктами безопасности, поскольку выполнение маскируется под легитимный процесс."
    },
    "T1632": {
      "name": "Подорвать контроль доверия",
      "description": "Злоумышленники могут подорвать меры безопасности, которые либо предупреждают пользователей о ненадежных действиях, либо предотвращают выполнение ненадежных приложений. Операционные системы и продукты безопасности могут содержать механизмы для идентификации программ или веб-сайтов как обладающих определенным уровнем доверия. Примеры таких функций включают в себя: разрешение запуска приложения, поскольку оно подписано действительным сертификатом подписи кода; приглашение ОС, предупреждающее пользователя о том, что приложение получено из ненадежного источника; или получить указание на то, что вы собираетесь подключиться к ненадежному сайту. Метод, который используют злоумышленники, будет зависеть от конкретного механизма, который они стремятся подорвать."
    },
    "T1632.001": {
      "name": "Изменение политики подписи кода",
      "description": "Злоумышленники могут изменить политику подписи кода, чтобы обеспечить выполнение приложений, подписанных неофициальными или неизвестными ключами. Подписание кода обеспечивает уровень подлинности приложения от разработчика, гарантируя, что программа не была подделана и получена из официального источника. Меры безопасности могут включать в себя механизмы принудительного исполнения, гарантирующие, что на устройстве может быть запущен только действительный подписанный код.\n\nНа мобильных устройствах эти элементы управления безопасностью обычно включены по умолчанию, например, предотвращение установки неизвестных приложений на Android. Злоумышленники могут изменять эти политики разными способами, включая [Input Injection](https://attack.mitre.org/techniques/T1516) или вредоносные профили конфигурации."
    },
    "T1633": {
      "name": "Виртуализация/обход песочницы",
      "description": "Злоумышленники могут использовать различные средства для обнаружения и обхода сред виртуализации и анализа. Это может включать изменение поведения после проверки наличия артефактов, указывающих на среду виртуальной машины (VME) или песочницу. Если злоумышленник обнаружит VME, он может изменить поведение своего вредоносного ПО, чтобы отключиться от жертвы или скрыть основные функции полезной нагрузки. Они также могут искать артефакты VME, прежде чем сбросить дальнейшую полезную нагрузку. Злоумышленники могут использовать информацию, полученную в результате [Виртуализации/Уклонения от песочницы](https://attack.mitre.org/techniques/T1633) во время автоматического обнаружения, для формирования последующего поведения.\n\nЗлоумышленники могут использовать несколько методов для выполнения [Виртуализации/Обхода песочницы](https://attack.mitre.org/techniques/T1633), например проверка системных артефактов, связанных с анализом или виртуализацией. Злоумышленники также могут проверять законную активность пользователя, чтобы определить, находится ли он в среде анализа."
    },
    "T1633.001": {
      "name": "Системные проверки",
      "description": "Злоумышленники могут использовать различные проверки системы, чтобы обнаружить и избежать виртуализации и сред анализа. Это может включать изменение поведения после проверки наличия артефактов, указывающих на виртуальную среду или песочницу. Если злоумышленник обнаружит виртуальную среду, он может изменить поведение своего вредоносного ПО, чтобы отключиться от жертвы или скрыть основные функции имплантата. Они также могут искать артефакты виртуализации перед удалением вторичной или дополнительной полезной нагрузки.\n\nПроверки могут включать общие свойства системы, такие как имя хоста/домена и образцы сетевого трафика. Злоумышленники также могут проверить адреса сетевых адаптеров, количество ядер ЦП и доступный размер памяти/диска.\n\nПроверки оборудования, такие как наличие датчиков движения, также могут использоваться для сбора доказательств, которые могут указывать на виртуальную среду. Злоумышленники также могут запрашивать конкретные показания с этих устройств."
    },
    "T1634": {
      "name": "Учетные данные из хранилища паролей",
      "description": "Злоумышленники могут искать общие места хранения паролей, чтобы получить учетные данные пользователя. Пароли могут храниться в нескольких местах на устройстве, в зависимости от операционной системы или приложения, в котором хранятся учетные данные. Существуют также специальные приложения, которые хранят пароли, чтобы пользователям было проще управлять ими и поддерживать их. После получения учетных данных их можно использовать для бокового перемещения и доступа к ограниченной информации."
    },
    "T1634.001": {
      "name": "Брелок",
      "description": "Злоумышленники могут собирать данные связки ключей с устройства iOS для получения учетных данных. Связки ключей — это встроенный в iOS способ отслеживать пароли и учетные данные пользователей для многих служб и функций, таких как пароли Wi-Fi, веб-сайты, защищенные заметки, сертификаты, закрытые ключи и учетные данные VPN.\n\nНа устройстве база данных связки ключей хранится за пределами изолированных программных программ приложений, чтобы предотвратить несанкционированный доступ к необработанным данным. Стандартные API-интерфейсы iOS позволяют приложениям получать доступ к собственной цепочке ключей, содержащейся в базе данных. Используя эксплойт повышения привилегий или существующий root-доступ, злоумышленники могут получить доступ ко всей зашифрованной базе данных. (Цитата: Apple Keychain Services) (Цитата: Elcomsoft Decrypt Keychain)"
    },
    "T1635": {
      "name": "Украсть токен доступа к приложению",
      "description": "Злоумышленники могут украсть токены доступа к пользовательским приложениям в качестве средства получения учетных данных для доступа к удаленным системам и ресурсам. Это может произойти посредством социальной инженерии или перехвата URI и обычно требует действий пользователя для предоставления доступа, например, через системный диалог «Открыть с помощью».\n\nТокены доступа к приложениям используются для выполнения авторизованных запросов API от имени пользователя и обычно используются для доступа к ресурсам в облачных приложениях и программном обеспечении как услуга (SaaS). Приложение, которому требуется доступ к облачным сервисам или защищенным API, может получить доступ через OAuth 2.0, используя различные протоколы авторизации. Примером часто используемой последовательности является поток предоставления кода авторизации Microsoft. (Цитата: Протоколы платформы идентификации Microsoft, май 2019 г.) (Цитата: Microsoft — поток авторизации кода OAuth — июнь 2019 г.) Токен доступа OAuth позволяет стороннему приложению взаимодействовать с ресурсами, содержащими пользовательские данные, запрошенными способами, не требуя учетных данных пользователя."
    },
    "T1635.001": {
      "name": "Перехват URI",
      "description": "Злоумышленники могут зарегистрировать унифицированные идентификаторы ресурсов (URI) для перехвата конфиденциальных данных.\n\nПриложения регулярно регистрируют URI в операционной системе, чтобы выступать в качестве обработчика ответов для различных действий, таких как вход в приложение с использованием внешней учетной записи посредством единого входа. Это позволяет приложению перехватывать перенаправления на этот конкретный URI. Если злоумышленник зарегистрируется для URI, который уже использовался подлинным приложением, он сможет перехватить данные, предназначенные для подлинного приложения, или выполнить фишинговую атаку на подлинное приложение. Перехваченные данные могут включать коды авторизации или токены OAuth, которые могут быть использованы злоумышленником для получения доступа к защищенным ресурсам. (Цитата: перехват URL-адресов Trend Micro iOS) (Цитата: IETF-PKCE)."
    },
    "T1636": {
      "name": "Защищенные данные пользователя",
      "description": "Злоумышленники могут использовать стандартные API-интерфейсы операционной системы для сбора данных из хранилищ данных с поддержкой разрешений на устройстве, таких как календарь или список контактов. Эти разрешения необходимо объявить заранее. На Android их необходимо включить в манифест приложения. В iOS они должны быть включены в файл Info.plist приложения.\n\n\n\nПочти во всех случаях пользователю необходимо предоставить доступ к хранилищу данных, к которому приложение пытается получить доступ. В последних версиях ОС поставщики ввели дополнительные элементы управления конфиденциальностью для пользователей, такие как возможность предоставлять разрешения приложению только тогда, когда приложение активно используется пользователем.\n\n\n\nЕсли устройство было взломано или рутировано, злоумышленник может получить доступ к [Защищенным данным пользователя] (https://attack.mitre.org/techniques/T1636) без ведома или одобрения пользователя."
    },
    "T1636.001": {
      "name": "Записи календаря",
      "description": "Злоумышленники могут использовать стандартные API-интерфейсы операционной системы для сбора данных записей календаря. На Android это можно сделать с помощью поставщика контента календаря. В iOS это можно сделать с помощью платформы EventKit.\n\n\n\nЕсли устройство было взломано или рутировано, злоумышленник может получить доступ к [Записям календаря] (https://attack.mitre.org/techniques/T1636/001) без ведома или одобрения пользователя."
    },
    "T1636.002": {
      "name": "Журнал вызовов",
      "description": "Злоумышленники могут использовать стандартные API-интерфейсы операционной системы для сбора данных журнала вызовов. На Android это можно сделать с помощью поставщика содержимого журнала вызовов. iOS не предоставляет стандартного API для доступа к журналу вызовов.\n\n\n\nЕсли устройство было взломано или рутировано, злоумышленник может получить доступ к [Журналу вызовов](https://attack.mitre.org/techniques/T1636/002) без ведома или одобрения пользователя."
    },
    "T1636.003": {
      "name": "Список контактов",
      "description": "Злоумышленники могут использовать стандартные API-интерфейсы операционной системы для сбора данных списка контактов. На Android это можно сделать с помощью поставщика контента контактов. В iOS это можно сделать с помощью платформы «Контакты».\n\n\n\nЕсли устройство было взломано или рутировано, злоумышленник может получить доступ к [списку контактов](https://attack.mitre.org/techniques/T1636/003) без ведома или одобрения пользователя."
    },
    "T1636.004": {
      "name": "СМС-сообщения",
      "description": "Злоумышленники могут использовать стандартные API операционной системы для сбора SMS-сообщений. На Android это можно сделать с помощью поставщика контента SMS. iOS не предоставляет стандартного API для доступа к SMS-сообщениям.\n\nЕсли устройство было взломано или рутировано, злоумышленник может получить доступ к [SMS-сообщениям](https://attack.mitre.org/techniques/T1636/004) без ведома или одобрения пользователя."
    },
    "T1636.005": {
      "name": "Счета",
      "description": "Злоумышленники могут использовать стандартные API операционной системы для сбора данных учетной записи. На Android это можно сделать с помощью API AccountManager. Например, злоумышленники могут использовать метод getAccounts() для получения списка всех учетных записей. (Цитата: Android_AccountManager_Feb2025) В iOS это можно сделать с помощью службы «Связка ключей».\n\nЕсли устройство было взломано или рутировано, злоумышленники могут получить доступ к [Учетным записям](https://attack.mitre.org/techniques/T1636/005) без ведома или одобрения пользователей."
    },
    "T1637": {
      "name": "Динамическое разрешение",
      "description": "Злоумышленники могут динамически устанавливать соединения с инфраструктурой управления и контроля, чтобы избежать обычного обнаружения и устранения последствий. Этого можно достичь с помощью вредоносного ПО, которое использует общий алгоритм с инфраструктурой, которую злоумышленник использует для получения сообщений вредоносного ПО. Этот алгоритм можно использовать для динамической настройки таких параметров, как имя домена, IP-адрес или номер порта, которые вредоносное ПО использует для управления и контроля."
    },
    "T1637.001": {
      "name": "Алгоритмы генерации доменов",
      "description": "Злоумышленники могут использовать [Алгоритмы генерации домена](https://attack.mitre.org/techniques/T1637/001) (DGA) для процедурной генерации доменных имен для таких целей, как командование и контроль связи или распространение вредоносных приложений. (Цитата: securelist rotexy 2018)\n\nDGA усложняют защитникам блокировку, отслеживание или захват канала управления и контроля, поскольку потенциально могут существовать тысячи доменов, которые вредоносное ПО может проверять на наличие инструкций."
    },
    "T1638": {
      "name": "Противник посередине",
      "description": "Злоумышленники могут попытаться расположиться между двумя или более сетевыми устройствами для поддержки последующих действий, таких как [манипуляция передаваемыми данными] (https://attack.mitre.org/techniques/T1565/002) или [отказ в обслуживании конечной точки] (https://attack.mitre.org/techniques/T1642).\n\n\n\n[Противник посередине](https://attack.mitre.org/techniques/T1638) может быть достигнут с помощью нескольких механизмов. Например, вредоносное приложение может зарегистрироваться в качестве VPN-клиента, эффективно перенаправляя трафик устройства на ресурсы, принадлежащие злоумышленнику. Для регистрации в качестве VPN-клиента требуется согласие пользователя как на Android, так и на iOS; кроме того, для устройств iOS требуется специальное право, предоставленное Apple. Альтернативно, вредоносное приложение с привилегиями эскалации может использовать эти привилегии для получения доступа к сетевому трафику.\n\nДля устройств Android злоумышленник на диске — это тип атаки AiTM, при которой злоумышленники отслеживают и манипулируют данными, которыми обмениваются приложения и внешнее хранилище. `WRITE_EXTERNAL_STORAGE`), то приложение считывает данные на устройстве и/или записывает на устройство вредоносное ПО. Хотя запрос на доступ является распространенным явлением, при злонамеренном использовании злоумышленники могут получить доступ к файлам и другим конфиденциальным данным из-за злоупотребления разрешением. Было показано, что несколько приложений уязвимы перед этой атакой; однако проверка разрешений и проверка входных данных могут смягчить эту атаку.\n\nЗа пределами мобильного устройства злоумышленники могут иметь возможность перехватывать трафик, используя мошенническую базовую станцию ​​или точку доступа Wi-Fi. Эти устройства позволят злоумышленникам перехватывать сетевой трафик после того, как он покинул устройство, пока он движется к месту назначения. В локальной сети можно использовать корпоративные методы, такие как [Отравление ARP-кэша] (https://attack.mitre.org/techniques/T1557/002) или [Подмена DHCP] (https://attack.mitre.org/techniques/T1557/003).\n\n\n\nЕсли приложения правильно шифруют свой сетевой трафик, конфиденциальные данные могут быть недоступны злоумышленникам, в зависимости от точки перехвата. Например, правильная реализация Application Transport Security (ATS) Apple и конфигурации сетевой безопасности Android (NSC) может предотвратить утечку конфиденциальных данных. (Цитата: NSC_Android)"
    },
    "T1639": {
      "name": "Эксфильтрация по альтернативному протоколу",
      "description": "Злоумышленники могут украсть данные, передав их по протоколу, отличному от протокола существующего канала управления и контроля. Данные также могут быть отправлены в альтернативное сетевое местоположение с главного сервера управления и контроля.\n\nАльтернативные протоколы включают FTP, SMTP, HTTP/S, DNS, SMB или любой другой сетевой протокол, не используемый в качестве основного канала управления и контроля. Различные каналы протоколов могут также включать веб-сервисы, такие как облачное хранилище. Злоумышленники могут также зашифровать и/или запутать эти альтернативные каналы."
    },
    "T1639.001": {
      "name": "Эксфильтрация по незашифрованному протоколу, отличному от C2",
      "description": "Злоумышленники могут украсть данные, передав их по незашифрованному сетевому протоколу, отличному от существующего канала управления и контроля. Данные также могут быть отправлены в альтернативное сетевое местоположение с главного сервера управления и контроля.\n\nЗлоумышленники могут скрыть эти данные без использования шифрования в сетевых протоколах, которые изначально не зашифрованы (например, HTTP, FTP или DNS). Злоумышленники могут использовать собственные или общедоступные алгоритмы кодирования/сжатия (например, base64) или встраивать данные в заголовки и поля протокола."
    },
    "T1640": {
      "name": "Удаление доступа к аккаунту",
      "description": "Злоумышленники могут нарушить доступность системных и сетевых ресурсов, запретив доступ к учетным записям, используемым законными пользователями. Учетные записи могут быть удалены, заблокированы или изменены (например, изменены учетные данные) с целью удаления доступа к учетным записям."
    },
    "T1641": {
      "name": "Манипулирование данными",
      "description": "Злоумышленники могут вставлять, удалять или изменять данные, чтобы манипулировать внешними результатами или скрывать действия. Манипулируя данными, злоумышленники могут попытаться повлиять на бизнес-процесс, понимание организации или принятие решений.\n\nТип модификации и ее влияние зависят от целевого приложения, процесса, а также целей и задач злоумышленника. В случае сложных систем злоумышленнику, скорее всего, потребуются специальные знания и, возможно, доступ к специализированному программному обеспечению, связанному с системой, обычно получаемому в результате длительной кампании по сбору информации, чтобы оказать желаемое воздействие."
    },
    "T1641.001": {
      "name": "Манипулирование передаваемыми данными",
      "description": "Злоумышленники могут изменять данные на пути к хранилищу или другим системам, чтобы манипулировать внешними результатами или скрыть активность. Манипулируя передаваемыми данными, злоумышленники могут попытаться повлиять на бизнес-процесс, понимание организации или принятие решений.\n\nМанипуляция может быть возможна через сетевое соединение или между системными процессами, где есть возможность развернуть инструмент, который будет перехватывать и изменять информацию. Тип модификации и ее влияние зависят от целевого механизма передачи, а также целей и задач противника. В случае сложных систем злоумышленнику, скорее всего, потребуются специальные знания и, возможно, доступ к специализированному программному обеспечению, связанному с системой, обычно получаемому в результате длительной кампании по сбору информации, чтобы оказать желаемое воздействие.\n\nОдним из способов достижения [манипулирования передаваемыми данными] (https://attack.mitre.org/techniques/T1641/001) является изменение содержимого буфера обмена устройства. Вредоносные приложения могут отслеживать активность буфера обмена через интерфейс ClipboardManager.OnPrimaryClipChangedListener на Android, чтобы определить, когда изменилось содержимое буфера обмена. Прослушивание активности буфера обмена, чтение содержимого буфера обмена и изменение содержимого буфера обмена не требуют явных разрешений приложений и могут выполняться приложениями, работающими в фоновом режиме. Однако это поведение изменилось с выпуском Android 10.\n\nЗлоумышленники могут использовать [Манипуляцию передаваемыми данными] (https://attack.mitre.org/techniques/T1641/001) для замены текста перед его вставкой. Например, замена скопированного адреса биткойн-кошелька адресом кошелька, находящимся под контролем противника.\n\n[Манипулирование передаваемыми данными](https://attack.mitre.org/techniques/T1641/001) было обнаружено в трояне Android/Clipper.C. Этот образец был обнаружен компанией ESET в приложении, распространяемом через Google Play Store и нацеленном на номера криптовалютных кошельков. (Цитата: Модификация буфера обмена ESET, февраль 2019 г.)"
    },
    "T1642": {
      "name": "Отказ в обслуживании конечной точки",
      "description": "Злоумышленники могут выполнять атаки типа «отказ в обслуживании» (DoS) на конечных точках, чтобы ухудшить или заблокировать доступность услуг для пользователей.\n\nВ версиях Android до 7 приложения могут злоупотреблять доступом администратора устройства для сброса пароля блокировки устройства, не позволяя пользователю разблокировать устройство. После Android 7 только владельцы устройств или профилей (например, MDM) могут сбросить пароль устройства. (Цитата: Android resetPassword)\n\nНа устройствах iOS этот метод не работает, поскольку серверы управления мобильными устройствами могут только удалить пароль блокировки экрана; они не могут установить новый пароль. Однако на взломанных устройствах обнаружено вредоносное ПО, которое может заблокировать пользователя на устройстве. (Цитата: Xiao-KeyRaider)"
    },
    "T1643": {
      "name": "Генерация трафика от жертвы",
      "description": "Злоумышленники могут генерировать исходящий трафик с устройств. Обычно это делается для манипулирования внешними результатами, например, для мошенничества с выставлением счетов операторами связи или для манипулирования рейтингами или рейтингами в магазинах приложений. Исходящий трафик обычно генерируется в виде SMS-сообщений или общего веб-трафика, но может принимать и другие формы.\n\nЕсли это делается с помощью SMS-сообщений, приложения Android должны иметь разрешение SEND_SMS. Кроме того, для отправки SMS-сообщения требуется согласие пользователя, если получателем является премиум-номер. Приложения не могут отправлять SMS-сообщения на iOS"
    },
    "T1644": {
      "name": "Внеполосные данные",
      "description": "Злоумышленники могут связываться со скомпрометированными устройствами, используя внешние потоки данных. Это может быть сделано по разным причинам, в том числе для уклонения от мониторинга сетевого трафика, в качестве резервного метода управления и контроля или для кражи данных, если устройство не подключено к каким-либо сетям, предоставляющим Интернет (например, сотовой связи или Wi-Fi). Существует несколько внешних потоков данных, таких как SMS-сообщения, NFC и Bluetooth.\n\n\n\nВ Android приложения могут считывать push-уведомления для захвата содержимого SMS-сообщений или других внешних потоков данных. Для этого пользователю необходимо вручную предоставить приложению доступ к уведомлениям через меню настроек. Однако приложение может запустить намерение, чтобы перенаправить пользователя прямо туда.\n\n\n\nВ iOS нет возможности программно читать push-уведомления."
    },
    "T1645": {
      "name": "Двоичный код скомпрометированного клиентского программного обеспечения",
      "description": "Злоумышленники могут модифицировать двоичные файлы системного программного обеспечения, чтобы обеспечить постоянный доступ к устройствам. Двоичные файлы системного программного обеспечения используются базовой операционной системой и пользователями через adb или эмуляторы терминала.\n\nЗлоумышленники могут вносить изменения в двоичные файлы клиентского программного обеспечения для выполнения вредоносных задач во время их выполнения. Например, вредоносное ПО может поставляться с предварительно скомпилированным вредоносным двоичным файлом, предназначенным для перезаписи подлинного файла на устройстве. Поскольку эти двоичные файлы могут регулярно выполняться системой или пользователем, злоумышленник может использовать это для постоянного доступа к устройству."
    },
    "T1646": {
      "name": "Эксфильтрация по каналу C2",
      "description": "Злоумышленники могут украсть данные, передав их по существующему каналу управления и контроля. Украденные данные кодируются в обычный канал связи с использованием того же протокола, что и связь командования и управления."
    },
    "T1655": {
      "name": "Маскарад",
      "description": "Злоумышленники могут попытаться манипулировать функциями своих артефактов, чтобы они выглядели легитимными или безопасными для пользователей и/или инструментов безопасности. Маскарад происходит, когда имя, местоположение или внешний вид объекта, законного или вредоносного, манипулируются или злоупотребляются ради уклонения от защиты и наблюдения. Это может включать манипулирование метаданными файла, обман пользователей, заставляющих их неправильно идентифицировать тип файла, а также предоставление законных имен задач или служб.\n\nПереименование вредоносных системных утилит для уклонения от мониторинга безопасности также является формой [маскирования] (https://attack.mitre.org/techniques/T1655)."
    },
    "T1655.001": {
      "name": "Соответствовать законному имени или местоположению",
      "description": "Злоумышленники могут совпадать или приближаться к имени или расположению законных файлов или ресурсов при их именовании/размещении. Это делается ради уклонения от защиты и наблюдения. Это можно сделать, присвоив артефактам имя и значок законного, доверенного приложения (например, «Настройки») или используя имя пакета, соответствующее законным, доверенным приложениям (например, «com.google.android.gm»).\n\nЗлоумышленники также могут использовать тот же значок файла или приложения, которое они пытаются имитировать."
    },
    "T1658": {
      "name": "Эксплуатация для выполнения клиента",
      "description": "Злоумышленники могут использовать уязвимости программного обеспечения в клиентских приложениях для выполнения кода. В программном обеспечении могут существовать уязвимости из-за небезопасных методов кодирования, которые могут привести к непредвиденному поведению. Злоумышленники могут воспользоваться определенными уязвимостями посредством целенаправленной эксплуатации с целью выполнения произвольного кода. Зачастую наиболее ценными эксплойтами для атакующего инструментария являются те, которые можно использовать для получения выполнения кода в удаленной системе, поскольку их можно использовать для получения доступа к этой системе. Пользователи ожидают увидеть файлы, относящиеся к приложениям, которые они обычно используют для работы, поэтому они являются полезной целью для исследований и разработок эксплойтов из-за их высокой полезности.\n\nЗлоумышленники могут использовать эксплойты с нулевым щелчком мыши на устройствах для выполнения кода. Эти эксплойты эффективны, поскольку для выполнения кода не требуется никакого взаимодействия с пользователем.\n\n### Доставка SMS/iMessage\n\nSMS и iMessage в iOS являются общими целями посредством [Drive-By Compromise](https://attack.mitre.org/techniques/T1456), [фишинга](https://attack.mitre.org/techniques/T1660) и т. д. Злоумышленники могут использовать вредоносные ссылки, файлы и т. д. в SMS-сообщениях или iMessages. Мобильные устройства могут быть скомпрометированы с помощью эксплойтов с одним щелчком мыши, когда жертва должна взаимодействовать с текстовым сообщением, или с помощью эксплойтов с нулевым щелчком мыши, когда взаимодействие с пользователем не требуется.\n\n### AirDrop\n\nAirDrop — уникальный для iOS сетевой протокол, который позволяет пользователям iOS передавать файлы между устройствами iOS. До выпуска патчей от Apple на iOS 13.4 и более ранних версиях злоумышленники могли принудительно активировать интерфейс Apple Wireless Direct Link (AWDL), а затем использовать переполнение буфера для получения доступа к устройству и запускать его от имени пользователя root без взаимодействия с пользователем."
    },
    "T1660": {
      "name": "Фишинг",
      "description": "Злоумышленники могут отправлять пользователям вредоносный контент, чтобы получить доступ к их мобильным устройствам. Все формы фишинга представляют собой электронную социальную инженерию. Злоумышленники могут проводить как нецелевой фишинг, например, в ходе массовых спам-кампаний с вредоносным ПО, так и более целенаправленный фишинг, ориентированный на конкретного человека, компанию или отрасль, известный как «целевой фишинг». Фишинг часто включает методы социальной инженерии, такие как выдача себя за доверенный источник, а также методы уклонения, такие как удаление или манипулирование электронными письмами или метаданными/заголовками из скомпрометированных учетных записей, которые используются для отправки сообщений.\n\nМобильный фишинг может принимать различные формы. Например, злоумышленники могут отправлять электронные письма, содержащие вредоносные вложения или ссылки, обычно для того, чтобы доставить и затем выполнить вредоносный код на устройствах жертвы. Фишинг также может осуществляться через сторонние сервисы, например через социальные сети. Злоумышленники также могут выдавать себя за руководителей организаций, чтобы убедить жертв совершить какие-то действия от их имени. Например, злоумышленники часто используют методы социальной инженерии в текстовых сообщениях, чтобы обманом заставить жертв действовать быстро, что приводит к получению злоумышленниками учетных данных и другой информации.\n\nМобильные устройства являются особенно привлекательной целью для злоумышленников, проводящих фишинговые кампании.  Из-за их меньшего форм-фактора, чем у традиционных настольных компьютеров, пользователи могут не заметить незначительных различий между подлинными и фишинговыми веб-сайтами. Кроме того, мобильные устройства имеют дополнительные датчики и радиомодули, которые позволяют злоумышленникам предпринимать попытки фишинга по нескольким различным направлениям, например:\n\n- SMS-сообщения: злоумышленники могут отправлять SMS-сообщения (известные как «смишинг») со взломанных устройств потенциальным целям, чтобы убедить цель, например, установить вредоносное ПО, перейти на определенный веб-сайт или включить определенные небезопасные конфигурации на своем устройстве.\n- Коды быстрого ответа (QR). Злоумышленники могут использовать QR-коды (известные как «квишинг») для перенаправления пользователей на фишинговый веб-сайт. Например, злоумышленник может заменить законный общедоступный QR-код кодом, который ведет в другой пункт назначения, например на фишинговый веб-сайт. Вредоносный QR-код также может быть доставлен с помощью других средств, таких как SMS или электронная почта. В последнем случае злоумышленник может использовать вредоносный QR-код в электронном письме для перехода с настольного компьютера пользователя на мобильное устройство.\n- Телефонные звонки: злоумышленники могут звонить жертвам (известные как «вишинг»), чтобы убедить их выполнить какое-либо действие, например предоставить учетные данные для входа или перейти на вредоносный веб-сайт. Это также можно использовать в качестве метода выполнения первоначального доступа на мобильном устройстве, а затем перехода к компьютеру/другой сети, заставляя жертву выполнить действие на настольном компьютере."
    },
    "T1661": {
      "name": "Управление версиями приложения",
      "description": "Злоумышленник может обновить ранее безопасное приложение, чтобы добавить вредоносный код. Этого можно добиться, разместив изначально безопасное функциональное приложение в доверенном магазине приложений, таком как Google Play Store или Apple App Store. Это позволяет злоумышленнику создать доверенную базу пользователей, которая может предоставить разрешения приложению до внедрения вредоносного кода. Затем может быть выпущено обновление приложения, содержащее вредоносный код. (Цитата: android_app_breaking_bad)\n\nЭтот метод также может быть реализован путем компрометации учетной записи разработчика. Это позволит злоумышленнику воспользоваться существующей базой пользователей без необходимости создавать ее самостоятельно."
    },
    "T1662": {
      "name": "Уничтожение данных",
      "description": "Злоумышленники могут уничтожать данные и файлы на определенных устройствах или в больших количествах, чтобы нарушить доступность систем, служб и сетевых ресурсов. Уничтожение данных может привести к тому, что сохраненные данные будут невозвратимы с помощью методов судебной экспертизы путем перезаписи файлов или данных на локальных и удаленных дисках.\n\nЧтобы добиться уничтожения данных, злоумышленники могут использовать команду pm uninstall для удаления пакетов или команду rm для удаления определенных файлов. Например, злоумышленники могут сначала использовать `pm uninstall` для удаления несистемных приложений, а затем использовать `rm (-f) <файл(ы)>` для удаления определенных файлов, дополнительно скрывая вредоносную активность."
    },
    "T1663": {
      "name": "Программное обеспечение удаленного доступа",
      "description": "Злоумышленники могут использовать законное программное обеспечение удаленного доступа, такое как VNC, TeamViewer, AirDroid, AirMirror и т. д., чтобы установить интерактивный канал управления и контроля для целевых мобильных устройств.\n\nПриложения удаленного доступа могут быть установлены и использованы после компрометации в качестве альтернативного канала связи для резервного доступа или как способ установить интерактивный удаленный сеанс с целевым устройством. Они также могут использоваться как компонент вредоносного ПО для установления обратного соединения с системой или службой, контролируемой злоумышленником. Установка инструментов удаленного доступа также может включать сохранение."
    },
    "T1664": {
      "name": "Эксплуатация для первоначального доступа",
      "description": "Злоумышленники могут использовать уязвимости программного обеспечения для получения первоначального доступа к мобильному устройству.\n\nЭтого можно добиться разными способами. Уязвимости могут присутствовать в приложениях, службах, базовой операционной системе или самом ядре. Существует несколько известных эксплойтов для мобильных устройств, в том числе FORCEDENTRY, StageFright и BlueBorne. Кроме того, некоторые эксплойты можно использовать без какого-либо взаимодействия с пользователем (например, эксплойты с нулевым щелчком мыши, см. [Эксплуатация для выполнения клиента](https://attack.mitre.org/techniques/T1658)), что делает их особенно опасными. Поставщики мобильных операционных систем обычно очень быстро исправляют такие критические ошибки, обеспечивая лишь небольшой период времени, в течение которого ими можно воспользоваться."
    },
    "T1670": {
      "name": "Решение для виртуализации",
      "description": "Злоумышленники могут выполнять вредоносные операции, используя решения виртуализации, чтобы выйти из песочниц Android и избежать обнаружения. Android использует песочницы для разделения ресурсов и выполнения кода между приложениями и операционной системой. (Цитата: Android Application Sandbox). В Android доступно несколько решений виртуализации, таких как Android Virtualization Framework (AVF). (Цитата: Обзор Android AVF).\n\n\n\nС помощью решений виртуализации злоумышленники могут выполнять вредоносные операции без ведома пользователя. Например, злоумышленники могут имитировать функции законного банковского приложения в виртуальной среде благодаря решению виртуализации, в то время как вредоносный код перехватывает учетные данные."
    },
    "T1676": {
      "name": "Связанные устройства",
      "description": "Злоумышленники могут злоупотреблять функцией «связанных устройств» в приложениях для обмена сообщениями, таких как Signal и WhatsApp, чтобы зарегистрировать учетную запись пользователя на устройстве, контролируемом злоумышленником. Злоупотребляя функцией «связанных устройств», злоумышленники могут добиться и поддерживать постоянство учетной записи пользователя, могут собирать информацию, такую ​​как сообщения пользователя и список контактов, и могут отправлять будущие сообщения со связанного устройства.\n\nSignal — это приложение для обмена сообщениями, которое использует протокол Signal с открытым исходным кодом для шифрования сообщений и вызовов; Аналогичным образом, WhatsApp — это приложение для обмена сообщениями, которое имеет сквозное шифрование и другие меры безопасности для защиты сообщений и звонков. Оба приложения имеют функцию «связанных устройств», которая позволяет пользователям получать доступ к своим учетным записям Signal и/или WhatsApp с разных устройств, таких как рабочий стол Windows или Mac, iPad или планшет Android. (Цитата: WhatsApp_LinkDevice_NoDate) (Цитата: Signal_LinkedDevices_NoDate)\n\nЗлоумышленники могут использовать методы [фишинга](https://attack.mitre.org/techniques/T1660), чтобы обманом заставить пользователя отсканировать код быстрого ответа (QR), который используется для привязки учетной записи пользователя в Signal и/или WhatsApp к устройству, контролируемому злоумышленником. Например, злоумышленники могут замаскировать QR-коды под приглашения в группу, предупреждения безопасности или законные инструкции по сопряжению связанных устройств. \nПосле сканирования QR-кода в Signal пользователи могут нажать кнопку «Передать историю сообщений», чтобы синхронизировать связанные устройства, что может позволить злоумышленникам собрать дополнительную информацию о пользователе. После сканирования QR-кода в WhatsApp устройство пользователя автоматически отправит сквозную зашифрованную копию истории последних сообщений на устройство, контролируемое злоумышленником."
    }
  },
  "groups": {
    "G0007": {
      "name": "АПТ28",
      "description": "[APT28](https://attack.mitre.org/groups/G0007) — это группа угроз, которая приписана 85-му Главному разведывательному управлению (ГРУ) Генерального штаба России (ГЦСС), воинская часть 26165. (Цитата: АНБ/ФБР Дроворуб, август 2020 г.) (Цитата: Консультации по кибербезопасности ГРУ Brute Force Campaign, июль 2021) Эта группа действовала как минимум с 2004 года. (Цитата: Обвинительный акт ГРУ Министерства юстиции, июль 2018 г.) (Цитата: Обвинительный акт ГРУ Ars Technica, июль 2018 г.) (Цитата: Crowdstrike DNC, июнь 2016 г.) (Цитата: FireEye APT28) (Цитата: SecureWorks TG-4127) (Цитата: FireEye APT28 января 2017 г.) (Цитата: GRIZZLY STEPPE JAR) (Цитата: Sofacy DealersChoice) (Цитата: Palo Alto Sofacy 06-2018) (Цитата: Symantec APT28, октябрь 2018 г.) (Цитата: ESET Zebrocy, май 2019 г.)\n\n[APT28] (https://attack.mitre.org/groups/G0007), как сообщается, скомпрометировал кампанию Хиллари Клинтон, Национальный комитет Демократической партии и Комитет кампании Демократической партии Конгресса в 2016 году в попытке вмешаться в президентские выборы в США. (Цитата: Crowdstrike DNC, июнь 2016 года). [APT28](https://attack.mitre.org/groups/G0007) за кибероперации (включая операции закрытого доступа), проведенные в период с 2014 по 2018 год против Всемирного антидопингового агентства (ВАДА), Антидопингового агентства США, ядерного объекта США, Организации по запрещению химического оружия (ОЗХО), Шпицкой швейцарской химической лаборатории и других организаций. 2018) Некоторые из них были проведены при содействии подразделения ГРУ 74455, которое также называется [Команда песчаных червей] (https://attack.mitre.org/groups/G0034)."
    },
    "G0034": {
      "name": "Команда песчаных червей",
      "description": "[Команда песчаных червей] (https://attack.mitre.org/groups/G0034) — это деструктивная группа угроз, которую приписали Главному разведывательному управлению (ГРУ) Главного центра специальных технологий (ГЦСТ) России, военная часть 74455. (Цитата: Обвинительное заключение окружного суда США, подразделение ГРУ 74455, октябрь 2020 г.) (Цитата: UK NCSC Olympic Attacks, октябрь 2020 г.) Это группа активна как минимум с 2009 года. (Цитата: iSIGHT Sandworm 2014) (Цитата: CrowdStrike VOODOO BEAR) (Цитата: USDOJ Sandworm, февраль 2020 г.) (Цитата: NCSC Sandworm, февраль 2020 г.)\n\nВ октябре 2020 года США предъявили обвинения шести офицерам подразделения 74455 ГРУ, связанным с [Sandworm Team](https://attack.mitre.org/groups/G0034), в следующих кибероперациях: атаки на украинские электрические компании и правительственные организации в 2015 и 2016 годах, всемирная атака [NotPetya](https://attack.mitre.org/software/S0368) в 2017 году, нацеливание на президентскую кампанию во Франции в 2017 году, атаку [Олимпийского разрушителя](https://attack.mitre.org/software/S0365) на Зимние Олимпийские игры в 2018 году, операцию 2018 года против Организации по запрещению химического оружия и нападения на Грузию в 2018 и 2019 годах. (Цитата: Обвинительное заключение Окружного суда США, подразделение ГРУ 74455, октябрь) 2020 г.) (Цитата: Олимпийские атаки NCSC Великобритании, октябрь 2020 г.) Некоторые из них были проведены при содействии подразделения ГРУ 26165, которое также называется [APT28] (https://attack.mitre.org/groups/G0007). (Цитата: Обвинительное заключение Окружного суда США, октябрь 2018 г.)"
    },
    "G0056": {
      "name": "ПРОМЕТИЙ",
      "description": "[ПРОМЕТИУМ](https://attack.mitre.org/groups/G0056) — это группа, занимающаяся шпионажем и действующая как минимум с 2012 года. Группа проводит операции по всему миру, уделяя особое внимание турецким объектам. [PROMETHIUM](https://attack.mitre.org/groups/G0056) продемонстрировал сходство с другой группой активности под названием [NEODYMIUM](https://attack.mitre.org/groups/G0055) из-за совпадения характеристик жертвы и кампании. (Цитата: Microsoft NEODYMIUM, декабрь 2016 г.) (Цитата: Microsoft SIR Vol 21) (Цитата: Talos Promethium, июнь) 2020)"
    },
    "G0069": {
      "name": "МутнаяВода",
      "description": "[MuddyWater](https://attack.mitre.org/groups/G0069) — это группа кибершпионажа, которая, по оценкам, является подчиненным элементом Министерства разведки и безопасности Ирана (MOIS). (Цитата: CYBERCOM иранский Intel Cyber, январь 2022 г.) ряд государственных и частных организаций в разных секторах, включая телекоммуникации, местные органы власти, оборону, а также нефтегазовые организации на Ближнем Востоке, в Азии, Африке, Европе и Северной Америке. Июнь 2019 г.) (Цитата: Reaqta MuddyWater, ноябрь 2017 г.) (Цитата: DHS CISA AA22-055A MuddyWater, февраль 2022 г.) (Цитата: Talos MuddyWater, январь 2022 г.)"
    },
    "G0070": {
      "name": "Темный каракал",
      "description": "[Dark Caracal](https://attack.mitre.org/groups/G0070) — это группа угроз, приписанная Генеральному управлению общей безопасности Ливана (GDGS) и действующая как минимум с 2012 года. (Цитата: Lookout Dark Caracal, январь 2018 г.)"
    },
    "G0096": {
      "name": "АПТ41",
      "description": "[APT41](https://attack.mitre.org/groups/G0096) — это группа угроз, которую исследователи оценили как спонсируемую китайским государством шпионскую группу, которая также проводит финансово мотивированные операции. Активный как минимум с 2012 года [APT41](https://attack.mitre.org/groups/G0096) был замечен в атаках на различные отрасли, включая, помимо прочего, здравоохранение, телекоммуникации, технологии, финансы, образование, розничную торговлю и индустрию видеоигр в 14 странах. (Цитата: apt41_mandiant). Примечательное поведение включает использование широкого спектра вредоносных программ и инструментов для выполнения задач миссии. [APT41](https://attack.mitre.org/groups/G0096) частично совпадает с публичными отчетами о группах, включая BARIUM и [Winnti Group](https://attack.mitre.org/groups/G0044). (Цитата: FireEye APT41, август 2019 г.) (Цитата: Group IB APT, 41 июня 2021 г.)"
    },
    "G0097": {
      "name": "Прыгающий гольф",
      "description": "[Bouncing Golf](https://attack.mitre.org/groups/G0097) — это кампания кибершпионажа, нацеленная на страны Ближнего Востока. (Цитата: Trend Micro Bouncing Golf 2019)"
    },
    "G0112": {
      "name": "Сдвиг ветра",
      "description": "[Windshift](https://attack.mitre.org/groups/G0112) — это группа угроз, действующая по крайней мере с 2017 года и нацеленная на конкретных лиц для слежки в правительственных ведомствах и критической инфраструктуре на Ближнем Востоке. (Цитата: SANS Windshift, август 2018 г.) (Цитата: Objective-см. Windtail1, декабрь 2018 г.) (Цитирование: Objective-см. Windtail2 янв. 2019)"
    },
    "G0142": {
      "name": "Конфуций",
      "description": "[Конфуций](https://attack.mitre.org/groups/G0142) — это группа кибершпионажа, которая, по крайней мере, с 2013 года преследует в первую очередь военных, известных личностей, бизнесменов и правительственные организации в Южной Азии. Исследователи безопасности отметили сходство между [Конфуцием](https://attack.mitre.org/groups/G0142) и [Пэчворк] (https://attack.mitre.org/groups/G0040), особенно в их соответствующем специальном вредоносном коде и целях. (Цитата: TrendMicro Confucius APT, февраль 2018 г.) (Цитата: TrendMicro Confucius APT, август 2021 г.) (Цитата: Uptycs Confucius APT, январь 2021 г.)"
    },
    "G1002": {
      "name": "ГОРЬКИЙ",
      "description": "[BITTER](https://attack.mitre.org/groups/G1002) — предполагаемая группа угроз кибершпионажа в Южной Азии, действующая как минимум с 2013 года. [BITTER](https://attack.mitre.org/groups/G1002) нацелена на правительственные, энергетические и инженерные организации в Пакистане, Китае, Бангладеш и Саудовской Аравии. (Цитата: Cisco Talos Bitter Bangladesh, май 2022 г.) (Цитата: Forcepoint BITTER Пакистан, октябрь 2016 г.)"
    },
    "G1004": {
      "name": "ЛАПСУС$",
      "description": "[LAPSUS$](https://attack.mitre.org/groups/G1004) — это группа киберпреступников, действующая как минимум с середины 2021 года. [LAPSUS$](https://attack.mitre.org/groups/G1004) специализируется на крупномасштабных операциях социальной инженерии и вымогательства, включая разрушительные атаки без использования программ-вымогателей. Группа нацелена на организации по всему миру, в том числе в правительстве, производстве, высшем образовании, энергетике, здравоохранении, технологиях, телекоммуникациях и средствах массовой информации."
    },
    "G1006": {
      "name": "Земля Луска",
      "description": "[Earth Lusca](https://attack.mitre.org/groups/G1006) — предположительно базирующаяся в Китае группа кибершпионажа, действующая как минимум с апреля 2019 года. [Earth Lusca](https://attack.mitre.org/groups/G1006) преследует организации в Австралии, Китае, Гонконге, Монголии, Непале, на Филиппинах, Тайване, Таиланде, Вьетнаме, Объединенных Арабских Эмиратах, Нигерии, Германия, Франция и США. В число целей входили правительственные учреждения, средства массовой информации, компании, занимающиеся азартными играми, образовательные учреждения, исследовательские организации, занимающиеся исследованием COVID-19, телекоммуникационные компании, религиозные движения, запрещенные в Китае, и платформы для торговли криптовалютой; исследователи безопасности считают, что некоторые операции [Earth Lusca](https://attack.mitre.org/groups/G1006) могут быть финансово мотивированы. (Цитата: TrendMicro EarthLusca 2022)\n\n[Earth Lusca](https://attack.mitre.org/groups/G1006) использовало вредоносное ПО, обычно используемое другими китайскими группами угроз, включая [APT41](https://attack.mitre.org/groups/G0096) и кластер [Winnti Group](https://attack.mitre.org/groups/G0044), однако исследователи безопасности оценивают [Earth Lusca](https://attack.mitre.org/groups/G1006) — методы и инфраструктура разделены. (Цитата: TrendMicro EarthLusca, 2022)."
    },
    "G1015": {
      "name": "Рассеянный паук",
      "description": "[Scattered Spider] (https://attack.mitre.org/groups/G1015) — это англоязычная группа киберпреступников, действующая как минимум с 2022 года. (Цитата: CrowdStrike Scattered Spider Profile) (Цитата: MSTIC Octo Tempest Operations, октябрь 2023 г.) Группа первоначально нацеливалась на поставщиков услуг управления взаимоотношениями с клиентами (CRM), фирмы, занимающиеся аутсорсингом бизнес-процессов (BPO), а также телекоммуникационные и технологические компании. а затем в 2023 году расширится на игровой, гостиничный, розничный, поставщик управляемых услуг (MSP), производственный и финансовый секторы. (Цитата: MSTIC Octo Tempest Operations, октябрь 2023 г.)\n[Scattered Spider](https://attack.mitre.org/groups/G1015) в значительной степени полагается на социальную инженерию, в том числе выдает себя за сотрудников ИТ-отдела и службы поддержки, чтобы получить первоначальный доступ, обойти многофакторную аутентификацию (MFA) и поставить под угрозу корпоративные сети. Группа адаптировала свои инструменты для обхода защиты от обнаружения и реагирования на конечных точках (EDR) и использовала программы-вымогатели для финансовой выгоды. (Цитата: Информационный бюллетень CISA Scattered Spider, ноябрь 2023 г.) (Цитата: CrowdStrike Scattered Spider BYOVD, январь 2023 г.) (Цитата: Кампания Crowdstrike TELCO BPO, декабрь 2022 г.)\n[Scattered Spider] (https://attack.mitre.org/groups/G1015) расширился до гибридных облачных сред и сред идентификации, используя олицетворение службы поддержки и обход MFA для получения доступа администратора в Okta, AWS и Office 365. (Цитата: Mandiant UNC3944, май 2025 г.)"
    },
    "G1019": {
      "name": "УсатыйВышибала",
      "description": "[MoustachedBouncer](https://attack.mitre.org/groups/G1019) — это группа кибершпионажа, действующая как минимум с 2014 года и нацеленная на иностранные посольства в Беларуси. (Цитата: MoustachedBouncer ESET, август 2023 г.)"
    },
    "G1028": {
      "name": "АПТ-С-23",
      "description": "[APT-C-23](https://attack.mitre.org/groups/G1028) — это группа угроз, действующая как минимум с 2014 года. (Цитата: symantec_mantis) [APT-C-23](https://attack.mitre.org/groups/G1028) в первую очередь сосредоточила свои операции на Ближнем Востоке, включая военные объекты Израиля. [APT-C-23](https://attack.mitre.org/groups/G1028) с 2017 года разрабатывает мобильное шпионское ПО, нацеленное на устройства Android и iOS. (Цитата: welivesecurity_apt-c-23)"
    },
    "G1029": {
      "name": "UNC788",
      "description": "[UNC788](https://attack.mitre.org/groups/G1029) — это группа хакеров из Ирана, которая нацелена на жителей Ближнего Востока. (Цитата: Отчет о мета-адверсариальных угрозах, 2022 г.)"
    },
    "G1033": {
      "name": "Звездная метель",
      "description": "[Star Blizzard](https://attack.mitre.org/groups/G1033) — это группа кибершпионажа и влияния, созданная в России и действующая как минимум с 2019 года. Кампании [Star Blizzard](https://attack.mitre.org/groups/G1033) тесно связаны с российскими государственными интересами и включают в себя постоянный фишинг и кражу учетных данных против академических, оборонных, правительственных, неправительственных организаций и мыслительных организаций. танковые организации в странах НАТО, особенно в США и Великобритании. (Цитата: Microsoft Star Blizzard, август 2022 г.) (Цитата: CISA Star Blizzard Advisory, декабрь 2023 г.) (Цитата: StarBlizzard) (Цитата: Google TAG COLDRIVER, январь 2024 г.)"
    }
  },
  "software": {
    "S0182": {
      "name": "Финфишер",
      "description": "[FinFisher](https://attack.mitre.org/software/S0182) — коммерческое шпионское ПО государственного уровня, которое, как сообщается, продается исключительно правительственным учреждениям для использования в целенаправленных и законных уголовных расследованиях. Он сильно запутан и использует множество методов антианализа. У него есть и другие варианты, включая [Wingbird](https://attack.mitre.org/software/S0176). (Цитирование: FinFisher Citation) (Цитирование: Microsoft SIR Vol 21) (Цитирование: FireEye FinSpy, сентябрь 2017 г.) (Цитирование: Securelist BlackOasis, октябрь 2017 г.) (Цитирование: Microsoft FinFisher, март 2018 г.)"
    },
    "S0285": {
      "name": "ОлдБот",
      "description": "[OldBoot](https://attack.mitre.org/software/S0285) — семейство вредоносных программ для Android. (Цитата: HackerNews-OldBoot)"
    },
    "S0286": {
      "name": "ОБАД",
      "description": "OBAD — это семейство вредоносных программ для Android. (Цитата: TrendMicro-Obad)"
    },
    "S0287": {
      "name": "ЗергХелпер",
      "description": "[ZergHelper](https://attack.mitre.org/software/S0287) — это потенциально опасное ПО для iOS, уникальное из-за явного уклонения от процесса проверки Apple App Store. В приложении не обнаружено вредоносных функций, но оно представляет угрозу безопасности. (Цитата: Сяо-ЗергХелпер)"
    },
    "S0288": {
      "name": "Кейрейдер",
      "description": "[KeyRaider](https://attack.mitre.org/software/S0288) — вредоносное ПО, которое крадет учетные данные учетной записи Apple и другие данные с взломанных устройств iOS. Он также имеет функцию вымогателя. (Цитата: Сяо-KeyRaider)"
    },
    "S0289": {
      "name": "Пегас для iOS",
      "description": "[Pegasus для iOS](https://attack.mitre.org/software/S0289) — это версия вредоносного ПО для iOS, которая, как сообщается, была связана с группой NSO. Его рекламировали и продавали для особо ценных жертв. (Цитата: Lookout-Pegasus) (Цитата: PegasusCitizenLab) Версия Android отслеживается отдельно в разделе [Pegasus for Android] (https://attack.mitre.org/software/S0316)."
    },
    "S0290": {
      "name": "Гулиган",
      "description": "[Gooligan](https://attack.mitre.org/software/S0290) — это семейство вредоносных программ, которые запускают эксплойты повышения привилегий на устройствах Android, а затем используют свои повышенные привилегии для кражи токенов аутентификации, которые можно использовать для доступа к данным из многих приложений Google. [Gooligan](https://attack.mitre.org/software/S0290) описан как часть семейства вредоносных программ Ghost Push для Android. (Цитата: Цитата Gooligan) (Цитата: Ludwig-GhostPush) (Цитата: Lookout-Gooligan)"
    },
    "S0291": {
      "name": "PJApps",
      "description": "[PJApps](https://attack.mitre.org/software/S0291) — семейство вредоносных программ для Android. (Цитата: Lookout-EnterpriseApps)"
    },
    "S0292": {
      "name": "АндроРАТ",
      "description": "[AndroRAT](https://attack.mitre.org/software/S0292) — это инструмент удаленного доступа с открытым исходным кодом для устройств Android. [AndroRAT] (https://attack.mitre.org/software/S0292) способен собирать данные, такие как местоположение устройства, журналы вызовов и т. д., а также выполнять такие действия, как отправка SMS-сообщений и фотографирование. (Цитата: Lookout-EnterpriseApps) (Цитата: github_androrat) (Цитата: Forcepoint BITTER Пакистан, октябрь 2016 г.) Первоначально он доступен через Репозиторий `The404Hacking` на Github. (Цитата: github_androrat)"
    },
    "S0293": {
      "name": "BrainTest",
      "description": "[BrainTest](https://attack.mitre.org/software/S0293) — семейство вредоносных программ для Android. (Цитата: CheckPoint-BrainTest) (Цитата: Lookout-BrainTest)"
    },
    "S0294": {
      "name": "ShiftyBug",
      "description": "[ShiftyBug](https://attack.mitre.org/software/S0294) — это семейство вредоносных программ рекламного ПО с автоматическим рутированием для Android. Это семейство очень похоже на другие семейства Android, известные как Шедун, Шуанет, Кемоге, хотя не считается, что все семейства были созданы одной и той же группой. (Цитата: Lookout-Adware)"
    },
    "S0295": {
      "name": "РКСАндроид",
      "description": "[RCSAndroid](https://attack.mitre.org/software/S0295) — вредоносное ПО для Android. (Цитата: TrendMicro-RCSAndroid)"
    },
    "S0297": {
      "name": "XcodeGhost",
      "description": "[XcodeGhost](https://attack.mitre.org/software/S0297) — вредоносное ПО для iOS, которое в 2015 году заразило как минимум 39 приложений для iOS и потенциально затронуло миллионы пользователей. (Цитата: PaloAlto-XcodeGhost1) (Цитата: PaloAlto-XcodeGhost)"
    },
    "S0298": {
      "name": "Иксбот",
      "description": "[Xbot](https://attack.mitre.org/software/S0298) — это семейство вредоносных программ для Android, которые были обнаружены в 2016 году и нацелены главным образом на пользователей Android в России и Австралии. (Цитата: PaloAlto-Xbot)"
    },
    "S0299": {
      "name": "Несовместимо",
      "description": "[NotCompatible](https://attack.mitre.org/software/S0299) — это семейство вредоносных программ для Android, которые использовались как минимум с 2014 по 2016 год. У него есть несколько вариантов, которые со временем стали более изощренными. (Цитата: Lookout-NotCompatible)"
    },
    "S0300": {
      "name": "Дресс-код",
      "description": "[DressCode](https://attack.mitre.org/software/S0300) — семейство вредоносных программ для Android. (Цитата: TrendMicro-DressCode)"
    },
    "S0301": {
      "name": "Дендроид",
      "description": "[Dendroid](https://attack.mitre.org/software/S0301) — это инструмент удаленного доступа Android (RAT), ориентированный в первую очередь на западные страны. RAT можно было купить за 300 долларов, и он поставлялся в комплекте с утилитой для внедрения RAT в законные приложения. (Цитата: Lookout-Dendroid)"
    },
    "S0302": {
      "name": "Твитур",
      "description": "[Twitoor](https://attack.mitre.org/software/S0302) — это приложение-дроппер, способное получать команды из социальных сетей. (Цитата: ESET-Twitoor)"
    },
    "S0303": {
      "name": "МазарБОТ",
      "description": "[MazarBOT](https://attack.mitre.org/software/S0303) — вредоносное ПО для Android, которое распространялось через SMS в Дании в 2016 году. (Цитата: Tripwire-MazarBOT)"
    },
    "S0304": {
      "name": "Android/Чули.А",
      "description": "[Android/Chuli.A](https://attack.mitre.org/software/S0304) — это вредоносное ПО для Android, которое было доставлено группам активистов через фишинговое электронное письмо с вложением. (Цитата: Касперский-WUC)"
    },
    "S0305": {
      "name": "SpyNote КРЫСА",
      "description": "[SpyNote RAT](https://attack.mitre.org/software/S0305) (троян удаленного доступа) — семейство вредоносных приложений для Android. Инструмент сборки [SpyNote RAT](https://attack.mitre.org/software/S0305) можно использовать для разработки вредоносных приложений с функциональностью вредоносного ПО. (Цитата: Zscaler-SpyNote)"
    },
    "S0306": {
      "name": "Троян-SMS.AndroidOS.FakeInst.a",
      "description": "[Trojan-SMS.AndroidOS.FakeInst.a](https://attack.mitre.org/software/S0306) — вредоносное ПО для Android. (Цитата: Kaspersky-MobileMalware)"
    },
    "S0307": {
      "name": "Троян-SMS.AndroidOS.Agent.ao",
      "description": "[Trojan-SMS.AndroidOS.Agent.ao](https://attack.mitre.org/software/S0307) — вредоносное ПО для Android. (Цитата: Kaspersky-MobileMalware)"
    },
    "S0308": {
      "name": "Троян-SMS.AndroidOS.OpFake.a",
      "description": "[Trojan-SMS.AndroidOS.OpFake.a](https://attack.mitre.org/software/S0308) — вредоносное ПО для Android. (Цитата: Kaspersky-MobileMalware)"
    },
    "S0309": {
      "name": "Рекламные объявления",
      "description": "[Adups](https://attack.mitre.org/software/S0309) — это программное обеспечение, которое было предварительно установлено на устройства Android, в том числе производства BLU Products. Сообщается, что программное обеспечение было разработано, чтобы помочь китайскому производителю телефонов отслеживать поведение пользователей, передавая конфиденциальные данные на китайский сервер. (Цитата: NYTimes-BackDoor) (Цитата: BankInfoSecurity-BackDoor)"
    },
    "S0310": {
      "name": "ANDROIDOS_ANSERVER.A",
      "description": "[ANDROIDOS_ANSERVER.A](https://attack.mitre.org/software/S0310) — это вредоносное ПО для Android, уникальное, поскольку оно использует зашифрованное содержимое сайта блога для управления и контроля. (Цитата: TrendMicro-Anserver)"
    },
    "S0311": {
      "name": "YiSpecter",
      "description": "[YiSpecter](https://attack.mitre.org/software/S0311) — это семейство вредоносных программ для iOS и Android, впервые обнаруженных в ноябре 2014 года и нацеленных на пользователей в материковом Китае и на Тайване. [YiSpecter](https://attack.mitre.org/software/S0311) злоупотребляет частными API в iOS для заражения как взломанных, так и не взломанных устройств. (Цитата: paloalto_yispecter_1015)"
    },
    "S0312": {
      "name": "ПроволокаLurker",
      "description": "[WireLurker](https://attack.mitre.org/software/S0312) — это семейство вредоносных программ для macOS, нацеленных на устройства iOS, подключенные через USB. (Цитата: PaloAlto-WireLurker)"
    },
    "S0313": {
      "name": "РуММС",
      "description": "[RuMMS](https://attack.mitre.org/software/S0313) — семейство вредоносных программ для Android. (Цитата: FireEye-РуММС)"
    },
    "S0314": {
      "name": "X-Агент для Android",
      "description": "[X-Agent для Android](https://attack.mitre.org/software/S0314) — вредоносное ПО для Android, которое было помещено в переупакованную версию украинского приложения для наведения артиллерии. Сообщается, что вредоносное ПО получило общие данные о местонахождении устройства-жертвы и, следовательно, могло указать на потенциальное местонахождение украинской артиллерии. (Цитата: CrowdStrike-Android) Отслеживается ли он отдельно от [CHOPSTICK](https://attack.mitre.org/software/S0023)."
    },
    "S0315": {
      "name": "Двойная игрушка",
      "description": "[DualToy](https://attack.mitre.org/software/S0315) — вредоносное ПО для Windows, которое устанавливает вредоносные приложения на устройства Android и iOS, подключенные через USB. (Цитата: PaloAlto-DualToy)"
    },
    "S0316": {
      "name": "Пегас для Android",
      "description": "[Pegasus для Android](https://attack.mitre.org/software/S0316) — это версия вредоносного ПО для Android, которая, как сообщается, была связана с группой NSO. (Цитата: Lookout-PegasusAndroid) (Цитата: Google-Chrysaor) Версия iOS отслеживается отдельно в разделе [Pegasus для iOS] (https://attack.mitre.org/software/S0289)."
    },
    "S0318": {
      "name": "XLoader для Android",
      "description": "[XLoader for Android](https://attack.mitre.org/software/S0318) — это вредоносное приложение для Android, которое впервые было обнаружено в Японии, Корее, Китае, Тайване и Гонконге в 2018 году. Совсем недавно оно было замечено нацеленным на южнокорейских пользователей как порнографическое приложение. (Цитирование: TrendMicro-XLoader-FakeSpy) (Цитирование: TrendMicro-XLoader) Оно отслеживается отдельно от [XLoader для iOS](https://attack.mitre.org/software/S0490)."
    },
    "S0319": {
      "name": "Оллвиннер",
      "description": "[Allwinner](https://attack.mitre.org/software/S0319) — компания, поставляющая процессоры, используемые в планшетах Android и других устройствах. Ядро Linux, распространяемое [Allwinner](https://attack.mitre.org/software/S0319) для использования на этих устройствах, как сообщается, содержало бэкдор. (Цитата: HackerNews-Allwinner)"
    },
    "S0320": {
      "name": "ДроидДжек",
      "description": "[DroidJack](https://attack.mitre.org/software/S0320) — это инструмент удаленного доступа к Android, который выдавал себя за законные приложения, включая игры Super Mario Run и Pokemon GO. (Цитата: Zscaler-SuperMarioRun) (Цитата: Proofpoint-Droidjack)"
    },
    "S0321": {
      "name": "КолибриКит",
      "description": "[HummingWhale](https://attack.mitre.org/software/S0321) — это семейство вредоносных программ для Android, которые занимаются мошенничеством с рекламой. (Цитата: ArsTechnica-HummingWhale)"
    },
    "S0322": {
      "name": "ГудениеПлохо",
      "description": "[HummingBad](https://attack.mitre.org/software/S0322) — это семейство вредоносных программ для Android, которые генерируют мошеннические доходы от рекламы и позволяют получать root-доступ на старых уязвимых версиях Android. (Цитата: ArsTechnica-HummingBad)"
    },
    "S0323": {
      "name": "Зарядное устройство",
      "description": "[Charger](https://attack.mitre.org/software/S0323) — вредоносное ПО для Android, которое крадет контакты и SMS-сообщения с устройства пользователя. Он также может заблокировать устройство и потребовать выкуп, если получит права администратора. (Цитата: CheckPoint-Charger)"
    },
    "S0324": {
      "name": "ШпионДилер",
      "description": "[SpyDealer](https://attack.mitre.org/software/S0324) — это вредоносное ПО для Android, которое похищает конфиденциальные данные с устройств Android. (Цитата: PaloAlto-SpyDealer)"
    },
    "S0325": {
      "name": "Джуди",
      "description": "[Judy](https://attack.mitre.org/software/S0325) — это рекламное ПО с автоматическим кликом, которое распространялось через несколько приложений в Google Play Store. (Цитата: CheckPoint-Джуди)"
    },
    "S0326": {
      "name": "RedDrop",
      "description": "[RedDrop](https://attack.mitre.org/software/S0326) — это семейство вредоносных программ для Android, которые крадут конфиденциальные данные с устройств. (Цитата: Wandera-RedDrop)"
    },
    "S0327": {
      "name": "Скайгофри",
      "description": "[Skygofree](https://attack.mitre.org/software/S0327) — шпионское ПО для Android, которое, предположительно, было разработано в 2014 году и использовалось как минимум до 2017 года. (Цитата: Kaspersky-Skygofree)"
    },
    "S0328": {
      "name": "Стелс Манго",
      "description": "[Stealth Mango](https://attack.mitre.org/software/S0328) — это вредоносное ПО для Android, которое, как сообщается, использовалось для успешного взлома мобильных устройств правительственных чиновников, военнослужащих, медицинских работников и гражданских лиц. Предполагается, что вредоносное ПО для iOS, известное как [Tangelo](https://attack.mitre.org/software/S0329), принадлежит тому же разработчику. (Цитата: Lookout-StealthMango)"
    },
    "S0329": {
      "name": "Танжело",
      "description": "[Tangelo](https://attack.mitre.org/software/S0329) — это вредоносное ПО для iOS, предположительно созданное теми же разработчиками, что и вредоносное ПО для Android [Stealth Mango](https://attack.mitre.org/software/S0328). Это не мобильное приложение, а пакет Debian, который может работать только на взломанных устройствах iOS. (Цитата: Lookout-StealthMango)"
    },
    "S0399": {
      "name": "Паллада",
      "description": "[Pallas](https://attack.mitre.org/software/S0399) — это мобильное ПО для наблюдения, специально разработанное [Dark Caracal](https://attack.mitre.org/groups/G0070). (Цитата: Lookout Dark Caracal, январь 2018 г.)"
    },
    "S0403": {
      "name": "Рилток",
      "description": "[Riltok](https://attack.mitre.org/software/S0403) — это банковское вредоносное ПО, которое использует фишинговые всплывающие окна для сбора учетных данных пользователя. (Цитата: Kaspersky Riltok, июнь 2019 г.)"
    },
    "S0405": {
      "name": "Исход",
      "description": "[Exodus](https://attack.mitre.org/software/S0405) — это шпионское ПО для Android, которое развертывается в два отдельных этапа: Exodus One (дроппер) и Exodus Two (полезная нагрузка). (Цитата: SWB Exodus, март 2019 г.)"
    },
    "S0406": {
      "name": "Густаф",
      "description": "[Gustuff](https://attack.mitre.org/software/S0406) — мобильное вредоносное ПО, предназначенное для кражи банковских данных пользователей и учетных данных виртуальной валюты. (Цитата: Talos Gustuff, апрель 2019 г.)"
    },
    "S0407": {
      "name": "Монокль",
      "description": "[Monokle](https://attack.mitre.org/software/S0407) — это специализированное сложное мобильное ПО для наблюдения. Он разработан для Android, но есть некоторые артефакты кода, которые позволяют предположить, что версия для iOS может находиться в разработке. (Цитата: Lookout-Monokle)"
    },
    "S0408": {
      "name": "FlexiSpy",
      "description": "[FlexiSpy](https://attack.mitre.org/software/S0408) — это сложное программное обеспечение для наблюдения для iOS и Android. Общедоступный комплексный анализ был найден только для версии Android. (Цитата: FortiGuard-FlexiSpy) (Цитата: CyberMerchants-FlexiSpy)\n\n[FlexiSpy](https://attack.mitre.org/software/S0408) позиционирует себя как приложение для родительского контроля и мониторинга сотрудников. (Цитата: FlexiSpy-Website)"
    },
    "S0411": {
      "name": "Ротекси",
      "description": "[Rotexy](https://attack.mitre.org/software/S0411) — банковское вредоносное ПО для Android, которое развивалось на протяжении нескольких лет. Первоначально это был троян-шпион SMS, впервые обнаруженный в октябре 2014 года, но с тех пор он стал содержать больше функций, включая функции вымогателей. (Цитата: securelist rotexy 2018)"
    },
    "S0418": {
      "name": "вице-ликер",
      "description": "[ViceLeaker](https://attack.mitre.org/software/S0418) — это платформа шпионского ПО, способная осуществлять обширные операции по слежке и краже данных, в первую очередь нацеленные на устройства, принадлежащие гражданам Израиля. (Цитата: SecureList – ViceLeaker 2019) (Цитата: Bitdefender – Triout 2018)"
    },
    "S0419": {
      "name": "СимБад",
      "description": "[SimBad](https://attack.mitre.org/software/S0419) — разновидность рекламного ПО в магазине Google Play, распространявшаяся через комплект разработки программного обеспечения RXDroider. Название «SimBad» произошло из-за того, что большинство зараженных приложений представляли собой игры-симуляторы. Рекламное ПО контролировалось с помощью экземпляра платформы с открытым исходным кодом Parse Server. (Цитата: CheckPoint SimBad 2019)."
    },
    "S0420": {
      "name": "Двмап",
      "description": "[Dvmap](https://attack.mitre.org/software/S0420) рутирует вредоносное ПО, которое внедряет вредоносный код в библиотеки времени выполнения системы. Считается, что это первая вредоносная программа, выполняющая внедрение кода такого типа. (Цитата: SecureList DVMap, июнь 2017 г.)"
    },
    "S0421": {
      "name": "ГольфШпион",
      "description": "[GolfSpy](https://attack.mitre.org/software/S0421) — шпионское ПО для Android, развернутое группой [Bouncing Golf](https://attack.mitre.org/groups/G0097). (Цитата: Trend Micro Bouncing Golf 2019)"
    },
    "S0422": {
      "name": "Анубис",
      "description": "[Anubis](https://attack.mitre.org/software/S0422) — вредоносное ПО для Android, которое изначально использовалось для кибершпионажа, а затем было переоборудовано в банковский троян. (Цитата: Cofense Anubis)"
    },
    "S0423": {
      "name": "Джинп",
      "description": "[Ginp](https://attack.mitre.org/software/S0423) — банковский троян для Android, который использовался для атак на испанские банки. Часть кода была взята непосредственно из [Anubis](https://attack.mitre.org/software/S0422).(Цитата: ThreatFabric Ginp)"
    },
    "S0424": {
      "name": "Триада",
      "description": "[Triada](https://attack.mitre.org/software/S0424) впервые была зарегистрирована в 2016 году как вредоносное ПО второй стадии. Более поздние версии в 2019 году появились с новыми технологиями и в качестве первоначального загрузчика других троянских приложений. (Цитата: Kaspersky Triada, март 2016 г.)"
    },
    "S0425": {
      "name": "Обновления Короны",
      "description": "[Corona Updates](https://attack.mitre.org/software/S0425) — это шпионское ПО для Android, воспользовавшееся пандемией Коронавируса. Кампания по распространению этого шпионского ПО отслеживается как Project Spy. Было обнаружено, что в магазине Google Play Store размещено несколько вариантов этого шпионского ПО. (Цитата: TrendMicro Coronavirus Updates)"
    },
    "S0426": {
      "name": "Конципит1248",
      "description": "[Concipit1248](https://attack.mitre.org/software/S0426) — это шпионское ПО для iOS, которое было обнаружено под тем же именем, что и разработчик шпионского ПО для Android [Corona Updates](https://attack.mitre.org/software/S0425). Дальнейшее расследование показало, что эти две части программного обеспечения содержали один и тот же URL-адрес C2 и схожие функции. (Цитата: TrendMicro Coronavirus Updates)."
    },
    "S0427": {
      "name": "ТрюкМо",
      "description": "[TrickMo](https://attack.mitre.org/software/S0427) — мобильный банковский троян для обхода 2FA, скорее всего, распространяемый [TrickBot](https://attack.mitre.org/software/S0266). [TrickMo](https://attack.mitre.org/software/S0427) в первую очередь нацелен на пользователей, находящихся в Германии. (Цитата: SecurityIntelligence TrickMo)\n\n[TrickMo](https://attack.mitre.org/software/S0427) предназначен для кражи номеров авторизации транзакций (TAN), которые обычно используются в качестве одноразовых паролей. (Цитата: SecurityIntelligence TrickMo)"
    },
    "S0432": {
      "name": "Хлеб",
      "description": "[Bread](https://attack.mitre.org/software/S0432) представляло собой крупномасштабное семейство вредоносных программ для мошенничества с счетами, известное тем, что использовало множество различных методов маскировки и запутывания в попытке постоянно уклоняться от обнаружения вредоносного ПО в Google Play Store. 1700 уникальных приложений Bread были обнаружены и удалены из Google Play Store до того, как их загрузили пользователи. (Цитата: Google Bread)"
    },
    "S0440": {
      "name": "Агент Смит",
      "description": "[Агент Смит](https://attack.mitre.org/software/S0440) — это мобильное вредоносное ПО, которое приносит финансовую выгоду за счет замены законных приложений на устройствах вредоносными версиями, содержащими мошенническую рекламу. По состоянию на июль 2019 года [агент Смит](https://attack.mitre.org/software/S0440) заразил около 25 миллионов устройств, в основном нацеленных на Индию, хотя последствия наблюдались и в других азиатских странах, а также в Саудовской Аравии, Великобритании и США. (Цитата: агент CheckPoint Смит)"
    },
    "S0463": {
      "name": "БЕССОННИЦА",
      "description": "[INSOMNIA](https://attack.mitre.org/software/S0463) — шпионское ПО, которое использовалось группой Evil Eye. (Цитата: Volexity Insomnia)"
    },
    "S0478": {
      "name": "EventBot",
      "description": "[EventBot](https://attack.mitre.org/software/S0478) — это банковский троян для Android и похититель информации, который злоупотребляет службой специальных возможностей Android для кражи данных из различных приложений. (Цитата: Cybereason EventBot) [EventBot](https://attack.mitre.org/software/S0478) был разработан для атак на более чем 200 различных банковских и финансовых приложений, большинство из которых представляют собой европейские банковские и криптовалютные биржи. приложения.(Цитата: Cybereason EventBot)"
    },
    "S0479": {
      "name": "ИД ЗАЩИТНИКА",
      "description": "[DEFENSOR ID](https://attack.mitre.org/software/S0479) — это банковский троян, способный очищать банковский счет или криптовалютный кошелек жертвы, а также захватывать электронную почту или учетные записи в социальных сетях. [DEFENSOR ID](https://attack.mitre.org/software/S0479) выполняет большую часть своих вредоносных функций, злоупотребляя службой специальных возможностей Android. (Цитата: ESET DEFENSOR ID)"
    },
    "S0480": {
      "name": "Цербер",
      "description": "[Cerberus](https://attack.mitre.org/software/S0480) — банковский троян, использование которого можно арендовать на подпольных форумах и торговых площадках. По утверждению авторов [Cerberus](https://attack.mitre.org/software/S0480), до того, как он стал доступен для аренды, он использовался в частных операциях в течение двух лет. (Цитата: Threat Fabric Cerberus)"
    },
    "S0485": {
      "name": "Мандрагора",
      "description": "[Mandrake](https://attack.mitre.org/software/S0485) — это сложная шпионская платформа Android, действующая как минимум с 2016 года. [Mandrake](https://attack.mitre.org/software/S0485) очень активно поддерживается, имеет сложные функции и атаки, выполняемые с хирургической точностью.\n\n[Mandrake](https://attack.mitre.org/software/S0485) в течение нескольких лет оставался незамеченным, предоставляя законные приложения без рекламы, социальные сети и реальные обзоры в поддержку приложений. Вредоносная программа активируется только тогда, когда операторы дают определенную команду. (Цитата: Bitdefender Mandrake)"
    },
    "S0489": {
      "name": "ВолкКрыса",
      "description": "[WolfRAT](https://attack.mitre.org/software/S0489) — это вредоносное ПО, основанное на утекшей версии [Dendroid](https://attack.mitre.org/software/S0301), которое в первую очередь нацелено на тайских пользователей. [WolfRAT](https://attack.mitre.org/software/S0489), скорее всего, управлялся ныне несуществующей организацией Wolf Research. (Цитата: Talos-WolfRAT)"
    },
    "S0490": {
      "name": "XLoader для iOS",
      "description": "[XLoader для iOS](https://attack.mitre.org/software/S0490) — вредоносное приложение для iOS, способное собирать системную информацию. (Цитата: TrendMicro-XLoader-FakeSpy). Оно отслеживается отдельно от [XLoader для Android](https://attack.mitre.org/software/S0318)."
    },
    "S0494": {
      "name": "Дзен",
      "description": "[Zen](https://attack.mitre.org/software/S0494) — вредоносное ПО для Android, которое впервые было обнаружено в 2013 году. (Цитата: Google Security Zen)"
    },
    "S0505": {
      "name": "Пустынный скорпион",
      "description": "[Desert Scorpion](https://attack.mitre.org/software/S0505) — это программа наблюдения, нацеленная на Ближний Восток, в частности на лиц, находящихся в Палестине. [Пустынный скорпион](https://attack.mitre.org/software/S0505) предположительно управлялся злоумышленником [APT-C-23](https://attack.mitre.org/groups/G1028). (Цитата: Lookout Desert Scorpion)\n\nСуществует несколько близких вариантов [Пустынного скорпиона] (https://attack.mitre.org/software/S0505), таких как VAMP (Цитата: Unit42 VAMP 2017), GnatSpy (Цитата: Trendmicro GnatSpy 2017), [FrozenCell] (https://attack.mitre.org/software/S0577) и [SpyC23](https://attack.mitre.org/software/S1195), которые добавляют некоторые дополнительные функции, но существенно не отличаются от оригинального вредоносного ПО."
    },
    "S0506": {
      "name": "ViperRAT",
      "description": "[ViperRAT](https://attack.mitre.org/software/S0506) — это сложное программное обеспечение для наблюдения, которое используется как минимум с 2015 года и использовалось для нападения на Силы обороны Израиля. (Цитата: Lookout ViperRAT)"
    },
    "S0507": {
      "name": "электронное наблюдение",
      "description": "[eSurv](https://attack.mitre.org/software/S0507) — это мобильное программное обеспечение для наблюдения, разработанное для рынка законного перехвата, которое разрабатывалось в течение многих лет. (Цитата: Lookout eSurv)"
    },
    "S0509": {
      "name": "ФейкШпион",
      "description": "[FakeSpy](https://attack.mitre.org/software/S0509) — это шпионское ПО для Android, которым управляет китайский злоумышленник, стоящий за кампаниями Roaming Mantis. (Цитата: Cybereason FakeSpy)"
    },
    "S0522": {
      "name": "Экзобот",
      "description": "[Exobot](https://attack.mitre.org/software/S0522) — это банковское вредоносное ПО для Android, нацеленное в первую очередь на финансовые учреждения в Германии, Австрии и Франции. (Цитата: Threat Fabric Exobot)"
    },
    "S0524": {
      "name": "AndroidOS/MalLocker.B",
      "description": "[AndroidOS/MalLocker.B](https://attack.mitre.org/software/S0524) — это вариант семейства программ-вымогателей, нацеленных на устройства Android. Он не позволяет пользователю взаимодействовать с пользовательским интерфейсом, отображая экран, содержащий записку о выкупе, поверх всех остальных окон. (Цитата: Microsoft MalLockerB)"
    },
    "S0525": {
      "name": "Android/AdDisplay.Ashas",
      "description": "[Android/AdDisplay.Ashas](https://attack.mitre.org/software/S0525) — это вариант рекламного ПО, которое распространяется через несколько приложений в Google Play Store. (Цитата: WeLiveSecurity AdDisplayAshas)"
    },
    "S0529": {
      "name": "CarbonSteal",
      "description": "[CarbonSteal](https://attack.mitre.org/software/S0529) — один из четырех инструментов для наблюдения, использующих общую инфраструктуру C2. [CarbonSteal](https://attack.mitre.org/software/S0529) в основном занимается аудионаблюдением. (Цитата: Уйгурская кампания Lookout)"
    },
    "S0535": {
      "name": "Золотой Кубок",
      "description": "[Golden Cup](https://attack.mitre.org/software/S0535) — это шпионское ПО для Android, которое использовалось для атак на болельщиков чемпионата мира. (Цитата: Symantec GoldenCup)"
    },
    "S0536": {
      "name": "GПроиграл",
      "description": "[GPlayed](https://attack.mitre.org/software/S0536) — Android-троян с широким набором возможностей. (Цитата: Talos GPlayed)"
    },
    "S0539": {
      "name": "Красная тревога 2.0",
      "description": "[Red Alert 2.0](https://attack.mitre.org/software/S0539) — банковский троян, маскирующийся под VPN-клиент. (Цитата: Sophos Red Alert 2.0)"
    },
    "S0540": {
      "name": "Асакуб",
      "description": "[Asacub](https://attack.mitre.org/software/S0540) — банковский троян, пытающийся украсть деньги с банковских счетов жертв. Он пытается сделать это, инициируя банковский перевод через SMS-сообщение со скомпрометированных устройств. (Цитата: Securelist Asacub)"
    },
    "S0544": {
      "name": "HenBox",
      "description": "[HenBox](https://attack.mitre.org/software/S0544) — вредоносное ПО для Android, которое пытается работать только на устройствах Xiaomi под управлением операционной системы MIUI. [HenBox](https://attack.mitre.org/software/S0544) в основном использовался для нападения на уйгуров, тюркское этническое меньшинство. (Цитата: Palo Alto HenBox)"
    },
    "S0545": {
      "name": "ТЕРРАКОТА",
      "description": "[TERRACOTTA](https://attack.mitre.org/software/S0545) — это ботнет, занимающийся мошенничеством с рекламой, который способен генерировать более 2 миллиардов мошеннических запросов в неделю. (Цитата: WhiteOps TERRACOTTA)"
    },
    "S0549": {
      "name": "ШелкБин",
      "description": "[SilkBean](https://attack.mitre.org/software/S0549) — это часть программного обеспечения для наблюдения за Android, содержащая комплексные функции инструмента удаленного доступа (RAT), который использовался для нападения на уйгурскую этническую группу. (Цитата: Lookout Uyghur Campaign)"
    },
    "S0550": {
      "name": "ДаблАгент",
      "description": "[DoubleAgent](https://attack.mitre.org/software/S0550) — это семейство RAT-вредоносных программ, созданное в 2013 году и известное целевым группам, имеющим спорные отношения с правительством Китая. (Цитата: Lookout Uyghur Campaign)"
    },
    "S0551": {
      "name": "ЗолотойОрел",
      "description": "[GoldenEagle](https://attack.mitre.org/software/S0551) — это вредоносное ПО для Android, которое использовалось для нападения на уйгуров, мусульман, тибетцев, жителей Турции и людей в Китае. Образцы были найдены еще в 2012 году. (Цитата: Lookout Uyghur Campaign)"
    },
    "S0555": {
      "name": "ХИМИЧЕСКИЕ ИГРЫ",
      "description": "[CHEMISTGAMES](https://attack.mitre.org/software/S0555) — это модульный бэкдор, развернутый [Sandworm Team](https://attack.mitre.org/groups/G0034). (Цитата: CYBERWARCON CHEMISTGAMES)"
    },
    "S0558": {
      "name": "Тик Ток Про",
      "description": "[Tiktok Pro](https://attack.mitre.org/software/S0558) — это шпионское ПО, маскирующееся под приложение TikTok. (Цитата: Zscaler TikTok Spyware)"
    },
    "S0577": {
      "name": "FrozenCell",
      "description": "[FrozenCell](https://attack.mitre.org/software/S0577) — это мобильный компонент семейства ПО для наблюдения с соответствующим компонентом для настольных компьютеров, известным как KasperAgent и [Micropsia](https://attack.mitre.org/software/S0339). (Цитата: Lookout FrozenCell)\n\nСуществует несколько близких вариантов [FrozenCell] (https://attack.mitre.org/software/S0577), таких как VAMP (Цитата: Unit42 VAMP 2017), GnatSpy (Цитата: Trendmicro GnatSpy 2017), [Desert Scorpion] (https://attack.mitre.org/software/S0505) и [SpyC23](https://attack.mitre.org/software/S1195), которые добавляют некоторые дополнительные функции, но существенно не отличаются от оригинального вредоносного ПО."
    },
    "S0602": {
      "name": "Круги",
      "description": "Сообщается, что [Circles](https://attack.mitre.org/software/S0602) использует недостатки Signaling System 7 (SS7) — набора протоколов, используемого для маршрутизации телефонных звонков, для отслеживания местоположения мобильных устройств и перехвата голосовых вызовов и SMS-сообщений. Его можно подключить к инфраструктуре телекоммуникационной компании или приобрести как облачный сервис. Сообщается, что Circles связана с группой NSO. (Цитата: CitizenLab Circles)"
    },
    "S0655": {
      "name": "ЗанятоГаспер",
      "description": "[BusyGasper](https://attack.mitre.org/software/S0655) — это шпионское ПО для Android, которое используется с мая 2016 года. Менее 10 жертв (по всей видимости, находятся в России) были заражены через физический доступ к устройству. (Цитата: SecureList BusyGasper)"
    },
    "S1054": {
      "name": "Дриник",
      "description": "[Drinik](https://attack.mitre.org/software/S1054) — это развивающийся банковский троян для Android, который был замечен в атаке на клиентов примерно 27 банков в Индии в августе 2021 года. Первоначально рассматривавшийся как похититель SMS в 2016 году, [Drinik](https://attack.mitre.org/software/S1054) вновь появился как банковский троян с более продвинутыми возможностями, включенными в последующие версии в сентябре. 2021 г. и август 2022 г. (Цитата: cyble_drinik_1022)"
    },
    "S1055": {
      "name": "АкулаБот",
      "description": "[SharkBot](https://attack.mitre.org/software/S1055) — это банковское вредоносное ПО, впервые обнаруженное в октябре 2021 года. Оно пытается инициировать денежные переводы непосредственно со взломанных устройств, злоупотребляя службами специальных возможностей. (Цитата: nccgroup_sharkbot_0322)"
    },
    "S1056": {
      "name": "ТианиШпион",
      "description": "[TianySpy](https://attack.mitre.org/software/S1056) — это мобильное вредоносное ПО, распространявшееся в основном посредством SMS-фишинга в период с 30 сентября по 12 октября 2021 года. Предполагается, что [TianySpy](https://attack.mitre.org/software/S1056) нацелен на учетные данные, связанные с веб-сайтами членства основных японских телекоммуникационных служб. (Цитата: трендmicro_tianyspy_0122)"
    },
    "S1061": {
      "name": "АннотацияEmu",
      "description": "[AbstractEmu](https://attack.mitre.org/software/S1061) — мобильное вредоносное ПО, которое впервые было замечено в Google Play и других сторонних магазинах в октябре 2021 года. Оно было обнаружено в 19 приложениях Android, из которых как минимум 7 злоупотребляли известными эксплойтами Android для получения root-прав. [AbstractEmu](https://attack.mitre.org/software/S1061) в первую очередь затронул пользователей в США, однако предполагается, что жертвы находятся в общей сложности в 17 странах. (Цитата: Lookout_abstractemu_1021)"
    },
    "S1062": {
      "name": "С.О.В.А.",
      "description": "[S.O.V.A.](https://attack.mitre.org/software/S1062) — это банковский троян для Android, который впервые был обнаружен в августе 2021 года и впоследствии был обнаружен в различных приложениях, включая банковские приложения, криптовалютные кошельки/биржи и приложения для покупок. [S.O.V.A.](https://attack.mitre.org/software/S1062), что по-русски означает «сова», содержит функции, не часто встречающиеся во вредоносных программах для Android, такие как кража сессионных файлов cookie. (Цитирование: Threafbric_sova_0921) (Цитирование: cleafy_sova_1122)"
    },
    "S1067": {
      "name": "ФлуБот",
      "description": "[FluBot](https://attack.mitre.org/software/S1067) — это многоцелевая вредоносная программа для мобильных банковских операций, которая впервые была обнаружена в Испании в конце 2020 года. В основном она распространялась в европейских странах с помощью различных фишинговых SMS-сообщений на нескольких языках. [FluBot](https://attack.mitre.org/software/S1067). (Цитата: Europol FluBot, июнь 2022 г.)"
    },
    "S1069": {
      "name": "TangleBot",
      "description": "[TangleBot](https://attack.mitre.org/software/S1069) — это вредоносное ПО для SMS, которое впервые было обнаружено в сентябре 2021 года и нацелено в первую очередь на мобильных пользователей в США и Канаде. [TangleBot](https://attack.mitre.org/software/S1069) использовал текстовые SMS-приманки о правилах и вакцинах против COVID-19, чтобы обманом заставить мобильных пользователей загрузить вредоносное ПО, аналогично кампаниям [FluBot](https://attack.mitre.org/software/S1067) с вредоносным ПО для Android. (Цитата: cloudmark_tanglebot_0921)"
    },
    "S1077": {
      "name": "птица-носорог",
      "description": "[Hornbill](https://attack.mitre.org/software/S1077) — одно из двух семейств мобильных вредоносных программ, которые, как известно, используются APT [Confucius](https://attack.mitre.org/groups/G0142). Анализ показывает, что [Hornbill](https://attack.mitre.org/software/S1077) впервые был активен в начале 2018 года. [Птица-носорог](https://attack.mitre.org/software/S1077) имеет инструменты и поведение, предполагающие более пассивную разведку. (Цитата: Lookout_hornbill_sunbird_0221)"
    },
    "S1079": {
      "name": "БУЛДСПАЙ",
      "description": "[BOULDSPY](https://attack.mitre.org/software/S1079) — вредоносное ПО для Android, обнаруженное в начале 2023 года, с возможностями наблюдения и удаленного управления. Анализ полученных данных C2 показывает, что [BOULDSPY](https://attack.mitre.org/software/S1079) в первую очередь нацелен на группы меньшинств в Иране. (Цитата: Lookout_bouldspy_0423)"
    },
    "S1080": {
      "name": "Ложные звонки",
      "description": "[Fakecalls](https://attack.mitre.org/software/S1080) — это Android-троян, впервые обнаруженный в январе 2021 года и маскирующийся под южнокорейские банковские приложения. Он имеет возможности перехватывать звонки в банковские учреждения и даже поддерживать реалистичные диалоги с жертвой, используя заранее записанные аудиофрагменты. (Цитата: kaspersky_fakecalls_0422)"
    },
    "S1082": {
      "name": "Солнечная птица",
      "description": "[Sunbird](https://attack.mitre.org/software/S1082) — одно из двух семейств мобильных вредоносных программ, которые, как известно, используются APT [Confucius](https://attack.mitre.org/groups/G0142).  Анализ показывает, что [Sunbird](https://attack.mitre.org/software/S1082) впервые был активен в начале 2017 года. Хотя [Sunbird](https://attack.mitre.org/software/S1082) и [Hornbill](https://attack.mitre.org/software/S1077) пересекаются в основных возможностях, [Sunbird](https://attack.mitre.org/software/S1082) имеет более обширный набор вредоносных функций. (Цитата: Lookout_hornbill_sunbird_0221)"
    },
    "S1083": {
      "name": "Хамелеон",
      "description": "[Chameleon](https://attack.mitre.org/software/S1083) — это банковский троян для Android, который может использовать службы специальных возможностей Android для выполнения вредоносных действий. Предполагается, что первая активность [Chameleon](https://attack.mitre.org/software/S1083) была замечена в январе 2023 года. Она нацеливалась на пользователей в Австралии и Польше, маскируясь под официальные приложения. Новый вариант [Chameleon](https://attack.mitre.org/software/S1083) расширил свои цели, включив в него пользователей Android в Великобритании и Италии. (Цитирование: cyble_chameleon_0423) (Цитирование: ThreatFabric_Chameleon_Dec2023)"
    },
    "S1092": {
      "name": "Эскобар",
      "description": "[Escobar](https://attack.mitre.org/software/S1092) — банковский троян для Android, впервые обнаруженный в марте 2021 года и предположительно являющийся новым вариантом AbereBot. (Цитата: Bleeipng Computer Escobar)"
    },
    "S1093": {
      "name": "Мухоловка",
      "description": "[FlyTrap](https://attack.mitre.org/software/S1093) — это троян для Android, впервые обнаруженный в марте 2021 года и использующий тактику социальной инженерии для компрометации учетных записей Facebook. [FlyTrap](https://attack.mitre.org/software/S1093) первоначально был обнаружен через зараженные приложения в магазине Google Play и, как полагают, затронул более 10 000 жертв как минимум в 140 странах. (Цитата: Trend Micro FlyTrap)"
    },
    "S1094": {
      "name": "БРАТА",
      "description": "[BRATA](https://attack.mitre.org/software/S1094) (бразильский инструмент удаленного доступа, Android) — это развивающийся штамм вредоносного ПО для Android, обнаруженный в конце 2018 года и снова в конце 2021 года. Возникший в Бразилии, [BRATA](https://attack.mitre.org/software/S1094) позже был также обнаружен в Великобритании, Польше, Италии, Испании и США, где, как предполагается, он был нацелен на финансовые учреждения, такие как банки. В настоящее время известны три варианта [BRATA](https://attack.mitre.org/software/S1094).(Цитирование: securelist_brata_0819)(Цитирование: cleafy_brata_0122)(Цитирование: mcafee_brata_0421)"
    },
    "S1095": {
      "name": "АхРат",
      "description": "[AhRat](https://attack.mitre.org/software/S1095) — это инструмент удаленного доступа для Android, основанный на инструменте удаленного доступа AhMyth с открытым исходным кодом. [AhRat](https://attack.mitre.org/software/S1095) первоначально распространился в августе 2022 года в Google Play Store через обновление, содержащее вредоносный код, для ранее безвредного приложения «iRecorder – Screen Recorder», которое само было выпущено в сентябре 2021 года. (Цитата: welivesecurity_ahrat_0523)"
    },
    "S1103": {
      "name": "FlixОнлайн",
      "description": "[FlixOnline](https://attack.mitre.org/software/S1103) — это вредоносное ПО для Android, впервые обнаруженное в начале 2021 года и предположительно нацеленное на пользователей WhatsApp. [FlixOnline](https://attack.mitre.org/software/S1103) в основном распространяется через автоматические ответы на входящие сообщения WhatsApp устройства. (Цитата: checkpoint_flixonline_0421)"
    },
    "S1126": {
      "name": "Фенакит",
      "description": "[Phenakite](https://attack.mitre.org/software/S1126) — это мобильное вредоносное ПО, которое используется [APT-C-23](https://attack.mitre.org/groups/G1028) для атак на устройства iOS. Согласно нескольким сообщениям, [Phenakite](https://attack.mitre.org/software/S1126) был разработан для того, чтобы заполнить пробел в инструментах и ​​нацелиться на тех, у кого были iPhone, а не настольные компьютеры с Windows или телефоны Android."
    },
    "S1128": {
      "name": "ХилалРАТ",
      "description": "[HilalRAT](https://attack.mitre.org/software/S1128) — вредоносное ПО для Android с возможностью удаленного доступа, разработанное и используемое [UNC788](https://attack.mitre.org/groups/G1029). (Цитата: Отчет о мета-адверсариальных угрозах, 2022 г.) [HilalRAT](https://attack.mitre.org/software/S1128) способен собирать данные, такие как местоположение устройства, журналы вызовов и т. д., и способен выполнять действия, такие как активация камеры и микрофона устройства. (Цитата: Meta Adversarial Threat Report 2022)"
    },
    "S1185": {
      "name": "LightSpy",
      "description": "LightSpy — это модульное семейство вредоносных программ, впервые замеченное в 2018 году. Первоначально оно было нацелено на устройства iOS в Южной Азии, а затем распространилось на платформы Android и macOS. Он состоит из загрузчика, основного исполняемого файла, который управляет сетевыми соединениями, и модулей, специфичных для функциональности, обычно реализуемых в виде файлов .dylib (iOS, macOS) или файлов .apk (Android). LightSpy может собирать записи разговоров VoIP, SMS-сообщения и хранилища учетных данных, которые затем передаются на сервер управления и контроля (C2). (Цитата: MelikovBlackBerry LightSpy 2024)"
    },
    "S1195": {
      "name": "шпионC23",
      "description": "[SpyC23](https://attack.mitre.org/software/S1195) — это мобильное вредоносное ПО, которое используется [APT-C-23](https://attack.mitre.org/groups/G1028) по крайней мере с 2017 года. [SpyC23](https://attack.mitre.org/software/S1195) был замечен в основном нацеленным на устройства Android в Среднем регионе. Восток.(Цитата: welivesecurity_apt-c-23)\n\nСуществует несколько близких вариантов [SpyC23] (https://attack.mitre.org/software/S1195), таких как VAMP (Цитата: Unit42 VAMP 2017), GnatSpy (Цитата: Trendmicro GnatSpy 2017), [Desert Scorpion] (https://attack.mitre.org/software/S0505) и [FrozenCell](https://attack.mitre.org/software/S0577), которые добавляют некоторые дополнительные функции, но существенно не отличаются от исходной вредоносной программы."
    },
    "S1208": {
      "name": "ФьордФантом",
      "description": "[FjordPhantom](https://attack.mitre.org/software/S1208) — вредоносное приложение для Android, впервые обнаруженное в сентябре 2024 года и нацеленное на Юго-Восточную Азию, в частности в Индонезию, Таиланд и Вьетнам. [FjordPhantom](https://attack.mitre.org/software/S1208) распространялся через электронную почту и приложения для обмена сообщениями. После установки приложение запускает решение виртуализации для кражи важной информации, например банковских счетов, и для манипулирования пользовательским интерфейсом. Вредоносная активность решения виртуализации происходит вместе с законными банковскими приложениями. (Цитата: Promon FjordPhantom, октябрь 2024 г.)"
    },
    "S1214": {
      "name": "Android/шпионский агент",
      "description": "[Android/SpyAgent](https://attack.mitre.org/software/S1214) — это вариант шпионского ПО в фишинговой кампании MoqHao, ориентированный в первую очередь на корейских и японских пользователей. (Цитата: McAfee MoqHao 2019) Поддельные приложения безопасности использовались для нападения на японских пользователей, а поддельные полицейские приложения использовались для корейских пользователей. Оба поддельных приложения имеют общие команды C2 и используют один и тот же ключ отчета о сбое в облачной службе. (Цитата: McAfee MoqHao 2019)."
    },
    "S1215": {
      "name": "Бинарный валидатор",
      "description": "[Двоичный валидатор] (https://attack.mitre.org/software/S1215) — это двоичный файл Mach-O, используемый во время [Операции Триангуляция] (https://attack.mitre.org/campaigns/C0054). (Цитата: SecureList OpTriangulation, 23 октября 2023 г.) [Двоичный файл Validator](https://attack.mitre.org/software/S1215) сначала собирает информацию об устройстве, такую как номер телефона устройства и список установленных приложений, перед развертыванием имплантата [TriangleDB](https://attack.mitre.org/software/S1216).  После завершения действий и сбора данных [Binary Validator](https://attack.mitre.org/software/S1215) шифрует и отправляет данные на сервер C2, а сервер C2, в свою очередь, отправляет имплант [TriangleDB](https://attack.mitre.org/software/S1216)."
    },
    "S1216": {
      "name": "ТреугольникДБ",
      "description": "[TriangleDB](https://attack.mitre.org/software/S1216) — это написанный на Objective-C имплантат, развернутый после [Binary Validator](https://attack.mitre.org/software/S1215) и после получения привилегий root во время цепочки заражения [Operation Triangulation](https://attack.mitre.org/campaigns/C0054). После выполнения [TriangleDB](https://attack.mitre.org/software/S1216) связывается с сервером C2, передавая информацию об устройстве-жертве. (Цитата: SecureList OpTriangulation, 21 июня 2023 г.)"
    },
    "S1225": {
      "name": "ЧерриБлос",
      "description": "[CherryBlos](https://attack.mitre.org/software/S1225) — вредоносное ПО для Android, которое крадет учетные данные и перенаправляет криптовалюту на кошельки, контролируемые злоумышленниками. [CherryBlos](https://attack.mitre.org/software/S1225) при первом появлении в апреле 2023 года назывался Robot 999; с тех пор использовались различные псевдонимы, включая GPTalk, Happy Miner и SynthNet. Злоумышленники, стоящие за [CherryBlos](https://attack.mitre.org/software/S1225), загрузили вредоносное ПО в различные регионы Google Play, такие как Малайзия, Вьетнам, Индонезия, Филиппины, Уганда и Мексика. (Цитата: TrendMicro_CherryBlos_July2023)"
    },
    "S1231": {
      "name": "БогОтец",
      "description": "[GodFather](https://attack.mitre.org/software/S1231) — это банковское вредоносное ПО для Android, которое использует виртуализацию для имитации законных приложений и злоупотребляет услугами специальных возможностей и другими разрешениями, чтобы избежать обнаружения и украсть конфиденциальные данные. Впервые обнаруженный в 2020 году, [GodFather](https://attack.mitre.org/software/S1231) нацелен почти на 500 банковских приложений, криптовалютных кошельков и бирж по всему миру; однако его атаки, основанные на виртуализации, в первую очередь были сосредоточены на нескольких турецких финансовых учреждениях. Эта возможность позволяет злоумышленникам красть банковские учетные данные и другую конфиденциальную информацию учетной записи. (Цитата: ZimperiumOrtegaPratapagiri_GodFather_Jun2025) (Цитата: MerkleScience_Godfather_April2023)"
    },
    "S1241": {
      "name": "КрысаМилад",
      "description": "[RatMilad](https://attack.mitre.org/software/S1241) — это инструмент удаленного доступа Android (RAT) с функциями шпионского ПО, который используется для атак на корпоративные мобильные устройства на Ближнем Востоке как минимум с 2021 года. Варианты [RatMilad](https://attack.mitre.org/software/S1241) замаскированы под VPN-приложения и поддельное приложение под названием NumRent. После установки [RatMilad](https://attack.mitre.org/software/S1241) использует несколько методов [Collection](https://attack.mitre.org/tactics/TA0035) для сбора конфиденциальной информации перед загрузкой собранных данных на свой сервер управления и контроля (C2). (Цитата: ZimperiumGupta_RatMilad_Oct2022)"
    },
    "S1243": {
      "name": "DCHSpy",
      "description": "[DCHSpy](https://attack.mitre.org/software/S1243) — это шпионское ПО для Android, которое, вероятно, используется [MuddyWater](https://attack.mitre.org/groups/G0069). [DCHSpy](https://attack.mitre.org/software/S1243) использует политические приманки и маскируется под законные приложения, такие как VPN и банковские приложения, чтобы обманом заставить жертв загрузить вредоносное ПО. После загрузки [DCHSpy](https://attack.mitre.org/software/S1243) собирает информацию с устройства и передает данные на сервер управления и контроля (C2). (Цитата: Lookout_DCHSpy_July2025)"
    }
  },
  "mitigations": {
    "M1001": {
      "name": "Обновления безопасности",
      "description": "Установите обновления безопасности в ответ на обнаруженные уязвимости.\n\nПриобретайте устройства с обязательством поставщика и/или оператора мобильной связи оперативно предоставлять обновления безопасности в течение установленного периода времени.\n\nВыведите из эксплуатации устройства, которые больше не будут получать обновления безопасности.\n\nОграничьте или заблокируйте доступ к корпоративным ресурсам с устройств, на которых не установлены последние обновления безопасности.\n\nНа устройствах Android доступ можно контролировать на основе уровня исправлений безопасности каждого устройства. На устройствах iOS доступ можно контролировать в зависимости от версии iOS."
    },
    "M1002": {
      "name": "Аттестация",
      "description": "Включите возможности удаленной аттестации, если они доступны (например, Android SafetyNet или Samsung Knox TIMA Attestation), и запретите устройствам, которые не прошли аттестацию, доступ к корпоративным ресурсам."
    },
    "M1003": {
      "name": "Блокировка загрузчика",
      "description": "На устройствах, которые обеспечивают возможность разблокировки загрузчика (следовательно, позволяя перепрограммировать на устройство любой код операционной системы), выполняйте периодические проверки, чтобы убедиться, что загрузчик заблокирован."
    },
    "M1004": {
      "name": "Целостность системного раздела",
      "description": "Убедитесь, что используемые устройства Android включают и активируют функцию проверенной загрузки, которая криптографически обеспечивает целостность системного раздела."
    },
    "M1006": {
      "name": "Использовать последнюю версию ОС",
      "description": "Новые версии мобильных операционных систем не только содержат исправления для обнаруженных уязвимостей, но также часто содержат улучшения архитектуры безопасности, которые обеспечивают устойчивость к потенциальным уязвимостям или слабостям, которые еще не были обнаружены. Они также могут принести улучшения, которые блокируют использование наблюдаемых приемов противника."
    },
    "M1009": {
      "name": "Шифрование сетевого трафика",
      "description": "Разработчики приложений должны шифровать весь сетевой трафик своих приложений с помощью протокола Transport Layer Security (TLS), чтобы обеспечить защиту конфиденциальных данных и предотвратить сетевые атаки. При желании разработчики приложений могут выполнить шифрование данных на основе сообщений перед их передачей для шифрования TLS.\n\nФункцию iOS App Transport Security можно использовать, чтобы обеспечить должную защиту всего сетевого трафика приложений. Apple намерена обязать использовать App Transport Security (Цитата: TechCrunch-ATS) для всех приложений в Apple App Store, если не будет предоставлено соответствующее обоснование.\n\nФункция настройки сетевой безопасности Android также может использоваться разработчиками приложений, чтобы обеспечить должную защиту всего сетевого трафика их приложений (Цитата: Android-NetworkSecurityConfig).\n\nИспользование туннелей виртуальной частной сети (VPN), например. использование протокола IPsec также может помочь смягчить некоторые типы сетевых атак."
    },
    "M1010": {
      "name": "Развертывание метода обнаружения скомпрометированных устройств",
      "description": "Существует множество методов, которые можно использовать, чтобы позволить предприятиям идентифицировать скомпрометированные (например, рутированные или взломанные) устройства, используя механизмы безопасности, встроенные непосредственно в устройство, сторонние приложения мобильной безопасности, возможности управления мобильностью предприятия (EMM)/управления мобильными устройствами (MDM) или другие методы. Некоторые методы могут быть простыми для уклонения, в то время как другие могут быть более сложными."
    },
    "M1011": {
      "name": "Руководство пользователя",
      "description": "Описывает любые рекомендации или обучение, предоставляемые пользователям для установки определенных параметров конфигурации или предотвращения определенных потенциально рискованных действий."
    },
    "M1012": {
      "name": "Корпоративная политика",
      "description": "Система управления мобильностью предприятия (EMM), также известная как управление мобильными устройствами (MDM), может использоваться для предоставления политик мобильным устройствам для контроля аспектов их разрешенного поведения."
    },
    "M1013": {
      "name": "Руководство для разработчиков приложений",
      "description": "Руководство для разработчиков приложений направлено на предоставление разработчикам знаний, инструментов и передового опыта, необходимых для написания безопасного кода, уменьшения уязвимостей и реализации принципов безопасного проектирования. За счет интеграции безопасности на протяжении всего жизненного цикла разработки программного обеспечения (SDLC) это смягчение направлено на предотвращение появления уязвимых мест в приложениях, системах и API. Это смягчение может быть реализовано посредством следующих мер:\n \nПредотвращение SQL-инъекции (практика безопасного кодирования):\n\n- Реализация: научите разработчиков использовать параметризованные запросы или подготовленные операторы вместо прямого внедрения пользовательского ввода в запросы SQL.\n- Вариант использования: веб-приложение принимает вводимые пользователем данные для поиска в базе данных. Обеззараживая и проверяя вводимые пользователем данные, разработчики могут предотвратить внедрение злоумышленниками вредоносных команд SQL.\n\nУстранение последствий межсайтового скриптинга (XSS):\n\n- Реализация: потребовать от разработчиков реализовать кодирование вывода для всего пользовательского контента, отображаемого на веб-странице.\n- Вариант использования: сайт электронной коммерции позволяет пользователям оставлять отзывы о продуктах. Правильное кодирование и экранирование вводимых пользователем данных предотвращает выполнение вредоносных сценариев в браузерах других пользователей.\n\nБезопасный дизайн API:\n\n- Реализация: научите разработчиков проверять подлинность всех конечных точек API и избегать раскрытия конфиденциальной информации в ответах API.\n- Вариант использования: приложение мобильного банкинга использует API для управления счетами. Применяя аутентификацию на основе токенов для каждого вызова API, разработчики снижают риск несанкционированного доступа.\n\nСтатический анализ кода в конвейере сборки:\n\n- Реализация: включение инструментов в конвейеры CI/CD для автоматического сканирования уязвимостей в процессе сборки.\n- Вариант использования: финтех-компания интегрирует инструменты статического анализа для обнаружения жестко запрограммированных учетных данных в исходном коде перед развертыванием.\n\nМоделирование угроз на этапе проектирования:\n\n- Реализация: используйте такие платформы, как STRIDE (подмена, подделка, отказ, раскрытие информации, отказ в обслуживании, повышение привилегий), для оценки угроз во время разработки приложения.\n- Вариант использования: перед запуском клиентского портала SaaS-компания выявляет потенциальные случаи злоупотреблений, такие как перехват сеанса, и разрабатывает меры по смягчению последствий, такие как безопасное управление сеансами.\n\n**Инструменты для реализации**:\n\n- Инструменты статического анализа кода: используйте инструменты, которые могут сканировать известные уязвимости в исходном коде.\n- Динамическое тестирование безопасности приложений (DAST): используйте такие инструменты, как Burp Suite или OWASP ZAP, для моделирования атак во время выполнения и выявления уязвимостей.\n- Платформы безопасности: рекомендуйте платформы безопасности по умолчанию (например, Django для Python, Spring Security для Java), которые обеспечивают соблюдение лучших практик безопасности."
    },
    "M1014": {
      "name": "Фильтрация межсоединений",
      "description": "Чтобы снизить риск использования Системы сигнализации 7 (SS7), Совет по коммуникациям, безопасности, надежности и совместимости (CSRIC) описывает фильтрацию межсетевых соединений между сетевыми операторами для блокировки нежелательных запросов (Цитата: CSRIC5-WG10-FinalReport)."
    },
    "M1058": {
      "name": "Антивирус/Антивредоносное ПО",
      "description": "Продукты мобильной безопасности, такие как Mobile Threat Defense (MTD), предлагают различные средства защиты от определенных действий на уровне устройств."
    },
    "M1059": {
      "name": "Не смягчайте",
      "description": "Эта категория предназначена для объединения методов, смягчение последствий которых может увеличить риск компрометации, и поэтому смягчение не рекомендуется."
    }
  },
  "meta": {
    "language": "ru",
    "domain": "mobile",
    "generated_at": "2026-01-10T19:37:59+00:00",
    "generator": "google translate (deep-translator)",
    "note": "Это неофициальный машинный перевод. Возможны неточности."
  }
}
